Repository: cloudera/hue
Catalog: apps/impala/src/impala/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr

source: Successfully invalidated metadata
de: Metadaten erfolgreich ungültig gemacht
es: Metadatos invalidados correctamente
fr: Métadonnées invalidées avec succès

source: Successfully refreshed metadata for `%s`.`%s`
de: Metadaten für "%s"."%s" erfolgreich aktualisiert
es: Metadatos actualizados correctamente para `%s`.`%s`
fr: Métadonnées actualisées avec succès pour '%s'.'%s'

source: get_exec_summary requires a valid query_history_id
de: "get_exec_summary" erfordert eine gültige "query_history_id"
es: get_exec_summary requiere un query_history_id válido
fr: get_exec_summary exige un query_history_id valable

source: get_runtime_profile requires a valid query_history_id
de: "get_runtime_profile" erfordert eine gültige "query_history_id"
es: get_runtime_profile requiere un query_history_id válido
fr: get_runtime_profile requiert un query_history_id valable

source: Host of the Impala Server.
de: Host des Impala-Servers.
es: Host del servidor Impala.
fr: Hôte du serveur Impala.

source: Port of the Impala Server.
de: Port des Impala-Servers.
es: Puerto del servidor Impala.
fr: Port du serveur Impala.

source: Kerberos principal name for Impala. Typically 'impala/hostname.foo.com'.
de: Kerberos-Hauptname für Impala. Typischerweise "impala/hostname.foo.com".
es: Nombre de la entidad de seguridad de Kerberos para Hue. Normalmente 'hue/hostname.foo.com'.
fr: Nom Kerberos principal pour Impala. En général 'impala/nomhôte.foo.com'.

source: Turn on/off impersonation mechanism when talking to Impala.
de: Imitationsmechanismus aktivieren/deaktivieren, wenn mit Impala kommuniziert wird.
es: Activar/desactivar mecanismo de suplantación al hablar con Impala.
fr: Activez/désactivez le mécanisme d'emprunt d'identité lorsqu'il s'agit d'Impala.

source: Number of initial rows of a resultset to ask Impala to cache in order to support re-fetching them for downloading them. Set to 0 for disabling the option and backward compatibility.
de: Zahl der Ausgangszeilen eines Ergebnissatzes, um Impala aufzufordern, sie zwischenzuspeichern, damit sie wieder abgerufen und heruntergeladen werden können. Legen Sie hier 0 fest, um die Option und Rückwärtskompatibilität zu deaktivieren.
es: Número de filas iniciales de un conjunto de resultados que se le solicitará a Impala que almacene en caché para poder volver a capturarlos y descargarlos. Se establece en 0 para desactivar la opción y tener compatibilidad con versiones anteriores.
fr: Nombre de lignes initiales d'un jeu de résultats devant être mises en cache par Impala pour permettre la prise en charge d'une nouvelle extraction afin de les télécharger. Définissez-le sur la valeur 0 pour désactiver l'option et la compatibilité descendante.

source: Timeout in seconds for Thrift calls.
de: Timeout in Sekunden für Thrift-Anrufe.
es: Tiempo de espera en segundos para llamadas de Thrift.
fr: Temporisation en secondes pour les appels Thrift.

source: Hue will try to close the Impala query when the user leaves the editor page. This will free all the query resources in Impala, but also make its results inaccessible.
de: Hue versucht, die Impala-Abfrage zu schließen, wenn der Benutzer die Editorseite verlässt. Dadurch werden alle Abfrageressourcen in Impala freigesetzt, aber auch dessen Ergebnisse werden unzugänglich.
es: Hue tratará de cerrar la consulta de Impala cuando el usuario abandone la página de editor. Así liberará todos los recursos de consulta de Impala, pero no se podrá acceder a sus resultados.
fr: Hue tente de fermer la requête Impala lorsque l'utilisateur quitte la page de l'éditeur. Toutes les ressources de requête sont ainsi libérées dans Impala, mais les résultats deviennent inaccessibles.

source: If QUERY_TIMEOUT_S > 0, the query will be timed out (i.e. cancelled) if Impala does not do any work (compute or send back results) for that query within QUERY_TIMEOUT_S seconds.
de: Wenn QUERY_TIMEOUT_S > 0, wird die Abfrage abgebrochen, wenn keine Aktivität von Impala (Berechnen oder Senden von Ergebnissen) mit dieser Abfrage innerhalb von QUERY_TIMEOUT_S Sekunden stattfindet.
es: Si QUERY_TIMEOUT_S > 0, se superará el tiempo de espera de la consulta (es decir, se cancelará) si Impala no realiza ninguna acción (calcula o devuelve resultados) para esa consulta en el plazo de QUERY_TIMEOUT_S segundos.
fr: Si QUERY_TIMEOUT_S > 0, la requête expire (est annulée) lorsqu'Impala n'effectue aucune tâche (traitement ou renvoi de résultats) pour cette requête dans un délai de QUERY_TIMEOUT_S secondes.

source: If SESSION_TIMEOUT_S > 0, the session will be timed out (i.e. cancelled) if Impala does not do any work (compute or send back results) for that session within QUERY_TIMEOUT_S seconds. Default: 1 hour.
de: Wenn SESSION_TIMEOUT_S > 0, findet ein Timeout für die Sitzung statt (d. h. sie wird abgebrochen), wenn keine Aktivität von Impala (Berechnen oder Senden von Ergebnissen) für diese Sitzung innerhalb von QUERY_TIMEOUT_S Sekunden stattfindet. Standardeinstellung: 1 Stunde.
es: Si SESSION_TIMEOUT_S > 0, se superará el tiempo de espera de la sesión (es decir, se cancelará) si Impala no realiza ninguna acción (calcula o devuelve resultados) para esa sesión en el plazo de QUERY_TIMEOUT_S segundos. Predeterminado: 1 hora.
fr: Si SESSION_TIMEOUT_S > 0, la session expire (est annulée) si Impala n'effectue aucune tâche (calcul ou renvoi de résultats) pour cette session dans un délai de QUERY_TIMEOUT_S secondes. Valeur par défaut : 1 heure.

source: A comma-separated list of white-listed Impala configuration properties that users are authorized to set.
de: Eine Komma-getrennte Liste der zulässigen Impala-Konfigurationseigenschaften, die Benutzer festlegen können.
es: Una lista separada por comas de propiedades de configuración de lista blanca de Impala que los usuarios están autorizados a establecer.
fr: Liste de valeurs séparées par des virgules des propriétés de configuration d'Impala en liste blanche, que les utilisateurs sont autorisés à définir.

source: SSL configuration for the server.
de: SSL-Konfiguration für den Server.
es: Configuración de SSL para el servidor.
fr: Configuration SSL pour le serveur.

source: SSL communication enabled for this server.
de: SSL-Kommunikation für diesen Server aktiviert.
es: Comunicación de SSL activada para este servidor.
fr: Communication SSL activée pour ce serveur.

source: Path to Certificate Authority certificates.
de: Pfad zu den Zertifikatberechtigungen.
es: Ruta a los certificados de la autoridad certificadora.
fr: Chemin d'accès vers les certificats de l'Autorité de certification.

source: Path to the private key file, e.g. /etc/hue/key.pem
de: Pfad zur Privatschlüsseldatei, z. B. /etc/hue/key.pem
es: Ruta al archivo de clave privada, p. ej., /etc/hue/key.pem
fr: Chemin d'accès au fichier de clé privée, par ex. /etc/hue/key.pem

source: Path to the public certificate file, e.g. /etc/hue/cert.pem
de: Pfad zur öffentlichen Zertifikatdatei, z. B. /etc/hue/cert.pem
es: Ruta al archivo de certificado público, p. ej., /etc/hue/cert.pem
fr: Chemin d'accès au fichier de certificat public, par ex. /etc/hue/cert.pem

source: Choose whether Hue should validate certificates received from the server.
de: Legen Sie fest, ob Hue die vom Server empfangenen Zertifikate prüfen soll.
es: Elija si Hue debe validar los certificados que reciba del servidor.
fr: Indiquez si Hue doit valider les certificats reçus du serveur.

source: Auth username of the hue user used for authentications.
de: Der für Authentifizierungen verwendete auth-Benutzername des Hue-Benutzers
es: Nombre de usuario de autenticación del usuario de Hue que se utiliza para las autenticaciones.
fr: Nom de l'utilisateur Hue utilisé pour les authentifications.

source: LDAP/PAM/.. password of the hue user used for authentications.
de: LDAP/PAM/..-Kennwort des für Authentifizierungen verwendeten Hue-Benutzers.
es: Contraseña de LDAP/PAM del usuario de Hue que se utiliza para las autenticaciones.
fr: Mot de passe LDAP/PAM.. de l'utilisateur Hue utilisé pour les authentifications.

source: Execute this script to produce the auth password. This will be used when `auth_password` is not set.
de: Führen Sie dieses Skript aus, um das auth-Kennwort zu generieren. Dieses wird verwendet, wenn "auth_password" nicht festgelegt ist.
es: Ejecute esta secuencia de comandos para generar la contraseña de autenticación. Se utilizará cuando `auth_password` no esté definido.
fr: Exécutez ce script pour générer le mot de passe d'authentification. Il sera utilisé si 'auth_password' n'est pas défini.

source: Page saved !
de: Seite gespeichert!
es: ¡Página guardada!
fr: Page enregistrée !

source: There is no dashboard to search.
de: Es ist kein zu durchsuchendes Dashboard vorhanden.
es: No hay panel para buscar.
fr: Aucun tableau de bord à rechercher.

source: Grid Results
de: Rasterergebnisse
es: Resultados de cuadrícula
fr: Résultats de la grille

source: Text Facet
de: Textfacette
es: Faceta de texto
fr: Facette de texte

source: Pie Chart
de: Kreisdiagramm
es: Gráfico circular
fr: Diagramme circulaire

source: Bar Chart
de: Balkendiagramm
es: Gráfico de barras
fr: Histogramme

source: Line Chart
de: Liniendiagramm
es: Gráfico de líneas
fr: Courbe

source: Timeline
de: Zeitleiste
es: Escala de tiempo
fr: Chronologie

source: Filter Bar
de: Filterleiste
es: Barra de filtro
fr: Barre de filtre

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier

source: Save
de: Speichern
es: Guardar
fr: Enregistrer

source: Saving...
de: Es wird gespeichert...
es: Guardando...
fr: Enregistrement en cours...

source: New
de: Neu
es: Nuevo
fr: Nouveau

source: Select a database and a table
de: Datenbank und Tabelle auswählen
es: Seleccione una base de datos y una tabla
fr: Sélectionner une base de données et une table

source: Choose a database...
de: Datenbank auswählen...
es: Seleccionar una base de datos...
fr: Choisir une base de données...

source: Choose a table...
de: Tabelle auswählen...
es: Seleccionar una tabla...
fr: Choisir une table...

source: Manually refresh the dropdowns
de: Dropdown-Menüs manuell aktualisieren
es: Actualice manualmente las listas desplegables
fr: Actualiser manuellement les listes déroulantes

source: Search
de: Suche
es: Buscar
fr: Rechercher

source: Filter fields
de: Filterfelder
es: Campos de filtro
fr: Champs de filtre

source: Field Name
de: Feldname
es: Nombre de campo
fr: Nom du champ

source: Your search did not match any documents.
de: Bei Ihrer Suche wurden keine Dokumente gefunden.
es: La búsqueda no ha coincidido con ningún documento.
fr: Votre recherche n'a donné aucun résultat parmi les documents.

source: Exclude this value
de: Diesen Wert ausschließen
es: Excluir este valor
fr: Exclure cette valeur

source: There are currently no filters applied.
de: Derzeit sind keine Filter angewendet.
es: No hay ningún filtro aplicado actualmente.
fr: Aucun filtre n'est actuellement appliqué.

source: field
de: Feld
es: campo
fr: champ

source: value
de: Wert
es: valor
fr: valeur

source: from
de: von
es: de
fr: de

source: to
de: bis
es: a
fr: vers

source: Oops, no database found!
de: Keine Datenbank gefunden!
es: No se ha encontrado ninguna base de datos.
fr: Désolé, aucune base de données n'a été trouvée.

source: Oops, no table found!
de: Keine Datenbank gefunden!
es: No se ha encontrado ninguna tabla.
fr: Désolé, aucune table n'a été trouvée.
