Repository: cloudera/hue
Catalog: apps/zookeeper/src/zookeeper/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Could not correctly connect to Zookeeper.
fr: Impossible de se connecter correctement à ZooKeeper.

source: You are not a superuser
fr: Vous n'êtes pas superutilisateur

source: Host
fr: Hôte

source: Interest Ops
fr: Op d'intérêt

source: Queued
fr: Mis en file d'attente

source: Received
fr: Reçu

source: Sent
fr: Envoyé

source: Home
fr: Accueil

source: New Znode
fr: Nouveau Znode

source: Create Znode
fr: Créer un Znode

source: Cancel
fr: Annuler

source: Edit Znode
fr: Modifier un Znode

source: Save
fr: Enregistrer

source: View
fr: Afficher

source: There are currently no clusters to browse.
fr: Il n'existe actuellement aucun cluster à parcourir.

source: Please contact your administrator to solve this.
fr: Contactez votre administrateur pour résoudre ce problème.

source: Znode Hierarchy
fr: Hiérarchie Znode

source: Node
fr: Nœud

source: Role
fr: Rôle

source: Avg Latency
fr: Latence moy

source: Watch Count
fr: Observer le décompte

source: Go to cluster
fr: Accéder au cluster

source: Zookeeper icon
fr: Icône ZooKeeper

source: ZooKeeper Browser
fr: Navigateur ZooKeeper

source: No children available
fr: Aucun enfant disponible

source: Add
fr: Ajouter

source: Are you sure you want to delete %s?
fr: Voulez-vous vraiment supprimer %s ?

source: Remove current ZNode
fr: Supprimer le ZNode actuel

source: Text
fr: Texte

source: Stats
fr: Statistiques

source: Edit as Text
fr: Modifier en tant que texte

source: Edit as Base64
fr: Modifier en tant que Base64

source: Close
fr: Fermer

source: Delete Znode?
fr: Supprimer le Znode ?

source: Yes, delete it!
fr: Oui, supprimer cet élément.

source: Key
fr: Clé

source: Value
fr: Valeur

source: Latency
fr: Latence

source: Avg:
fr: Moy. :

source: Packets
fr: Paquets

source: Sent:
fr: Envoyé :

source: Received:
fr: Reçu :

source: Outstanding Requests
fr: Requêtes en suspens

source: Open FD Count
fr: Ouvrir le nombre FD

source: Max FD Count
fr: Nombre FD max.

source: View Znode Hierarchy
fr: Afficher la hiérarchie Znode

source: General
fr: Général

source: ZNode Count
fr: Nombre de Znodes

source: Ephemerals Count
fr: Nombre d'éphémères

source: Approximate Data Size
fr: Taille de données estimée

source: Client Connections
fr: Connexions client

source: Followers
fr: Abonnés

source: Synced Followers
fr: Abonnés synchronisés

source: Pending Syncs
fr: Synchronisations en attente

source: follower
fr: abonné
