{"body":"<div><p>\n      When enabled, causes any DDL operation such as <span class=\"sql-docs-inline-code\">CREATE TABLE</span>  or <span class=\"sql-docs-inline-code\">ALTER TABLE</span> \n      to return only when the changes have been propagated to all other Impala nodes in the cluster by the Impala\n      catalog service. That way, if you issue a subsequent <span class=\"sql-docs-inline-code\">CONNECT</span>  statement in\n      <span class=\"sql-docs-inline-code\">impala-shell</span>  to connect to a different node in the cluster, you can be sure that other\n      node will already recognize any added or changed tables. (The catalog service automatically broadcasts the\n      DDL changes to all nodes automatically, but without this option there could be a period of inconsistency if\n      you quickly switched to another node, such as by issuing a subsequent query through a load-balancing proxy.)\n    </p> <p>\n      Although <span class=\"sql-docs-inline-code\">INSERT</span>  is classified as a DML statement, when the <span class=\"sql-docs-inline-code\">SYNC_DDL</span>  option\n      is enabled, <span class=\"sql-docs-inline-code\">INSERT</span>  statements also delay their completion until all the underlying data and\n      metadata changes are propagated to all Impala nodes. Internally, Impala inserts have similarities with DDL\n      statements in traditional database systems, because they create metadata needed to track HDFS block locations\n      for new files and they potentially add new partitions to partitioned tables.\n    </p> <div class=\"sql-docs-note\">\n      Because this option can introduce a delay after each write operation, if you are running a sequence of\n      <span class=\"sql-docs-inline-code\">CREATE DATABASE</span> , <span class=\"sql-docs-inline-code\">CREATE TABLE</span> , <span class=\"sql-docs-inline-code\">ALTER TABLE</span> ,\n      <span class=\"sql-docs-inline-code\">INSERT</span> , and similar statements within a setup script, to minimize the overall delay you can\n      enable the <span class=\"sql-docs-inline-code\">SYNC_DDL</span>  query option only near the end, before the final DDL statement.\n    </div> <p id=\"../Impala/docs/topics/impala_sync_ddl.xml_type_boolean\"><b>Type:</b>  Boolean; recognized values are 1 and 0, or <span class=\"sql-docs-inline-code\">true</span>  and <span class=\"sql-docs-inline-code\">false</span> ;\n        any other value interpreted as <span class=\"sql-docs-inline-code\">false</span> </p> <p id=\"../Impala/docs/topics/impala_sync_ddl.xml_default_false_0\"><b>Default:</b> <span class=\"sql-docs-inline-code\">false</span>  (shown as 0 in output of <span class=\"sql-docs-inline-code\">SET</span>  statement)\n      </p> <p id=\"../Impala/docs/topics/impala_sync_ddl.xml_related_info\"><b>Related information:</b> </p> <p><a href=\"javascript: void(0);\" class=\"lang-ref-link\" data-target=\"topics/impala_ddl.xml#ddl\">DDL Statements</a></p> </div> ","title":"SYNC_DDL Query Option"}