{"body":"<div><p>\n      With Impala, you work with schema objects that are familiar to database users: primarily databases, tables, views,\n      and functions. The SQL syntax to work with these objects is explained in\n      <a href=\"javascript: void(0);\" class=\"lang-ref-link\" data-target=\"topics/impala_langref_sql.xml#langref_sql\">Impala SQL Statements</a>. This section explains the conceptual knowledge you need to\n      work with these objects and the various ways to specify their names.\n    </p> <p>\n      Within a table, partitions can also be considered a kind of object. Partitioning is an important subject for\n      Impala, with its own documentation section covering use cases and performance considerations. See\n      <span>partitioning</span> for details.\n    </p> <p>\n      Impala does not have a counterpart of the <q>tablespace</q>  notion from some database systems. By default,\n      all the data files for a database, table, or partition are located within nested folders within the HDFS file\n      system. You can also specify a particular HDFS location for a given Impala table or partition. The raw data\n      for these objects is represented as a collection of data files, providing the flexibility to load data by\n      simply moving files into the expected HDFS location.\n    </p> <p>\n      Information about the schema objects is held in the\n      <span>metastore</span> database. This database is shared between\n      Impala and Hive, allowing each to create, drop, and query each other's databases, tables, and so on. When\n      Impala makes a change to schema objects through a <span class=\"sql-docs-inline-code\">CREATE</span> , <span class=\"sql-docs-inline-code\">ALTER</span> ,\n      <span class=\"sql-docs-inline-code\">DROP</span> , <span class=\"sql-docs-inline-code\">INSERT</span> , or <span class=\"sql-docs-inline-code\">LOAD DATA</span>  statement, it broadcasts those\n      changes to all nodes in the cluster through the <span>catalog\n      service</span>. When you make such changes through Hive or directly through manipulating HDFS files, you use\n      the <a href=\"javascript: void(0);\" class=\"lang-ref-link\" data-target=\"topics/impala_refresh.xml#refresh\">REFRESH</a> or\n      <a href=\"javascript: void(0);\" class=\"lang-ref-link\" data-target=\"topics/impala_invalidate_metadata.xml#invalidate_metadata\">INVALIDATE METADATA</a> statements on the\n      Impala side to recognize the newly loaded data, new tables, and so on.\n    </p> </div> ","title":"Impala Schema Objects and Object Names"}