Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: A POST request is required.
de: Eine POST-Anforderung ist erforderlich.
es: Se necesita una solicitud POST.
fr: Requête POST requise.
ja: POST 要求が必要です。
ko: POST 요청이 필요합니다.
zh_cn: 需要 POST 请求。

source: Bad status for request %s: %s
de: Falscher Status für Anforderung %s: %s
es: Estado incorrecto de la solicitud %s: %s
fr: État incorrect de la requête %s : %s
ja: 要求 %s のステータスが正しくありません： %s
ko: 잘못된 %s 요청 상태: %s
zh_cn: 请求 %s 的状态错误： %s

source: There was an error with your query.
de: Bei Ihrer Anfrage ist ein Fehler aufgetreten.
es: Se ha producido un error en la consulta.
fr: Une erreur est survenue avec votre requête.
ja: クエリにエラーがありました。
ko: 쿼리에 오류가 있습니다.
zh_cn: 您的查询存在错误。

source: A GET request is required.
de: Eine GET-Anforderung ist erforderlich.
es: Se necesita una solicitud GET.
fr: Requête GET requise.
ja: GET 要求が必要です。
ko: GET 요청이 필요합니다.
zh_cn: 需要 GET 请求。

source: This query is %(state)s. Results unavailable.
de: Diese Abfrage hat %(state)s. Ergebnisse nicht verfügbar.
es: Esta consulta es %(state)s. Resultados no disponibles.
fr: Cette requête est à l'état %(state)s. Résultats non disponibles.
ja: このクエリの状態は %(state)s です。結果は得られません。
ko: 이 쿼리는 %(state)s 상태이므로 결과를 볼 수 없습니다.
zh_cn: 此查询为 %(state)s。结果不可用。

source: The result could not be saved: %s.
de: Das Ergebnis konnte nicht gespeichert werden: %s.
es: El resultado no se ha podido guardar: %s.
fr: Le résultat n'a pas pu être enregistré : %s.
ja: 結果を保存できませんでした：%s。
ko: 결과를 저장할 수 없음: %s.
zh_cn: 无法保存结果：%s。

source: Cannot find query handle and state: %s
de: Handle für Abfrage und Status nicht gefunden: %s
es: No se ha encontrado el control y el estado de una solicitud: %s
fr: Impossible de trouver le descripteur et l'état de la requête : %s
ja: クエリハンドルおよび状態が見つかりません：%s
ko: 쿼리 핸들 및 상태를 찾을 수 없음: %s
zh_cn: 无法找到查询句柄和状态：%s

source: The target path is a directory
de: Der Zielpfad ist ein Verzeichnis
es: La ruta de destino es un directorio
fr: Le chemin cible est un répertoire
ja: ターゲットパスはディレクトリです
ko: 대상 경로가 디렉토리입니다.
zh_cn: 目标路径是一个目录

source: Failed to get sample data.
de: Beispieldaten konnten nicht abgerufen werden.
es: Error al obtener datos de ejemplo.
fr: Echec de l'obtention des données d'exemple.
ja: サンプルデータの取得に失敗しました。
ko: 샘플 데이터를 가져올 수 없습니다.
zh_cn: 无法获取示例数据

source: Failed to get indexes.
de: Indizes konnten nicht abgerufen werden.
es: Error al obtener índices.
fr: Impossible d'accéder aux index.
ja: インデックスの取得に失敗しました。
ko: 인덱스를 가져올 수 없습니다.
zh_cn: 无法获取索引。

source: Failed to get settings.
de: Einstellungen konnten nicht abgerufen werden.
es: Error al obtener ajustes.
fr: Impossible d'accéder aux paramètres.
ja: 設定の取得に失敗しました。
ko: 설정을 가져올 수 없습니다.
zh_cn: 无法获取设置。

source: Failed to get functions.
de: Funktionen konnten nicht abgerufen werden.
es: Error al obtener funciones.
fr: Impossible d'accéder aux fonctions.
ja: 関数の取得に失敗しました。
ko: 함수를 가져올 수 없습니다.
zh_cn: 无法获取函数。

source: Could not find session or no open sessions found.
de: Sitzung nicht gefunden oder keine offenen Sitzungen gefunden.
es: No se ha podido encontrar la sesión o no se han encontrado sesiones abiertas.
fr: Session introuvable ou aucune session ouverte.
ja: セッションが見つかりませんでした。またはオープンしているセッションが見つかりません。
ko: 세션을 찾을 수 없거나 열린 세션을 찾을 수 없습니다.
zh_cn: 找不到会话或打开会话。

source: Session does not exist or you do not have permissions to close the session.
de: Sitzung ist nicht vorhanden oder Sie sind nicht berechtigt, die Sitzung zu schließen.
es: La sesión no existe o no tiene permisos para cerrarla.
fr: La session n'existe pas ou vous n'avez pas l'autorisation de fermer la session.
ja: セッションが存在しないか、セッションをクローズする権限がありません。
ko: 세션이 없거나 세션을 닫을 권한이 없습니다.
zh_cn: 会话不存在或您没有关闭会话的权限。

source: Session successfully closed.
de: Sitzung erfolgreich geschlossen.
es: La sesión se ha cerrado correctamente.
fr: Session fermée avec succès.
ja: セッションが正常にクローズされました。
ko: 세션을 성공적으로 닫았습니다.
zh_cn: 会话已成功关闭。

source: Problem accessing table metadata
de: Problem beim Zugriff auf Metadaten der Tabelle
es: Problema al acceder a los metadatos de tabla
fr: Impossible d'accéder aux métadonnées de la table
ja: テーブルメタデータへのアクセス中に問題が発生しました
ko: 테이블 메타데이터를 액세스하는 중 오류 발생
zh_cn: 访问表元数据时出现问题

source: Failed to authenticate to query server, check authentication configurations.
de: Authentifizierung beim Abfrageserver nicht möglich. Prüfen Sie die Authentifizierungskonfiguration.
es: Error al autenticar con al servidor de consultas. Compruebe las configuraciones de autenticación.
fr: Authentification auprès du serveur de requêtes impossible. Vérifiez les configurations d'authentification.
ja: クエリサーバーへの認証に失敗しました。認証設定を確認してください。
ko: 쿼리 서버에 인증할 수 없습니다. 인증 구성을 확인하십시오.
zh_cn: 无法对查询服务器进行验证，请检查身份验证配置。

source: Unable to access databases, Query Server or Metastore may be down.
de: Zugriff auf Datenbanken nicht möglich. Möglicherweise sind der Abfrageserver oder Metastore nicht verfügbar.
es: No se puede acceder a las bases de datos. Es posible que el servidor de consultas o Metastore estén inactivos.
fr: Impossible d'accéder aux bases de données. Le serveur de requêtes ou Metastore est peut-être en panne.
ja: データベースにアクセスできません。クエリサーバーまたは Metastore がダウンしている可能性があります。
ko: 데이터베이스에 액세스할 수 없습니다. 쿼리 서버 또는 Metastore가 작동하지 않을 수 있습니다.
zh_cn: 无法访问数据库，查询服务器或元存储可能关闭。

source: No databases are available. Permissions could be missing.
de: Keine Datenbanken verfügbar. Möglicherweise fehlen Berechtigungen.
es: No hay bases de datos disponibles. Puede que falten los permisos.
fr: Aucune base de données n'est disponible. Des autorisations peuvent être manquantes.
ja: データベースを使用できません。権限がない可能性があります。
ko: 데이터베이스를 사용할 수 없습니다. 권한이 없습니다.
zh_cn: 无可用数据库。可能缺少权限。

source: Host where HiveServer2 server is running. If Kerberos security is enabled, the fully-qualified domain name (FQDN) is required
de: Host, auf dem der HiveServer2-Server ausgeführt wird. Wenn die Kerberos-Sicherheit aktiviert ist, ist der vollqualifizierte Domänenname (FQDN) erforderlich.
es: Host en que se está ejecutando el servidor HiveServer2. Si se activa la seguridad Kerberos, se necesitará el nombre de dominio completamente cualificado (FQDN)
fr: Hôte sur lequel le serveur HiveServer2 s'exécute. Si la sécurité Kerberos est activée, le nom FQDN est requis
ja: HiveServer2 サーバーが実行されているホストです。Kerberos セキュリティが有効になっている場合、完全修飾ドメイン名（FQDN）が必要です
ko: HiveServer2 서버가 실행 중인 호스트입니다. Kerberos 보안이 설정된 경우 FQDN(정규화된 도메인 이름)이 필요합니다.
zh_cn: 运行 HiveServer2 的主机。如果已启用 Kerberos 安全性，则需要完全限定域名 (FQDN)

source: Configure the port the HiveServer2 server runs on.
de: Konfigurieren Sie den Port, auf dem der HiveServer2-Server läuft.
es: Configure el puerto en el que se ejecuta el servidor HiveServer2.
fr: Configurez le port sur lequel le serveur HiveServer2 s'exécute.
ja: HiveServer2 サーバーが実行されているポートを設定します。
ko: HiveServer2 서버가 실행되는 포트를 구성합니다.
zh_cn: 配置运行 HiveServer2 服务器的端口。

source: Hive configuration directory, where hive-site.xml is located.
de: Verzeichnis der Hive-Konfiguration, in dem sich hive-site.xml befindet.
es: Directorio de configuración de hive, donde está hive-site.xml.
fr: Répertoire de configuration de Hive, contenant le fichier hive-site.xml.
ja: hive-site.xml を保存する Hive の設定ディレクトリ。
ko: hive-site.xml이 위치한 Hive 구성 디렉토리입니다.
zh_cn: Hive 配置目录，即 hive-site.xml 的所在位置。

source: Path to HiveServer2 start script
de: Pfad zum HiveServer2-Startskript
es: Ruta a la secuencia de comandos de inicio de HiveServer2
fr: Chemin d'accès vers le script de démarrage HiveServer2
ja: HiveServer2 起動スクリプトへのパス
ko: HiveServer2 시작 스크립트 경로
zh_cn: HiveServer2 启动脚本的路径

source: The local filesystem path containing the Hive examples.
de: Der Pfad im lokalen Dateisystem, in dem die Hive-Beispiele enthalten sind.
es: Ruta al sistema de archivos local que contiene los ejemplos de Hive.
fr: Chemin d'accès au système de fichiers local contenant les exemples Hive.
ja: Hive のサンプルを保存しているローカルファイルシステムのパス。
ko: Hive 예제가 포함된 로컬 파일 시스템 경로입니다.
zh_cn: 包含 Hive 示例的本地文件系统路径。

source: Timeout in seconds for Thrift calls.
de: Timeout in Sekunden für Thrift-Anrufe.
es: Tiempo de espera en segundos para llamadas de Thrift.
fr: Temporisation en secondes pour les appels Thrift.
ja: Thrift コールのタイムアウト時間（秒）。
ko: Thrift 호출의 제한 시간(단위: 초)입니다.
zh_cn: Thrift 调用的超时时间（以秒为单位）。

source: Choose whether to use the old GetLog() thrift call from before Hive 0.14 to retrieve the logs.If false, use the FetchResults() thrift call from Hive 1.0 or more instead.
de: Legen Sie fest, ob Hue den alten Thrift-Aufruf "GetLog()" aus Versionen vor Hive 0.14 zum Abrufen der Protokolle verwendet. Wenn dies nicht aktiviert ist (False), verwenden Sie stattdessen den Thrift-Aufruf "FetchResults()" aus Hive 1.0 oder höher.
es: Elija si desea usar utilizar la llamada antigua GetLog() de Thrift anterior a Hive 0.14 para recuperar los registros. Si está establecido en false, utilice en su lugar la llamada FetchResults() de Thrift de Hive 1.0 o superior.
fr: Indiquez s'il faut utiliser l'ancien appel Thrift GetLog() avant que Hive 0.14 ne récupère les journaux. Si la valeur est False, utilisez l'appel Thrift FetchResults() de Hive 1.0 ou ultérieur à la place.
ja: Hive 0.14 よりも前の古い GetLog() Thrift コールを使用してログを取得するかどうかを選択します。false の場合、代わりに Hive 1.0 以上の FetchResults() Thrift コールを使用します。
ko: Hive 0.14 이전의 이전 GetLog() thrift 호출을 사용하여 로그를 검색할 것인지 선택합니다. False로 설정되면 Hive 1.0 이상의 FetchResults() thrift 호출을 대신 사용합니다.
zh_cn: 选择是否使用旧 GetLog() thrift 调用（Hive 0.14 前）来检索日志。如果为 false，则使用 FetchResults() thrift 调用（Hive 1.0 或其他）。

source: Limit the number of partitions to list on the partitions page. A positive value will be set as the LIMIT. If 0 or negative, do not set any limit.
de: Begrenzen Sie die Anzahl der Partitionen, die auf der Partitionsseite angezeigt werden. Ein positiver Wert wird als das LIMIT gesetzt. Wenn 0 oder negativ, wird kein Limit gesetzt.
es: Limita el número de particiones que se debe enumerar en la página de particiones. Se establecerá un valor positivo como LIMIT. Si el valor es 0 o negativo, no establezca ningún límite.
fr: Limitez le nombre de partitions à afficher dans la page de partitions. Une valeur positive sera définie comme LIMIT. Si la valeur est 0 ou négative, elle ne définit aucune limite.
ja: パーティションページにリストするパーティション数を制限します。LIMIT に正の値を設定します。0 または負の値の場合、制限は設定されません。
ko: 파티션 페이지에 표시할 파티션 수를 제한합니다. 양수 값은 LIMIT로 설정됩니다. 0 또는 음수이면 제한이 설정되지 않습니다.
zh_cn: 限制在分区页面上列出的分区数。数值为正则将其设置为 LIMIT。如果为 0 或为负，则请勿设置任何限制。

source: The maximum number of partitions that will be included in the SELECT * LIMIT sample query for partitioned tables.
de: Die maximale Anzahl an Partitionen, die in die Beispielabfrage SELECT * LIMIT für partitionierte Tabellen aufgenommen wird.
es: El número máximo de particiones que se incluirá en la consulta de ejemplo SELECT * LIMIT de las tablas particionadas.
fr: Nombre maximum de partitions à inclure dans l'exemple de requête SELECT * LIMIT pour des tables partitionnées.
ja: パーティション化されたテーブルを対象として、 SELECT * LIMIT サンプルクエリに含まれるパーティションの最大数です。
ko: 파티션된 테이블에 대한 SELECT * LIMIT 샘플 쿼리에 포함될 최대 파티션 수입니다.
zh_cn: 最大分区数将包括在分区表的 SELECT * LIMIT 示例查询中。

source: Limit the number of partitions that can be listed. A positive value will be set as the LIMIT.
de: Begrenzen Sie die Anzahl der Partitionen, die aufgelistet werden können. Es muss ein positiver Wert als das LIMIT gesetzt werden.
es: Limita el número de particiones que se pueden enumerar. Se establecerá un valor positivo como LIMIT.
fr: Limitez le nombre de partitions à répertorier. Une valeur positive définit la LIMIT.
ja: リストできるパーティション数を制限します。LIMIT には正の値が設定されます。
ko: 표시할 수 있는 파티션 수를 제한합니다. 양수 값은 LIMIT로 설정됩니다.
zh_cn: 限制可列出的分区数。数值为正则将其设置为 LIMIT。

source: A limit to the number of cells (rows * columns) that can be downloaded from a query (e.g. - 10K rows * 1K columns = 10M cells.) A value of -1 means there will be no limit.
de: Ein Limit für die Anzahl an Zellen (Zeilen * Spalten), die über eine Query heruntergeladen werden können (z. B. - 10K Zeilen * 1K Spalten = 10M Zellen). Ein Wert von -1 bedeutet, dass kein Limit gesetzt wurde.
es: Un límite del número de celdas (filas * columnas) que se puede descargar de una consultad (p. Ej., - 10 000 filas * 1000 columnas = 10 000 000 de celdas.) Un valor de -1 significa que no habrá límite.
fr: Limite au nombre de cellules (lignes * colonnes) pouvant être téléchargées à partir d'une requête (par ex., 10 000 lignes * 1 000 colonnes = 10 000 000 cellules). La valeur -1 signifie aucune limite.
ja: クエリからダウンロードできるセル数（行 * 列）の制限です。例えば、10K 行 * 1K 列 = 10M セルです。-1 の値は制限がないことを表します。
ko: 쿼리에서 다운로드할 수 있는 셀 수(행 * 열)에 대한 제한입니다(예: 10,000개 행 * 1,000개 열 = 1,000만 개 셀). 값이 -1이면 제한이 없음을 의미합니다.
zh_cn: 可从查询下载单元（行*列）数的限制（例如 - 10K 行 * 1K 列 = 10M 单元）。数值 -1 意味着没有限制。

source: A limit to the number of rows that can be downloaded from a query before it is truncated. A value of -1 means there will be no limit.
de: Ein Limit für die Anzahl an Zeilen, die über eine Abfrage heruntergeladen werden können, bevor sie verkürzt wird. Ein Wert von -1 bedeutet, dass es kein Limit gibt.
es: Un límite del número de filas que se puede descargar de una consulta antes de que se trunque. Un valor de -1 significa que no habrá limite.
fr: Nombre maximal de lignes pouvant être téléchargées à partir d'une requête avant sa troncation. La valeur -1 signifie aucune limite.
ko: 잘리기 전에 쿼리에서 다운로드할 수 있는 행 수에 대한 제한입니다. 값이 -1이면 제한이 없음을 의미합니다.

source: The max number of records in the result set permitted to apply a natural sort to the database or tables list.
de: Die maximale Anzahl an Datensätzen im Ergebnis, die eine natürliche Sortierung auf die Datenbank- oder Tabellenliste anwenden dürfen.
es: El número máximo de registros en el conjunto de resultados con permiso para aplicar una clasificación natural a la base de datos a la lista de tablas.
fr: Nombre maximum d'enregistrements permis dans le jeu de résultats pour appliquer un tri naturel à la base de données où à la liste de tables.
ja: 自然なソートをデータベースまたはテーブルリストに適用するために許可された結果セットの最大レコード数です。
ko: 데이터베이스 또는 테이블 목록에 자연적인 정렬을 적용하도록 허용된 결과 세트의 최대 레코드 수입니다.
zh_cn: 结果集中允许对数据库或表列表应用自然排序的最大记录数。

source: Hue will try to close the Hive query when the user leaves the editor page. This will free all the query resources in HiveServer2, but also make its results inaccessible.
de: Hue versucht, die Hive-Abfrage zu schließen, wenn der Benutzer die Editorseite verlässt. Dadurch werden alle Abfrageressourcen in HiveServer2 freigesetzt, aber auch dessen Ergebnisse werden unzugänglich.
es: Hue tratará de cerrar la consulta de Hive cuando el usuario abandone la página de editor. Así liberará todos los recursos de consulta de HiveServer2, pero no se podrá acceder a sus resultados.
fr: Hue tente de fermer la requête Hive lorsque l'utilisateur quitte la page de l'éditeur. Toutes les ressources de requête sont ainsi libérées dans HiveServer2, mais les résultats deviennent inaccessibles.
ja: ユーザーがエディターページを移動すると、Hue は Hive クエリを閉じようとします。これにより、HiveServer2 のクエリリソースがすべて解放されますが、結果にもアクセスできなくなります。
ko: 사용자가 편집기 페이지를 나가면 Hue가 Hive 쿼리를 닫습니다. 이렇게 하면 HiveServer2의 모든 쿼리 리소스가 비워지지만 해당 결과에 액세스할 수 없게 됩니다.
zh_cn: 当用户离开编辑器页面时，Hue 将尝试关闭 Hive 查询。这将释放 HiveServer2 中的所有查询资源，但也会让其结果变得无法访问。

source: Hue will use at most this many HiveServer2 sessions per user at a time
de: Hue verwendet höchstens so viele HiveServer2-Sitzungen pro Benutzer gleichzeitig
es: Hue utilizará como máximo todas estas sesiones de HiveServer2 por usuario al mismo tiempo.
fr: Hue utilisera au maximum ce nombre de sessions HiveServer2 par utilisateur à la fois
ko: Hue가 한 번에 사용자당 사용하는 HiveServer2 세션의 최대 수입니다.

source: Thrift version to use when communicating with HiveServer2.
de: Die Thrift-Version, die zum Kommunizieren mit HiveServer2 verwendet wird.
es: La versión de Thrift que se debe usar al comunicar con HiveServer2.
fr: Version Thrift à utiliser lors de la communication avec HiveServer2.
ja: HiveServer2 との通信時に使用する Thrift バージョンです。
ko: HiveServer2와 통신할 때 사용할 Thrift 버전입니다.
zh_cn: 与 HiveServer2 通信时要使用的 Thrift 版本。

source: A comma-separated list of white-listed Hive configuration properties that users are authorized to set.
de: Eine Komma-getrennte Liste der zulässigen Hive-Konfigurationseigenschaften (Whitelist), die Benutzer festlegen können.
es: Una lista separada por comas de propiedades de configuración de lista blanca de Hive que los usuarios están autorizados a establecer.
fr: Liste de valeurs séparées par des virgules des propriétés de configuration de Hive en liste blanche, que les utilisateurs sont autorisés à définir.
ja: ユーザーに設定を許可する Hive 設定プロパティのホワイトリスト（カンマ区切り）です。
ko: 사용자에게 설정 권한이 있는 쉼표로 구분된 화이트리스트 포함 Hive 구성 속성 목록입니다.
zh_cn: 授权用户设置的白名单 Hive 配置属性的逗号分隔的列表。

source: SSL configuration for the server.
de: SSL-Konfiguration für den Server.
es: Configuración de SSL para el servidor.
fr: Configuration SSL pour le serveur.
ja: サーバーの SSL 設定です。
ko: 서버에 대한 SSL 구성입니다.
zh_cn: 服务器的 SSL 配置。

source: Path to Certificate Authority certificates.
de: Pfad zu den Zertifikatberechtigungen.
es: Ruta a los certificados de la autoridad certificadora.
fr: Chemin d'accès vers les certificats de l'Autorité de certification.
ja: 認証局証明書へのパスです。
ko: 인증 기관 인증서에 대한 경로입니다.
zh_cn: 证书颁发机构颁发证书的路径。

source: Path to the private key file, e.g. /etc/hue/key.pem
de: Pfad zur Privatschlüsseldatei, z. B. /etc/hue/key.pem
es: Ruta al archivo de clave privada, p. ej., /etc/hue/key.pem
fr: Chemin d'accès au fichier de clé privée, par ex. /etc/hue/key.pem
ja: /etc/hue/key.pem など、秘密鍵ファイルへのパスです。
ko: 개인 키 파일에 대한 경로(예: /etc/hue/key.pem)
zh_cn: 私钥文件的路径，例如 /etc/hue/key.pem

source: Path to the public certificate file, e.g. /etc/hue/cert.pem
de: Pfad zur öffentlichen Zertifikatdatei, z. B. /etc/hue/cert.pem
es: Ruta al archivo de certificado público, p. ej., /etc/hue/cert.pem
fr: Chemin d'accès au fichier de certificat public, par ex. /etc/hue/cert.pem
ja: /etc/hue/cert.pem など、公開証明書ファイルへのパスです
ko: 공용 인증서 파일에 대한 경로(예: /etc/hue/cert.pem)
zh_cn: 公用证书文件的路径，例如 /etc/hue/cert.pem

source: Choose whether Hue should validate certificates received from the server.
de: Legen Sie fest, ob Hue die vom Server empfangenen Zertifikate prüfen soll.
es: Elija si Hue debe validar los certificados que reciba del servidor.
fr: Indiquez si Hue doit valider les certificats reçus du serveur.
ja: サーバーから受け取った証明書を Hue で検証するかどうかを選択します。
ko: 서버에서 받은 인증서의 유효성을 Hue에서 검사할 것인지 선택합니다.
zh_cn: 选择 Hue 是否应验证从服务器收到的证书。

source: Auth username of the hue user used for authentications.
de: Der für die Authentifizierungen verwendete auth-Benutzername des Hue-Benutzers.
es: Nombre de usuario de autenticación del usuario de Hue que se utiliza para las autenticaciones.
fr: Nom de l'utilisateur Hue utilisé pour les authentifications.
ja: 認証に使用する Hue ユーザーの認証ユーザー名
ko: 인증에 사용된 Hue 사용자의 인증 사용자 이름입니다.
zh_cn: 用于身份验证的 Hue 用户的身份验证用户名。

source: LDAP/PAM/.. password of the hue user used for authentications.
de: LDAP/PAM/..-Kennwort des für Authentifizierungen verwendeten Hue-Benutzers.
es: Contraseña de LDAP/PAM del usuario de Hue que se utiliza para las autenticaciones.
fr: Mot de passe LDAP/PAM.. de l'utilisateur Hue utilisé pour les authentifications.
ja: 認証に使用する Hue ユーザーの LDAP/PAM/.. パスワードです。
ko: 인증에 사용된 Hue 사용자의 LDAP/PAM/.. 암호입니다.
zh_cn: Hue 用户用于身份验证的 LDAP/PAM/.. 密码。

source: Execute this script to produce the auth password. This will be used when `auth_password` is not set.
de: Führen Sie dieses Skript aus, um das auth-Kennwort zu generieren. Dieses wird verwendet, wenn "auth_password" nicht festgelegt ist.
es: Ejecute esta secuencia de comandos para generar la contraseña de autenticación. Se utilizará cuando `auth_password` no esté definido.
fr: Exécutez ce script pour générer le mot de passe d'authentification. Il sera utilisé si 'auth_password' n'est pas défini.
ja: このスクリプトを実行して認証パスワードを作成します。これは auth_password が設定されていない場合に利用されます。
ko: 인증 암호를 생성하려면 이 스크립트를 실행합니다. `auth_password`가 설정되지 않은 경우 사용합니다.
zh_cn: 执行此脚本以生成身份验证密码。这将用于未设置 `auth_password` 的情况。

source: tabs
de: Registerkarten
es: tabuladores
fr: tabulations
ja: タブ
ko: 탭
zh_cn: 制表符

source: commas
de: Kommas
es: comas
fr: virgules
ja: カンマ
ko: 쉼표
zh_cn: 逗号

source: spaces
de: Leerzeichen
es: espacios
fr: espaces
ja: スペース
ko: 공백
zh_cn: 空格

source: Invalid form submission
de: Gesendetes Formular ungültig
es: Envío de formulario no válido
fr: Envoi de formulaire non valide
ja: 無効なフォームの送信
ko: 올바르지 않은 양식 제출
zh_cn: 表单提交无效

source: Path location must refer to a file if "Import Data" is selected.
de: Der Speicherort im Pfad muss auf eine Datei verweisen, wenn "Daten importieren" ausgewählt wurde.
es: La ubicación de la ruta debe hacer referencia a un archivo si "Import Data" está seleccionado.
fr: Le chemin d'accès doit se référer à un fichier si "Importer des données" est sélectionné.
ko: "데이터 가져오기"가 선택되면 경로 위치가 파일을 참조해야 합니다.

source: Path location must refer to a directory if "Create External Table" is selected.
de: Der Speicherort im Pfad muss auf ein Verzeichnis verweisen, wenn "Externe Tabelle erstellen" ausgewählt wurde.
es: La ubicación de la ruta debe hacer referencia a un directorio si "Create External Table" está seleccionado.
fr: L'emplacement du chemin d'accès doit se référer à un répertoire si "Créer une table externe" est sélectionné.
ko: "외부 테이블 생성"이 선택되면 경로 위치가 디렉토리를 참조해야 합니다.

source: Path location "%s" is invalid: %s
de: Speicherort im Pfad "%s" ist ungültig: %s
es: La ubicación de la ruta "%s" no es válida: %s
fr: L'emplacement du chemin d'accès "%s" n'est pas valide : %s
ko: 경로 위치 "%s"이(가) 잘못됨: %s

source: The selected delimiter is creating an un-even number of columns. Please make sure you don't have empty columns.
de: Mit dem ausgewählten Trennzeichen wird eine ungleiche Zahl von Spalten erstellt. Stellen Sie sicher, dass keine leeren Spalten vorhanden sind.
es: El delimitador seleccionado está creando un número irregular de columnas. Asegúrese de que no tiene columnas vacías.
fr: Le délimiteur sélectionné crée un nombre impair de colonnes. Assurez-vous qu'aucune colonne n'est vide.
ja: 選択した区切り文字で奇数個の列が作成されています。空の列がないことを確認してください。
ko: 선택한 구분 기호가 일정하지 않은 열 수를 생성합니다. 빈 열이 없는지 확인하십시오.
zh_cn: 所选分隔符正创建奇数列。请确保您没有空列。

source: The table could not be created.
de: Die Tabelle konnte nicht erstellt werden.
es: No se ha podido crear la tabla.
fr: La table n'a pas pu être créée.
ja: テーブルを作成できませんでした。
ko: 테이블을 생성할 수 없습니다.
zh_cn: 无法创建表。

source: Internal error when constructing the delimiter form: %(error)s.
de: Interner Fehler bei der Konstruktion der Form des Trennzeichens: %(error)s.
es: Error interno al construir el formato del delimitador: %(error)s.
fr: Erreur interne lors de la construction du formulaire du délimiteur : %(error)s.
ja: 区切り文字フォームの構成時に内部エラーが発生しました：%(error)s。
ko: 구분 기호 양식 생성 중 내부 오류 발생: %(error)s.
zh_cn: 构建分隔符形式时出现内部错误：%(error)s。

source: Failed to decode file '%(path)s' into printable characters under %(encoding)s.
de: Dekodierung der Datei "%(path)s" in druckbare Zeichen unter %(encoding)s fehlgeschlagen.
es: Error al decodificar el archivo '%(path)s' en caracteres imprimibles en %(encoding)s.
fr: Echec du décodage du fichier '%(path)s' en caractères imprimables sous %(encoding)s.
ja: %(encoding)s でファイル '%(path)s' を印刷可能な文字にデコードできませんでした。
ko: 파일 '%(path)s'을(를) %(encoding)s 아래에 인쇄 가능한 문자로 디코딩하지 못했습니다.
zh_cn: 无法将文件 '%(path)s' 解码为采用 %(encoding)s 的可打印字符。

source: Could not find any columns to import
de: Keine zu importierenden Spalten gefunden
es: No se han podido encontrar columnas que importar
fr: Impossible de trouver des colonnes à importer
ja: インポートする列が見つかりませんでした
ko: 가져올 열을 찾을 수 없음
zh_cn: 找不到要导入的任何列

source: Failed to open file '%(path)s': %(error)s.
de: Öffnen der Datei "%(path)s" fehlgeschlagen: %(error)s.
es: Error al abrir el archivo '%(path)s': %(error)s.
fr: Echec de l'ouverture du fichier '%(path)s' : %(error)s.
ja: ファイル %(path)s を開くことができませんした：%(error)s。
ko: 파일 '%(path)s'을(를) 열 수 없음: %(error)s.
zh_cn: 无法打开文件 '%(path)s'：%(error)s。
