Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: View the result of the selected
de: Ergebnis der Auswahl anzeigen
es: Ver el resultado de la selección
fr: Afficher le résultat de la sélection
ja: 選択対象の結果を表示
ko: 선택한 항목 결과 보기
zh_cn: 查看所选结果

source: View result
de: Ergebnis anzeigen
es: Ver resultado
fr: Afficher le résultat
ja: 結果を表示
ko: 결과 보기
zh_cn: 查看结果

source: Edit the selected query
de: Ausgewählte Abfrage bearbeiten
es: Editar la consulta seleccionada
fr: Modifier la requête sélectionnée
ja: 選択したクエリを編集
ko: 선택한 쿼리 편집
zh_cn: 编辑所选查询

source: Copy the selected query
de: Ausgewählte Abfrage kopieren
es: Copiar la consulta seleccionada
fr: Copier la requête sélectionnée
ja: 選択したクエリをコピー
ko: 선택한 쿼리 복사
zh_cn: 复制所选查询

source: View the usage history of the selected query
de: Nutzungsverlauf der ausgewählten Abfrage anzeigen
es: Ver el historial de uso de la consulta seleccionada
fr: Afficher l'historique d'utilisation de la requête sélectionnée
ja: 選択したクエリの使用履歴を表示
ko: 선택한 쿼리의 사용량 기록 보기
zh_cn: 查看所选查询的使用历史记录

source: Create new query
de: Neue Abfrage erstellen
es: Crear nueva consulta
fr: Créer une requête
ja: クエリの新規作成
ko: 새 쿼리 생성
zh_cn: 创建新查询

source: Recent Saved Queries
de: Kürzlich gespeicherte Abfragen
es: Consultas guardadas recientemente
fr: Requêtes enregistrées récemment
ja: 最近保存したクエリ
ko: 최근 저장된 쿼리
zh_cn: 最近保存的查询

source: Recent Run Queries
de: Kürzlich ausgeführte Abfragen
es: Consultas ejecutadas recientemente
fr: Requêtes exécutées récemment
ja: 最近実行したクエリ
ko: 최근 실행된 쿼리
zh_cn: 最近运行的查询

source: Desc
de: Beschr.
ja: 降順
ko: 설명
zh_cn: 描述

source: View all my queries
de: Meine Abfragen anzeigen
es: Ver todas mis consultas
fr: Afficher toutes mes requêtes
ja: すべてのクエリを表示
ko: 내 쿼리 모두 보기
zh_cn: 查看我的所有查询

source: View my entire query history
de: Meinen gesamten Abfrageverlauf anzeigen
es: Ver todo mi historial de consultas
fr: Afficher la totalité de mon historique de requêtes
ja: クエリ全体の履歴を表示
ko: 내 전체 쿼리 기록 보기
zh_cn: 查看我的整个查询历史记录

source: Move the selected queries to the trash?
de: Ausgewählte Abfragen in den Papierkorb verschieben?
es: ¿Mover las consultas seleccionadas a la papelera?
fr: Déplacer les requêtes sélectionnées vers la Corbeille ?
ja: 選択したクエリをゴミ箱に移動しますか？
ko: 선택한 쿼리를 휴지통으로 이동하시겠습니까?
zh_cn: 将所选查询移至垃圾桶？

source: In an HDFS directory
de: In einem HDFS-Verzeichnis
es: En un directorio de HDFS
fr: Dans un répertoire HDFS
ja: HDFS ディレクトリ内
ko: HDFS 디렉토리에
zh_cn: 在 HDFS 目录中

source: Results location
de: Speicherort der Ergebnisse
es: Ubicación de resultados
fr: Emplacement des résultats
ja: 結果の場所
ko: 결과 위치
zh_cn: 结果位置

source: Unsaved Query
de: Nicht gespeicherte Abfrage
es: Consulta sin guardar
fr: Requête non enregistrée
ja: 未保存のクエリ
ko: 저장되지 않은 쿼리
zh_cn: 未保存的查询

source: Query Results
de: Abfrageergebnisse
es: Resultados de la consulta
fr: Résultats de la requête
ja: クエリの結果
ko: 쿼리 결과
zh_cn: 查询结果

source: Collapse this panel
de: Dieses Fenster ausblenden
es: Contraer este panel
fr: Réduire ce volet
ja: このパネルを折りたたむ
ko: 이 패널 축소
zh_cn: 折叠此面板

source: Download as CSV
de: Als CSV herunterladen
es: Descargar como CSV
fr: Télécharger sous CSV
ja: CSV としてダウンロード
ko: CSV로 다운로드
zh_cn: 以 CSV 格式下载

source: Download as XLS
de: Als XLS herunterladen
es: Descargar como XLS
fr: Télécharger sous XLS
ja: XLS としてダウンロード
ko: XLS로 다운로드
zh_cn: 以 XLS 格式下载

source: MapReduce Jobs
es: Jobs de MapReduce
fr: Jobs MapReduce
ja: MapReduce ジョブ
ko: MapReduce Job
zh_cn: MapReduce 作业

source: No Hadoop jobs were launched in running this query.
de: Bei der Ausführung dieser Abfrage wurden keine Hadoop-Jobs gestartet.
es: No se ha lanzado ningún job de Hadoop al ejecutar esta consulta.
fr: Aucun job Hadoop n'a été lancé lors de l'exécution de cette requête.
ja: このクエリの実行では Hadoop ジョブが起動しませんでした。
ko: 이 쿼리를 실행할 때 Hadoop Job이 시작되지 않았습니다.
zh_cn: 运行此查询时未启动 Hadoop 作业。

source: Multi-statement query
de: Multi-Anweisungsabfrage
es: Consulta de múltiples instrucciones
fr: Requête à instructions multiples
ja: マルチステートメントクエリ
ko: 다중 명령문 쿼리
zh_cn: 多语句查询

source: Hue stopped as one of your query contains some results.
de: Hue wurde gestoppt, da eine Ihrer Abfragen Ergebnisse enthält.
es: Hue se ha detenido porque una de las consultas contiene algunos resultados.
fr: Hue s'est arrêté car l'une de vos requêtes contient des résultats.
ja: いずれかのクエリに複数の結果が含まれているため、Hue が停止しました。
ko: 쿼리 중 하나에 일부 결과가 포함되어 Hue가 중지됩니다.
zh_cn: Hue 已停止，因为其中一个查询包含某些结果。

source: Click on
de: Klicken Sie auf
es: Haga clic en
fr: Cliquer sur
ja: 次をクリック：
ko: 클릭
zh_cn: 单击

source: next
de: Nächste
es: siguiente
fr: suivant
ja: 次
ko: 다음
zh_cn: 下一步

source: to continue execution of the remaining statements.
de: zum Fortsetzen der Ausführung der übrigen Anweisungen.
es: para continuar con la ejecución del resto de instrucciones.
fr: pour poursuivre l'exécution des instructions restantes.
ja: 残りのステートメントの実行を続行します。
ko: 남은 명령문을 계속 실행합니다.
zh_cn: 以继续执行剩余的语句。

source: If the result contains a large number of columns, click a row to select a column to jump to
de: Wenn das Ergebnis viele Spalten enthält, klicken Sie auf eine Zeile, um eine Spalte auszuwählen, in die Sie wechseln möchten.
es: Si el resultado contiene un gran número de columnas, haga clic en una fila para seleccionar la columna a la que desea saltar
fr: Si le résultat comporte un grand nombre de colonnes, cliquez sur une ligne pour sélectionner une colonne à atteindre
ja: 結果に多くの列が含まれている場合、行をクリックしてジャンプ先の列を選択します
ko: 결과에 열이 많은 경우 행을 클릭하여 이동할 열을 선택하십시오.
zh_cn: 如果结果包含大量列，则单击某行以选择要跳转到的列

source: Save huge results on HDFS and download them with FileBrowser
de: Umfangreiche Ergebnisse in HDFS speichern und mit FileBrowser herunterladen
es: Guardar grandes resultados en HDFS y descargarlos con el explorador de archivos
fr: Enregistrer des résultats volumineux sur HDFS et les télécharger avec FileBrowser
ja: 大量の結果を HDFS に保存し、FileBrowser でダウンロード
ko: HDFS에 대량 결과 저장 후 FileBrowser를 사용하여 다운로드
zh_cn: 将大量结果保存在 HDFS 上并使用 FileBrowser 下载这些结果

source: Query Results:
de: Abfrageergebnisse:
es: Resultados de la consulta:
fr: Résultats de la requête :
ja: クエリの結果：
ko: 쿼리 결과:
zh_cn: 查询结果：

source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
zh_cn: 错误

source: The query result has expired.
de: Das Abfrageergebnis ist abgelaufen.
es: El resultado de la consulta ha caducado.
fr: Le résultat de la requête a expiré.
ja: クエリの結果が期限切れになりました。
ko: 쿼리 결과가 만료되었습니다.
zh_cn: 查询结果已过期。

source: You can rerun it from
de: Erneute Ausführung möglich von
es: Puede volver a realizar la ejecución desde
fr: Vous pouvez l'exécuter de nouveau depuis
ja: 次から再実行可能
ko: 다음에서 다시 실행할 수 있음
zh_cn: 您可以将其返回

source: Page offset may have incremented since last view.
de: Versatz der Seite kann seit der letzten Anzeige größer geworden sein.
es: Es posible que el desplazamiento de la página haya aumentado desde la última visualización.
fr: Le décalage de page a peut-être été incrémenté depuis le dernier affichage.
ja: 前回の表示時点からページのオフセットが増加している可能性があります。
ko: 마지막 보기 이후 페이지 오프셋이 증가되었을 수 있습니다.
zh_cn: 上次查看后页面偏移量可能已增加。

source: You have reached the last record for this query.
de: Sie haben den letzten Datensatz für diese Abfrage erreicht.
es: Ha alcanzado el último registro de esta consulta.
fr: Vous avez atteint le dernier enregistrement pour cette requête.
ja: このクエリの最後のレコードに達しました。
ko: 이 쿼리의 마지막 레코드에 도달했습니다.
zh_cn: 您已达到此查询最后一个记录。

source: In text with columns separated by ^A and rows separated by newlines. JSON for non-primitive type columns.
de: In Text mit Spalten, die durch ^A und Zeilen, die durch neue Zeilen getrennt sind. JSON für nicht einfache Typspalten.
es: En texto con columnas separadas por ^A y filas separadas por nuevas líneas. JSON para columnas de tipo no primitivo.
fr: Dans un texte comportant des colonnes séparées par ^A et des lignes séparées par des sauts de ligne. JSON pour des colonnes de type non primitif.
ja: ^A で区切られた列と改行で区切られた行のテキスト。プリミティブでないタイプの列の JSON です。
ko: ^A로 구분된 열과 줄 바꿈 문자로 구분된 행이 있는 텍스트. 기본 형식이 아닌 열의 JSON.
zh_cn: 在包含 ^A 分隔的列和换行符分隔的行的文本中。JSON 用于非基元类型列。

source: Name or directory required.
de: Name oder Verzeichnis erforderlich.
es: Se necesita el nombre o directorio.
fr: Nom ou répertoire requis.
ja: 名前またはディレクトリが必要です。
ko: 이름 또는 디렉토리가 필요합니다.
zh_cn: 需要名称或目录。

source: Download results from the left.
de: Ergebnisse von links herunterladen.
es: Descargar resultados desde la izquierda.
fr: Téléchargez les résultats depuis la gauche.
ja: 左から結果をダウンロードします。
ko: 왼쪽에서 결과를 다운로드합니다.
zh_cn: 从左侧下载结果。

source: MR Job
es: Trabajo de MR
fr: Job MR
zh_cn: MR 作业

source: MapReduce Job
es: Job de MapReduce
fr: Job MapReduce
ja: MapReduce ジョブ
zh_cn: MapReduce 作业

source: ctrl-As
de: Strg-As
ja: Ctrl + A
zh_cn: ctrl-A

source: ctrl-Bs
de: Strg-Bs
ja: Ctrl + B
zh_cn: ctrl-B

source: ctrl-Cs
de: Strg-Cs
ja: Ctrl + C
zh_cn: ctrl-C

source: The headers of the file could not be removed.
ja: ファイルのヘッダーを削除できませんでした。
zh_cn: 无法删除文件的标头。

source: Input File
ja: 入力ファイル
zh_cn: 输入文件

source: Import data from file
ja: ファイルからデータをインポート
zh_cn: 从文件导入数据

source: Automatically load this file into the table after creation.
ja: 作成後にこのファイルをテーブルに自動的にロードします。
zh_cn: 创建后，将此文件自动加载到表中。

source: Impala has not implemented the 'DESCRIBE DATABASE' command: %(issue_ref)s
ja: Impala には 'DESCRIBE DATABASE' コマンド %(issue_ref)s は実装されていません
zh_cn: Impala 未实施 'DESCRIBE DATABASE' 命令：%(issue_ref)s

source: database
ja: データベース
zh_cn: 数据库

source: Oops, no database found!
ja: データベースが見つかりません。
zh_cn: 很抱歉，找不到数据库！

source: table_name
fr: nom_table
zh_cn: 表名

source: The HDFS path to the file on which to base this new table definition. It can be compressed (gzip) or not.
ja: この新しいテーブル定義のベースとなるファイルの HDFS のパスです。ファイルは圧縮（gzip）でも非圧縮でもかまいません。
zh_cn: 作为此新表定义基础的文件的 HDFS 路径。可以是或不是压缩 (gzip) 文件。

source: Check this box to import the data in this file after creating the table definition. Leave it unchecked to define an empty table.
ja: テーブル定義を作成した後にこのファイルのデータをインポートする場合は、このボックスをオンにします。空のテーブルを定義する場合は、オフのままにします。
zh_cn: 选中此复选框可在创建表定义后导入此文件中的数据。取消选中此复选框可定义空表。

source: There was a problem loading the databases
ja: データベースのロード中に問題が発生しました
zh_cn: 加载数据库时出现问题

source: There was a problem loading the table preview.
ja: テーブルプレビューをロード中に問題が発生しました。
zh_cn: 加载表预览时出现问题。

source: Map
ja: マップ
zh_cn: 映射

source: Spinner
fr: Compteur

source: Metastore Manager
fr: Gestionnaire Metastore
