Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Store your table in the default location (controlled by Hive, and typically
de: Speichern Sie Ihre Tabelle am Standardspeicherort (gesteuert durch Hive und typischerweise
es: Almacene la tabla en la ubicación predeterminada (controlada por Hive y, normalmente
fr: Stocker votre table dans l'emplacement par défaut (contrôlé par Hive, généralement
ja: デフォルトの場所にテーブルを保存（Hive によって制御され、多くの場合は
ko: 테이블을 기본 위치(보통 Hive가 제어)에 저장
zh_cn: 将表存储在默认位置（由 Hive 控制，通常

source: Enter the path (on HDFS) to your table's data location
de: Geben Sie den Pfad (in HDFS) zum Speicherort der Daten Ihrer Tabelle an.
es: Introduzca la ruta (en HDFS) hasta la ubicación de los datos de la tabla
fr: Entrer le chemin d'accès (sur HDFS) à l'emplacement des données de votre table
ja: テーブルのデータを保存する場所への（HDFS 上の）パスを入力します
ko: 테이블의 데이터 위치에 대한 경로(HDFS에 있는)를 입력합니다.
zh_cn: 输入表数据位置的路径（位于 HDFS 上）

source: Configure Table Columns
de: Tabellenspalten konfigurieren
es: Configurar columnas de tabla
fr: Configurer les colonnes de la table
ja: テーブル列の設定
ko: 테이블 열 구성
zh_cn: 配置表列

source: Table Properties
de: Tabelleneigenschaften
es: Propiedades de tabla
fr: Propriétés de la table
ko: 테이블 속성

source: Skip Header Row?
de: Kopfzeile überspringen?
es: ¿Omitir fila de cabecera?
fr: Ignorer la ligne d'en-tête ?
ko: 첫째 행을 건너뛰시겠습니까?

source: Configure Partitions
de: Partitionen konfigurieren
es: Configurar particiones
fr: Configurer les partitions
ja: パーティションの設定
ko: 파티션 구성
zh_cn: 配置分区

source: If your data is naturally partitioned (by date, for example), partitions are a way to tell the query server that data for a specific partition value are stored together.
de: Wenn Ihre Daten natürlich partitioniert sind (z. B. nach Datum), sind Partitionen eine Möglichkeit, um dem Abfrageserver mitzuteilen, dass Daten für einen spezifischen Partitionswert gemeinsam gespeichert werden.
es: Si los datos se particionan de forma natural (por fecha, por ejemplo), las particiones son una forma de indicar al servidor de consultas que los datos para un valor de partición concreto se almacenan juntos.
fr: Si vos données sont naturellement partitionnées (par date, par exemple), les partitions sont un moyen d'indiquer au serveur de requêtes que les données correspondant à une valeur de partition spécifique sont stockées ensemble.
ja: 自然な方法（日付別など）でデータをパーティション化すると、クエリサーバーでは特定のパーティション値を持つデータをまとめて保存できます。
ko: 데이터가 원래 파티션되어 있을 경우(예: 날짜별), 파티션은 쿼리 서버가 특정 파티션 값에 대한 데이터가 함께 저장되어 있는지를 식별하는 방식이 됩니다.
zh_cn: 如果您的数据本身已分区（例如，按日期），则分区是一种告诉查询服务器特定分区值的数据将存储在一起的方式。

source: The query server establishes a mapping between directories on disk
de: Der Abfrageserver stellt eine Zuordnung zwischen Verzeichnissen auf der Festplatte
es: El servidor de consultas establece mapping entre directorios del disco
fr: Le serveur de requêtes crée un mappage entre les répertoires du disque
ja: クエリサーバーは、ディスク上のディレクトリ間で mapping を作成します
ko: 쿼리 서버는 해당 일의 데이터와
zh_cn: 查询服务器在磁盘上的目录之间建立映射

source: and the data for that day. Partitions are virtual columns; they are not represented in the data itself, but are determined by the data location. The query server implements query optimizations such that queries that are specific to a single partition need not read the data in other partitions.
de: und den Daten für diesen Tag her. Partitionen sind virtuelle Spalten; sie werden nicht in den Daten selbst repräsentiert, sondern durch den Speicherort der Daten festgelegt. Der Abfrageserver implementiert Abfrageoptimierungen so, dass spezifische Abfragen für eine einzelne Partition die Daten in anderen Partitionen nicht lesen müssen.
es: y los datos de ese día. Las particiones son columnas virtuales; no se representan en los datos en sí, pero están determinadas por la ubicación de los datos. El servidor de consultas implementa optimizaciones de consulta como que las consultas específicas de una única partición no necesitan leer los datos de otras particiones.
fr: et les données pour ce jour. Les partitions sont des colonnes virtuelles ; elles ne sont pas représentées dans les données elles-mêmes, mais elles sont déterminées par l'emplacement des données. Le serveur de requêtes implémente les optimisations de requêtes de sorte que les requêtes propres à une seule partition n'aient pas besoin de lire les données d'autres partitions.
ja: その日のデータとの mapping を確立します。パーティションはデータの場所で決まりますが、仮想的な列であるため、データ自体には記録されません。クエリサーバーでは、クエリの最適化を実装して、特定のパーティションに固有のクエリでは他のパーティションのデータを読み取る必要がないようにしています。
ko: 디스크의 디렉토리 간 매핑을 설정합니다. 파티션은 가상의 열입니다. 즉, 데이터 자체에 표시되지는 않으나 데이터 위치에 의해 결정됩니다. 쿼리 서버는 단일 파티션에 해당하는 쿼리가 다른 파티션의 데이터를 읽지 않도록 하는 쿼리 최적화를 구현합니다.
zh_cn: 以及该日的数据。分区是虚拟列；数据本身中并不反映分区，而是由数据位置决定。查询服务器实施查询优化，以使特定于单个分区的查询不需要读取其他分区中的数据。

source: Create table
de: Tabelle erstellen
es: Crear tabla
fr: Créer une table
ja: テーブルを作成
ko: 테이블 생성
zh_cn: 创建表

source: Delete this column
de: Diese Spalte löschen
es: Eliminar esta columna
fr: Supprimer cette colonne
ja: この列を削除
ko: 이 열 삭제
zh_cn: 删除此列

source: Column name
de: Spaltenname
es: Nombre de columna
fr: Nom de la colonne
ja: 列名
ko: 열 이름
zh_cn: 列名称

source: There is another field with the same name.
de: Es ist ein weiteres Feld mit diesem Namen vorhanden.
es: Hay otro campo con el mismo nombre.
fr: Un autre champ porte le même nom.
ja: 同じ名前を持つ別のフィールドが存在します。
ko: 같은 이름의 다른 필드가 있습니다.
zh_cn: 另一个字段具有相同名称。

source: Column name must be single words that start with a letter or a digit.
de: Spaltennamen müssen einzelne Wörter sein, die mit einem Buchstaben oder einer Ziffer beginnen.
es: El nombre de columna debe ser una única palabra que empiece por una letra o un dígito.
fr: Le nom de la colonne doit se composer d'un mot unique commençant par une lettre ou un chiffre.
ja: 列名は、先頭を文字または数字とした一連の単語とする必要があります。
ko: 열 이름은 문자 또는 숫자로 시작하는 한 단어여야 합니다.
zh_cn: 列名称必须是以字母或数字开始的单个单词。

source: Column type
de: Spaltentyp
es: Tipo de columna
fr: Type de colonne
ja: 列の種類
ko: 열 유형
zh_cn: 列类型

source: Type for this column. Certain advanced types (namely, structs) are not exposed in this interface.
de: Typ für diese Spalte. Bestimmte komplexere Typen (Structs) sind auf dieser Oberfläche nicht sichtbar.
es: Tipo de columna. Determinados tipos avanzados (concretamente, las estructuras) no aparecen en esta interfaz.
fr: Type pour cette colonne. Certains types avancés (tels que les structures) ne figurent pas dans cette interface.
ja: この列の種類です。特定の高度な種類（つまり、構造体:Struct）は、このインターフェイスに表示されません。
ko: 이 열의 유형입니다. 특정 고급 유형(즉, structs)은 이 인터페이스에 노출되지 않습니다.
zh_cn: 此列的类型。此界面不呈现某些高级类型（即 structs）。

source: Array value type
de: Array-Wert-Typ
es: Tipo de valor de matriz
fr: Type de valeur de tableau
ja: 配列の値の種類
ko: 어레이 값 유형
zh_cn: 数组值类型

source: Type of the array values.
de: Typ der Array-Werte.
es: Tipo de valores de matriz.
fr: Type des valeurs de tableau.
ja: 配列の値の種類です。
ko: 어레이 값의 유형입니다.
zh_cn: 数组值的类型。

source: Map Key type
de: Map-Schlüssel-Typ
es: Tipo de clave de map
fr: Type de clé de map
ja: map キーの種類
ko: Map 키 유형
zh_cn: Map 键类型

source: Type of the map keys.
de: Typ der Map-Schlüssel.
es: Tipo de claves de map.
fr: Type des clés de mappage.
ja: map キーの種類です。
ko: Map 키의 유형입니다.
zh_cn: Map 键的类型。

source: Map Value type
de: Map-Wert-Typ
es: Tipo de valor de map
fr: Type de valeur de map
ja: map 値の種類
ko: Map 값 유형
zh_cn: Map 值类型

source: Type of the map values.
de: Typ der Map-Werte.
es: Tipo de valores de map.
fr: Type des valeurs de map.
ja: map 値の種類です。
ko: Map 값의 유형입니다.
zh_cn: Map 值的类型。

source: Size
de: Größe
es: Tamaño
fr: Taille
ja: サイズ
ko: 크기
zh_cn: 大小

source: Length of char value (1~255)
de: Länge des char-Werts (1~255)
es: Longitud del valor caracteres (1~255)
fr: Longueur de la valeur char (1~255)
ja: char 値の長さ（1～255）
ko: char 값 길이(1~255)
zh_cn: char 值的长度 (1~255)

source: Length of varchar value (1~65355)
de: Länge des varchar-Werts (1~65355)
es: Longitud del valor varchar (1~65355)
fr: Longueur de la valeur varchar (1~65355)
ja: varchar 値の長さ（1～65355）
ko: varchar 값 길이(1~65355)
zh_cn: varchar 值的长度 (1~65355)

source: Type your field terminator here
de: Geben Sie Ihr Feldabschlusszeichen hier ein
es: Escriba aquí el terminador de campo
fr: Entrez votre marque de fin de champ ici.
ja: フィールドの終端文字をここに入力
ko: 여기에 필드 터미네이터 입력
zh_cn: 在此处输入您的字段终止符

source: Type your collection terminator here
de: Geben Sie Ihr Sammlungsabschlusszeichen hier ein
es: Escriba aquí el terminador de recopilación
fr: Entrez votre marque de fin de collecte ici.
ja: コレクションの終端文字をここに入力
ko: 여기에 수집 터미네이터 입력
zh_cn: 在此处输入您的集合终止符

source: Type your map key terminator here
de: Geben Sie Ihr Map-Schlüssel-Abschlusszeichen hier ein.
es: Escriba aquí el terminador de clave de map
fr: Entrez votre marque de fin de clé de map ici.
ja: map キーの終端文字をここに入力
ko: 여기에 Map 키 터미네이터 입력
zh_cn: 在此处输入您的 Map 键终止符

source: Query
de: Abfrage
es: Consulta
fr: Requête
ja: クエリ
ko: 쿼리
zh_cn: 查询

source: Assist
de: Unterstützung
es: Asistir
fr: Aide
ja: アシスト
ko: 지원
zh_cn: 辅助

source: Session
de: Sitzung
es: Sesión
ja: セッション
ko: 세션
zh_cn: 会话

source: settings
de: Einstellungen
es: ajustes
fr: paramètres
ja: 設定
ko: 설정
zh_cn: 设置

source: Delete this setting
de: Diese Einstellung löschen
es: Eliminar este ajuste
fr: Supprimer ce paramètre
ja: この設定を削除
ko: 이 설정 삭제
zh_cn: 删除此设置

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
ja: 追加
ko: 추가
zh_cn: 添加

source: File Resources
de: Dateiressourcen
es: Recursos del archivo
fr: Ressources de fichiers
ja: ファイルのリソース
ko: 파일 리소스
zh_cn: 文件资源

source: Type
de: Typ
es: Tipo
ja: タイプ
ko: 유형
zh_cn: 类型

source: file
de: Datei
es: archivo
fr: fichier
ja: ファイル
ko: 파일
zh_cn: 文件

source: Path
de: Pfad
es: Ruta
fr: Chemin d'accès
ja: パス
ko: 경로
zh_cn: 路径

source: User-Defined Functions
de: Benutzerdefinierte Funktionen
es: Funciones definidas por el usuario
fr: Fonctions définies par l'utilisateur
ja: ユーザー定義関数
ko: 사용자 정의 함수
zh_cn: 用户定义的函数

source: UDFs
es: UDF
fr: FDU
ja: UDF
ko: UDF
zh_cn: UDF

source: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
zh_cn: 名称

source: Class name
de: Klassenname
es: Nombre de clase
fr: Nom de classe
ja: クラス名
ko: 클래스 이름
zh_cn: 类名

source: Options
de: Optionen
es: Opciones
ja: オプション
ko: 옵션
zh_cn: 选项

source: If checked (the default), you can include parameters like $parameter_name in your query, and users will be prompted for a value when the query is run.
de: Wenn markiert (Standardeinstellung), können Sie Parameter wie $parameter_name in Ihrer Abfrage einschließen und Benutzer werden aufgefordert, einen Wert einzugeben, wenn die Abfrage ausgeführt wird.
es: Si se activa (valor predeterminado), puede incluir parámetros como $parameter_name en la consulta y se le solicitará a los usuarios un valor cuando se ejecute la consulta.
fr: Si le paramètre est coché (par défaut), vous pouvez inclure des paramètres tels que $parameter_name dans votre requête et les utilisateurs seront invités à saisir une valeur lors de l'exécution de la requête.
ja: チェックボックスをオンにすると（デフォルトの設定）、$parameter_name などのパラメーターをクエリで使用でき、ユーザーはクエリの実行時に値を求められます。
ko: 이 항목이 선택되면(기본 설정) 쿼리에 $parameter_name 같은 매개변수를 포함할 수 있으며 쿼리가 실행 중일 때 사용자에게 값이 표시됩니다.
zh_cn: 如果选中（默认值），您可在查询中包括 $parameter_name 之类的参数，并且在运行查询时会提示用户输入值。

source: Enable parameterization
de: Parametrisierung aktivieren
es: Activar parametrización
fr: Activer le paramétrage
ja: パラメータ化の有効化
ko: 매개변수화 사용
zh_cn: 启用参数化

source: Metastore Catalog
de: Metastore-Katalog
es: Catálogo de Metastore
fr: Catalogue du metastore
ja: Metastore カタログ
ko: Metastore 카탈로그
zh_cn: Metastore 目录

source: Sync tables tips
de: Tipps zur Synchronisierung von Tabellen
es: Consejos para la sincronización de tablas
fr: Conseils sur la synchronisation des tables
ja: テーブルを同期するヒント
ko: 테이블 팁 동기화
zh_cn: 表同步提示

source: invalidates the entire catalog metadata. All table metadata will be reloaded on the next access.
de: macht sämtliche Katalogmetadaten ungültig. Alle Tabellenmetadaten werden beim nächsten Zugriff erneut geladen.
es: invalida todos los metadatos del catálogo. Todos los metadatos de la tabla se volverán a cargar en el siguiente acceso.
fr: invalide toutes les métadonnées du catalogue. Toutes les métadonnées de la table seront rechargées lors du prochain accès.
ja: カタログメタデータ全体を無効にします。テーブルのすべてのメタデータは次回アクセス時に再ロードされます。
ko: 전체 카탈로그 메타데이터를 무효화합니다. 다음에 액세스할 때 모든 테이블 메타데이터가 다시 로드됩니다.
zh_cn: 使整个目录元数据无效。下次访问时将重新加载所有表元数据。

source: invalidates the metadata, load on the next access
de: macht die Metadaten ungültig und lädt beim nächsten Zugriff
es: invalida los metadatos, los carga en el siguiente acceso
fr: invalide les métadonnées, charger lors du prochain accès
ja: メタデータを無効にして次回アクセス時にロード
ko: 메타데이터를 무효화, 다음 액세스에 로드합니다.
zh_cn: 使元数据无效，下次访问时加载

source: refreshes the metadata immediately. It is a faster, incremental refresh.
de: aktualisiert die Metadaten sofort. Es ist eine schnellere, schrittweise Aktualisierung.
es: actualiza los metadatos inmediatamente. Es una actualización más rápida en incrementos.
fr: actualise immédiatement les métadonnées. Il s'agit d'une actualisation incrémentielle, plus rapide.
ja: メタデータをただちに更新します。より高速な増分更新です。
ko: 메타데이터를 즉시 새로 고칩니다. 훨씬 빠른 증분 새로 고침입니다.
zh_cn: 立即刷新元数据。这是一种更快的增量刷新。

source: address
de: Adresse
es: dirección
fr: adresse
ja: アドレス
ko: 주소
zh_cn: 地址

source: There's currently no valid session
de: Es gibt derzeit keine gültige Sitzung.
es: En estos momentos, no hay sesiones válidas
fr: Il n'existe actuellement aucune session valable
ja: 現在、有効なセッションがありません
ko: 현재 올바른 세션이 없음
zh_cn: 当前没有有效会话

source: This is the old SQL Editor, it is recommended to instead use:
de: Dies ist der alte SQL-Editor, verwenden Sie stattdessen Folgenden:
es: Este es el editor de SQL antiguo; en su lugar, se recomienda usar:
fr: Il s'agit de l’ancien éditeur SQL. Il est recommandé d’utiliser plutôt :
ko: 이는 이전 SQL 편집기입니다. 다음을 대신 사용하는 것이 좋습니다.

source: This query had some sensitive information removed when saved.
de: Diese Abfrage enthält vertrauliche Daten, die beim Speichern entfernt werden.
es: Esta consulta contenía información sensible que se eliminó al guardarse.
fr: Cette requête inclut des informations sensibles qui ont été supprimées lors de l'enregistrement.
ja: このクエリの一部の機密情報が、保存時に削除されました。
ko: 이 쿼리에는 저장 시 제거된 민감한 정보가 있습니다.
zh_cn: 此查询在保存时删除了一些敏感信息。

source: Press CTRL + Space to autocomplete
de: STRG + Leertaste drücken, um automatisch abzuschließen
es: Pulse la tecla CTRL + espacio para autocompletar
fr: Appuyez sur CTRL + Barre d'espace pour lancer le remplissage automatique
ja: オートコンプリートするにはCTRL キーを押したまま Space キーを押す
ko: 자동 완성하려면 CTRL + Space 누르기
zh_cn: 按 CTRL + 空格键可自动完成

source: You can execute queries with multiple SQL statements delimited by a semicolon ';'
de: Sie können Abfragen mit mehreren SQL-Anweisungen ausführen, die durch einen Strichpunkt ";" abgetrennt sind.
es: Puede ejecutar consultas con varias instrucciones SQL delimitadas por punto y coma ';'
fr: Vous pouvez exécuter des requêtes à instructions SQL multiples séparées par des points-virgules.
ja: セミコロン ';' で区切ることで、複数の SQL ステートメントを含んだクエリを実行できます。
ko: 세미콜론(;)으로 구분된 여러 SQL 문으로 쿼리를 실행할 수 있음
zh_cn: 您可使用多个由分号“;”分隔的 SQL 语句执行查询

source: You can highlight and run a fragment of a query
de: Sie können ein Fragment einer Abfrage markieren und ausführen
es: Puede resaltar y ejecutar un fragmento de una consulta
fr: Vous pouvez sélectionner et exécuter une partie d'une requête
ja: クエリのフラグメントを強調表示して実行できます
ko: 쿼리 단편을 강조 표시하고 실행할 수 있음
zh_cn: 您可以突出显示并运行查询片段

source: Query name
de: Abfragename
es: Nombre de consulta
fr: Nom de la requête
ja: クエリ名
ko: 쿼리 이름
zh_cn: 查询名称

source: Query description
de: Abfragebeschreibung
es: Descripción de consulta
fr: Description de la requête
ja: クエリの説明
ko: 쿼리 설명
zh_cn: 查询描述

source: Please provide a query
de: Geben Sie eine Abfrage an.
es: Indique una consulta
fr: Veuillez fournir une requête
ja: クエリを指定してください
ko: 쿼리를 제공하십시오.
zh_cn: 请提供查询

source: Your query has the following error(s):
de: Ihre Abfrage enthält folgende(n) Fehler:
es: La consulta tiene los siguientes errores:
fr: Votre requête comporte les erreurs suivantes :
ja: このクエリには次のエラーがあります：
ko: 쿼리에 다음 오류가 있습니다.
zh_cn: 您的查询有下列错误：

source: Execute
de: Ausführen
es: Ejecutar
fr: Exécuter
ja: 実行
ko: 실행
zh_cn: 执行

source: Canceling...
de: Abbrechen...
es: Cancelando...
fr: Annulation en cours...
ja: キャンセル中...
ko: 취소 중...
zh_cn: 正在取消...

source: Cancel the query
de: Abfrage abbrechen
es: Cancelar la consulta
fr: Annuler la requête
ja: クエリをキャンセル
ko: 쿼리 취소
zh_cn: 取消查询

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_cn: 取消

source: Restart
de: Neu starten
es: Reiniciar
fr: Redémarrer
ja: 再起動
ko: 재시작
zh_cn: 重新启动

source: Save as...
de: Speichern unter...
es: Guardar como...
fr: Enregistrer sous...
ja: 名前を付けて保存...
ko: 다른 이름으로 저장...
zh_cn: 另存为...

source: Explain
de: Erklären
es: Explicar
fr: Expliquer
ja: 実行計画
ko: 설명
zh_cn: 解释

source: Format
es: Dar formato
ja: 整形
ko: 형식
zh_cn: 格式

source: or create a
de: oder erstellen Sie eine
es: o crear
fr: ou créer une
ja: または作成
ko: 또는 생성
zh_cn: 或创建一个

source: New query
de: Neue Abfrage
es: Nueva consulta
fr: Nouvelle requête
ja: 新しいクエリ
ko: 새 쿼리 생성
zh_cn: 新查询

source: See results in full screen
de: Ergebnisse als Vollbild anzeigen
es: Ver resultados a pantalla completa
fr: Afficher les résultats en mode plein écran
ja: 結果を全画面で表示
ko: 전체 화면으로 결과 보기
zh_cn: 全屏查看结果

source: Save the results to HDFS or a new Hive table
de: Ergebnisse in HDFS oder einer neuen Hive-Tabelle speichern
es: Guarde los resultados en HDFS o en una nueva tabla de Hive
fr: Enregistrer les résultats dans HDFS ou dans une nouvelle table Hive
ja: 結果を HDFS または新しい Hive テーブルに保存
ko: HDFS 또는 새 Hive 테이블에 결과 저장
zh_cn: 将结果保存到 HDFS 或新的 Hive 表

source: Download the results in CSV format
de: Ergebnisse im CSV-Format herunterladen
es: Descargue los resultados en formato CSV
fr: Télécharger les résultats au format CSV
ja: 結果を CSV 形式でダウンロード
ko: CSV 형식으로 결과 다운로드
zh_cn: 以 CSV 格式下载结果

source: Download the results in XLS format
de: Ergebnisse im XLS-Format herunterladen
es: Descargar los resultados en formato XLS
fr: Télécharger les résultats au format XLS
ja: 結果を XLS 形式でダウンロード
ko: XLS 형식으로 결과 다운로드
zh_cn: 以 XLS 格式下载结果

source: Clear the query history
de: Abfrageverlauf löschen
es: Borrar el historial de consultas
fr: Effacer l'historique des requêtes
ja: クエリ履歴をクリア
ko: 쿼리 기록 지우기
zh_cn: 清除查询历史记录

source: Recent queries
de: Aktuelle Abfragen
es: Consultas recientes
fr: Requêtes récentes
ja: 最近のクエリ
ko: 취근 쿼리
zh_cn: 最近查询

source: Query builder
de: Abfrage-Builder
es: Creador de consultas
fr: Constructeur de requêtes
ja: クエリビルダー
ko: 쿼리 빌더
zh_cn: 查询生成器

source: Log
de: Protokoll
es: Registro
fr: Journal
ja: ログ
ko: 로그
zh_cn: 日志

source: Columns
de: Spalten
es: Columnas
fr: Colonnes
ja: 列
ko: 열
zh_cn: 列

source: Results
de: Ergebnisse
es: Resultados
fr: Résultats
ja: 結果
ko: 결과
zh_cn: 结果

source: Chart
de: Diagramm
es: Gráfico
fr: Graphique
ja: チャート
ko: 차트
zh_cn: 图表

source: Explanation
de: Erklärung
es: Explicación
fr: Explication
ja: 説明
ko: 설명
zh_cn: 解释

source: Time
de: Zeit
es: Tiempo
fr: Heure
ja: 時間
ko: 시간
zh_cn: 时间

source: Result
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果
ko: 결과
zh_cn: 结果

source: There is currently no query to visualize.
de: Es gibt derzeit keine zu visualisierende Abfrage.
es: Actualmente no hay ninguna consulta para visualizar.
fr: Il n'existe actuellement aucune requête à afficher.
ja: 現在、視覚化するクエリはありません。
ko: 현재 시각화할 쿼리가 없습니다.
zh_cn: 当前没有要可视化的查询。

source: There are currently no rules defined. To get started, right click on any table column in the SQL Assist panel.
de: Derzeit sind keine Regeln definiert. Klicken Sie mit der rechten Maustaste auf eine beliebige Tabellenspalte im SQL-Unterstützungsfenster, um mit der Definition zu beginnen.
es: Actualmente no hay ninguna regla definida. Para empezar, haga clic con el botón derecho del ratón en cualquier columna de tabla del panel SQL Assist.
fr: Il n'existe actuellement aucune règle définie. Pour commencer, cliquez avec le bouton droit dans une colonne de la table dans le volet Aide SQL.
ja: 現在、定義されているルールはありません。利用を開始するには、SQL Assist パネルでテーブルの列を右クリックします。
ko: 현재 정의된 규칙이 없습니다. 시작하려면 SQL Assist 패널에서 테이블 열을 우클릭하십시오.
zh_cn: 当前无定义的规则。要开始，请右键单击 SQL 帮助面板中的任何表列。

source: Table
de: Tabelle
es: Tabla
ja: テーブル
ko: 테이블
zh_cn: 表

source: Column
de: Spalte
es: Columna
fr: Colonne
ja: 列
ko: 열
zh_cn: 列

source: Operation
de: Vorgang
es: Operación
fr: Opération
ja: 操作
ko: 작업
zh_cn: 操作

source: Build query
de: Abfrage erstellen
es: Crear consulta
fr: Construire une requête
ja: クエリを作成
ko: 쿼리 빌드
zh_cn: 生成查询

source: There are currently no logs to visualize.
de: Es gibt derzeit keine zu visualisierenden Protokolle.
es: Actualmente no hay ningún registro para visualizar.
fr: Il n'existe actuellement aucun journal à afficher.
ja: 現在、視覚化するログはありません。
ko: 현재 시각화할 로그가 없습니다.
zh_cn: 当前没有要可视化的日志。

source: There are currently no columns to visualize.
de: Es gibt derzeit keine zu visualisierenden Spalten.
es: Actualmente no hay ninguna columna para visualizar.
fr: Il n'existe actuellement aucune colonne à afficher.
ja: 現在、視覚化する列はありません。
ko: 현재 시각화할 열이 없습니다.
zh_cn: 当前没有要可视化的列。

source: Filter for column name or type...
de: Nach Spaltenname oder Typ filtern...
es: Filtrar por nombre de columna o tipo...
fr: Filtrer sur le nom ou le type de colonne…
ja: 列名またはタイプ用のフィルター...
ko: 열 이름 또는 종류 필터링...
zh_cn: 列名或类型筛选器...

source: Fetching results ran into the following error(s):
de: Beim Abrufen der Ergebnisse sind die folgenden Fehler aufgetreten:
es: Al capturar resultados se han encontrado los siguientes errores:
fr: L'obtention des résultats a rencontré la ou les erreurs suivantes :
ja: フェッチを実行した結果、以下のエラーが発生しました。
ko: 가져오기 결과 다음 오류 발생:
zh_cn: 获取结果出现以下错误：

source: Show more results...
de: Weitere Ergebnisse anzeigen...
es: Mostrar más resultados...
fr: Afficher plus de résultats…
ja: その他の結果を表示...
ko: 추가 결과 보기...
zh_cn: 显示更多结果...

source: The operation has no results.
de: Der Vorgang erbrachte keine Ergebnisse.
es: La operación no tiene resultados.
fr: L'opération n'a aucun résultat.
ja: 操作の結果がありません。
ko: 작업 결과가 없습니다.
zh_cn: 操作无结果。

source: The results have expired, rerun the query if needed.
de: Die Ergebnisse sind abgelaufen, führen Sie die Abfragen falls erforderlich erneut aus.
es: Los resultados han caducado, vuelva a ejecutar la consulta si fuera necesario.
fr: Les résultats ont expiré, exécutez à nouveau la requête si nécessaire.
ja: 結果が期限切れになりました。必要に応じてクエリを返します。
ko: 결과가 만료되었습니다. 필요한 경우 쿼리를 다시 실행하십시오.
zh_cn: 结果已过期，按需要重新运行查询。

source: There is currently no data to build a chart on.
de: Es sind derzeit keine Daten vorhanden, aus denen ein Diagramm erstellt werden könnte.
es: Actualmente no hay ningún dato para crear un gráfico.
fr: Il n'existe actuellement aucune donnée permettant de créer un graphique.
ja: 現在、チャートの作成に使用するデータが存在しません。
ko: 현재 차트 생성에 필요한 데이터가 없습니다.
zh_cn: 当前没有表上构建的数据。

source: Warning:
de: Warnung:
es: Advertencia:
fr: Avertissement :
ja: 警告：
ko: 경고:
zh_cn: 警告：

source: the results on the chart have been limited to 1000 rows.
de: Die Ergebnisse im Diagramm wurden auf 1000 Zeilen begrenzt.
es: los resultados del gráfico se han limitado a 1000 filas.
fr: les résultats sur le graphique ont été limités à 1 000 lignes.
ja: チャートの結果は 1000 行に制限されています。
ko: 차트에 표시되는 결과는 1000개 행으로 제한되었습니다.
zh_cn: 图表上的结果限制为 1000 行。

source: Chart type
de: Diagrammtyp
es: Tipo de gráfico
fr: Type de graphique
ja: チャートの種類
ko: 차트 유형
zh_cn: 图表类型

source: Bars
de: Leisten
es: Barras
fr: Barres
ja: 棒グラフ
ko: 막대
zh_cn: 条

source: Lines
de: Zeilen
es: Líneas
fr: Lignes
ja: 折れ線グラフ
ko: 줄
zh_cn: 线

source: Pie
de: Kreis
es: Circular
fr: Diagramme
ja: 円グラフ
ko: 파이
zh_cn: 圆形

source: X-Axis
de: X-Achse
es: Eje X
fr: Axe des abscisses
ja: X 軸
ko: X축
zh_cn: X 轴

source: Y-Axis
de: Y-Achse
es: Eje Y
fr: Axe des ordonnées
ja: Y 軸
ko: Y축
zh_cn: Y 轴

source: No sorting
de: Keine Sortierung
es: Sin clasificación
fr: Aucun tri
ja: ソートなし
ko: 정렬되지 않음
zh_cn: 不排序

source: Sort ascending
de: Aufsteigend sortieren
es: Clasificar en orden ascendente
fr: Tri ascendant
ja: 昇順でソート
ko: 오름차순으로 정렬
zh_cn: 升序
