Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Error loading table %(table)s: Operation timeout.
de: Fehler beim Laden der Tabelle %(table)s: Operation-Timeout.
es: Error al cargar la tabla %(table)s: tiempo de espera de la operación.
fr: Erreur lors du chargement de la table %(table)s : l'opération a expiré.
ja: テーブル %(table)s のロードでエラーが発生しました。操作はタイムアウトします。
ko: 테이블 %(table)s 로드 중 오류 발생: 작업 시간이 초과되었습니다.
zh_cn: 加载表 %(table)s 时出错：操作超时。

source: Error loading table %(table)s: %(error)s.
de: Fehler beim Laden der Tabelle %(table)s: %(error)s.
es: Error al cargar la tabla %(table)s: %(error)s.
fr: Erreur lors du chargement de la table %(table)s : %(error)s.
ja: テーブル %(table)s のロード中にエラーが発生しました：%(error)s。
ko: 테이블 %(table)s 로드 중 오류 발생: %(error)s.
zh_cn: 加载表 %(table)s 时出错：%(error)s。

source: Failed to execute alter database statement: %s
de: Anweisung zum Ändern der Datenbank konnte nicht ausgeführt werden: %s
es: Error al ejecutar una instrucción de base de datos alternativa: %s
fr: Échec de l'exécution de l'instruction de modification de la base de données : %s
ko: 데이터베이스 변경 명령문을 실행할 수 없음: %s

source: Failed to execute alter table statement: %s
de: Anweisung zum Ändern der Tabelle konnte nicht ausgeführt werden: %s
es: Error al ejecutar una instrucción de tabla alternativa: %s
fr: Echec de l'exécution de l'instruction de modification de la table : %s
ja: テーブル変更ステートメント %s の実行に失敗しました
ko: 대체 테이블 명령문을 실행할 수 없음: %s
zh_cn: 无法执行 alter table 语句：%s

source: Failed to execute alter column statement: %s
de: Anweisung zum Ändern der Spalte konnte nicht ausgeführt werden: %s
es: Error al ejecutar una instrucción de columna alternativa: %s
fr: Echec de l'exécution de l'instruction de modification de la colonne : %s
ja: 列変更ステートメント %s の実行に失敗しました
ko: 대체 열 명령문을 실행할 수 없음: %s
zh_cn: 无法执行 alter column 语句：%s

source: Failed to close session, session handle may already be closed or timed out.
de: Sitzung konnte nicht geschlossen werden. Sitzungs-Handle wurde möglicherweise bereits geschlossen oder ist abgelaufen.
es: Error al cerrar la sesión. Es posible que el control de la sesión esté cerrado o se haya agotado el tiempo de espera.
fr: Echec de la fermeture de la session. Le descripteur de la session est peut-être déjà fermé ou il a expiré.
ja: セッションの終了に失敗しました。セッションの制御がすでに終了しているか、タイムアウトしている可能性があります。
ko: 세션을 닫을 수 없습니다. 세션 핸들이 이미 닫혔거나 시간이 초과되었습니다.
zh_cn: 无法关闭会话，会话句柄可能关闭或超时。

source: Only SELECT statements can be saved. Provided query: %(query)s
de: Nur SELECT-Anweisungen können gespeichert werden. Angegebene Abfrage: %(query)s
es: Solo se pueden guardar las instrucciones SELECT. Consulta facilitada: %(query)s
fr: Vous ne pouvez enregistrer que des instructions SELECT. Requête fournie : %(query)s
ja: SELECT ステートメントのみを保存できます。入力されたクエリ：%(query)s
ko: SELECT 문만 저장할 수 있습니다. 제공된 쿼리: %(query)s
zh_cn: 仅可保存 SELECT 语句。提供的查询；%(query)s

source: Saved query results as new table %(table)s.
de: Abfrageergebnisse wurden als neue Tabelle %(table)s gespeichert.
es: Resultados de la consulta guardados como tabla nueva %(table)s.
fr: Résultats de la requête enregistrée comme nouvelle table %(table)s.
ja: クエリの結果を新しいテーブル %(table)s として保存しました。
ko: 쿼리 결과를 새 테이블 %(table)s(으)로 저장했습니다.
zh_cn: 已将查询结果另存为新表 %(table)s。

source: Server returning invalid handle for query id %(id)d [%(query)s]...
de: Server gibt ungültigen Handle für Abfrage-ID %(id)d [%(query)s] zurück...
es: El servidor está devolviendo un control no válido para el ID de consulta %(id)d [%(query)s]...
fr: Descripteur incorrect renvoyé par le serveur pour l'ID de requête %(id)d [%(query)s]…
ja: サーバーがクエリ ID %(id)d [%(query)s] の無効なハンドルを返しています...
ko: 서버가 쿼리 ID %(id)d [%(query)s]에 대해 잘못된 핸들을 반환하는 중...
zh_cn: 服务器返回查询 id %(id)d [%(query)s] 无效手柄...

source: Query did not return exactly one partition result
de: Abfrage ergab nicht genau ein Partitionsergebnis
es: La consulta no devolvió exactamente un resultado de partición
fr: La requête n'a pas renvoyé exactement un résultat de partition
ja: クエリが 1 つのパーティションの結果を正確に返しませんでした
ko: 쿼리가 정확히 하나의 파티션 결과를 반환하지 않음
zh_cn: 查询未精确返回一个分区结果

source: Could not retrieve logs: %s.
de: Protokolle konnten nicht abgerufen werden: %s.
es: No se han podido recuperar los registros: %s.
fr: Impossible de récupérer les journaux : %s.
ja: ログ %s を取得できませんでした。
ko: 로그를 검색할 수 없음: %s.
zh_cn: 无法检索日志：%s。

source: Unknown exception.
de: Unbekannte Ausnahme.
es: Excepción desconocida.
fr: Exception inconnue.
ja: 不明な例外です。
ko: 알 수 없는 예외입니다.
zh_cn: 未知异常。

source: %s server authentication not supported. Valid are %s.
de: Die %s-Serverauthentifizierung wird nicht unterstützt. Gültig sind %s.
es: La autenticación del servidor de %s no es compatible. Las válidas son %s.
fr: L'authentification du serveur %s n'est pas prise en charge. Les valeurs valides sont %s.
ja: %s サーバー認証はサポートされていません。%s は有効です。
ko: %s 서버 인증이 지원되지 않습니다. %s이(가) 유효합니다.
zh_cn: 不支持 %s 服务器身份验证。%s 有效。

source: %(query)s returned more than 1 row
de: %(query)s ergab mehr als 1 Zeile
es: %(query)s devolvió más de 1 fila
fr: %(query)s a renvoyé plus d'une ligne
ja: %(query)s は 1 行以上を返しました
ko: %(query)s에서 2개 이상의 행을 반환함
zh_cn: 返回的 %(query)s 超过 1 行

source: Failed to determine partition keys for Impala table: `%s`.`%s`
de: Partitionsschlüssel für folgende Impala-Tabelle nicht erkannt: "%s"."%s"
es: Error al determinar las claves de partición de la tabla de Impala: `%s`.`%s`
fr: Impossible de déterminer les clés de partition pour la table Impala : `%s`.`%s`
ja: Impala テーブル `%s`.`%s` のパーティションキーの決定に失敗しました
ko: Impala 테이블에 대한 파티션 키를 결정할 수 없음: `%s`.`%s`
zh_cn: 无法确定 Impala 表的分区键：`%s`.`%s`

source: Beginning of List
de: Anfang der Liste
es: Principio de la lista
fr: Début de la liste
ja: リストの先頭
ko: 목록 시작
zh_cn: 列表开头

source: Previous Page
de: Vorherige Seite
es: Página anterior
fr: Page précédente
ja: 前のページ
ko: 이전 페이지
zh_cn: 上一页

source: Next page
de: Nächste Seite
es: Página siguiente
fr: Page suivante
ja: 次のページ
ko: 다음 페이지
zh_cn: 下一页

source: Next Page
de: Nächste Seite
es: Página siguiente
fr: Page suivante
ja: 次のページ
ko: 다음 페이지
zh_cn: 下一页

source: End of List
de: Ende der Liste
es: Fin de la lista
fr: Fin de la liste
ja: リストの末尾
ko: 목록 끝
zh_cn: 列表结尾

source: Showing %(start)s to %(end)s of %(count)s items, page %(page)s of %(pages)s
de: Anzeige von %(start)s bis %(end)s von %(count)s Elementen, Seite %(page)s von %(pages)s
es: Mostrando de %(start)s a %(end)s elementos de %(count)s, página %(page)s de %(pages)s
fr: Affichage des éléments %(start)s à %(end)s sur %(count)s, page %(page)s sur %(pages)s
ja: %(page)s/%(pages)s ページで %(count)s 件のアイテムのうち、%(start)s から %(end)s までを表示しています
ko: %(page)s / %(pages)s 페이지, %(count)s 항목 중 %(start)s ~ %(end)s을(를) 표시합니다.
zh_cn: 正在显示第 %(page)s 页 %(start)s - %(end)s (共 %(pages)s 页 %(count)s 项)

source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
ja: 設定
ko: 설정
zh_cn: 设置

source: Search for key or value.
de: Nach Schlüssel oder Wert suchen
es: Busque una clave o valor.
fr: Recherchez une clé ou une valeur.
ja: キーまたは値を検索します。
ko: 키 또는 값을 검색합니다.
zh_cn: 搜索键或值。

source: Clear
de: Löschen
es: Limpiar
fr: Effacer
ja: クリア
ko: 지우기
zh_cn: 清除

source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
ko: 키
zh_cn: 键

source: Value
de: Wert
es: Valor
fr: Valeur
ja: 値
ko: 값
zh_cn: 值

source: No data available
de: Keine Daten verfügbar
es: No hay datos disponibles
fr: Aucune donnée disponible
ja: 利用可能なデータがありません
ko: 데이터를 이용할 수 없음
zh_cn: 没有可用数据

source: No matching records
de: Keine übereinstimmenden Datensätze
es: No hay registros coincidentes
fr: Aucun enregistrement correspondant
ja: 一致するレコードがありません
ko: 일치하는 레코드가 없음
zh_cn: 没有匹配记录

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
zh_cn: 关闭

source: Confirm action
de: Aktion bestätigen
es: Confirmar acción
fr: Confirmer l'action
ja: アクションを確認
ko: 작업 확인
zh_cn: 确认操作

source: Yes
de: Ja
es: Sí
fr: Oui
ja: はい
ko: 예
zh_cn: 是

source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
zh_cn: 否

source: Create database
de: Datenbank erstellen
es: Crear base de datos
fr: Créer une base de données
ja: データベースを作成
ko: 데이터베이스 생성
zh_cn: 创建数据库

source: Toggle Assist
de: Hilfe umschalten
es: Activar/desactivar ayuda
fr: Activer/désactiver l'aide
ja: アシストの切り替え
ko: 지원 전환
zh_cn: 切换帮助

source: Create a new database
de: Neue Datenbank erstellen
es: Crear una nueva base de datos
fr: Créer une base de données
ja: 新しいデータベースを作成
ko: 새 데이터베이스 생성
zh_cn: 创建新数据库

source: Step 1: Name
de: Schritt 1: Name
es: Paso 1: nombre
fr: Etape 1 : Nom
ja: 手順 1：名前
ko: 1단계: 이름
zh_cn: 第 1 步：名称

source: Step 2: Location
de: Schritt 2: Speicherort
es: Paso 2: ubicación
fr: Etape 2 : Emplacement
ja: 手順 2：場所
ko: 2단계: 위치
zh_cn: 步骤 2：位置

source: Create a database
de: Eine Datenbank erstellen
es: Crear una base de datos
fr: Créer une base de données
ja: データベースを作成
ko: 데이터베이스 생성
zh_cn: 创建数据库

source: Let's start with a name and description for where we'll store your data.
de: Beginnen wir mit einem Namen und einer Beschreibung für den Speicherort Ihrer Daten.
es: Empecemos con un nombre y una descripción para el lugar donde guardaremos los datos.
fr: Commençons par créer un nom et une description pour l'emplacement où nous stockerons vos données.
ja: データの保存先の名前と説明から開始します。
ko: 데이터를 저장한 위치에 대한 이름과 설명부터 시작해보겠습니다.
zh_cn: 让我们从数据存储位置的名称和描述开始。

source: This field is required. Spaces are not allowed.
de: Dieses Feld ist erforderlich. Leerzeichen sind nicht zulässig.
es: Este campo es obligatorio. No se permiten espacios.
fr: Ce champ est obligatoire. Les espaces sont interdites.
ja: このフィールドは必須です。スペースは使用できません。
ko: 이 필드는 필수 항목입니다. 공백은 허용되지 않습니다.
zh_cn: 此字段为必填字段。不允许有空格。

source: Name of the new database. Database names must be globally unique. Database names tend to correspond to the directory where the data will be stored.
de: Name der neuen Datenbank. Datenbanknamen müssen global eindeutig sein. Datenbanknamen entsprechen normalerweise auch dem Verzeichnis, in dem die Daten gespeichert werden.
es: Nombre de la nueva base de datos. Los nombres de bases de datos deben ser únicos globalmente. Los nombres de bases de datos tienden a corresponder con el directorio en el que se almacenarán los datos.
fr: Nom de la nouvelle base de données. Les noms de base de données doivent être uniques globalement. Les noms de base de données tendent à correspondre au répertoire de stockage des données.
ja: 新しいデータベースの名前です。データベース名は、グローバルに一意であることが必要です。データベース名は、そのデータの保存場所とするディレクトリに対応していることが普通です。
ko: 새 데이터베이스의 이름입니다. 데이터베이스 이름은 전역에서 고유해야 합니다. 데이터베이스 이름은 데이터가 저장될 디렉토리와 유사합니다.
zh_cn: 新数据库的名称。数据库名称必须具有全局唯一性。数据库名称应与数据存储目录对应。

source: Optional
es: Opcional
fr: Facultatif
ja: オプション
ko: 옵션
zh_cn: 可选

source: Use a database comment to describe the database. For example, note the data's provenance and any caveats users need to know.
de: Verwenden Sie einen Datenbankkommentar, um die Datenbank zu beschreiben. Sie können beispielsweise die Herkunft der Daten anmerken oder Hinweise geben, die Benutzer wissen sollten.
es: Utilice un comentario de base de datos para describir la base de datos. Por ejemplo, puede anotar la procedencia de los datos y cualquier advertencia que el usuario necesite conocer.
fr: Utilisez un commentaire de base de données pour décrire la base de données. Indiquez, par exemple, l'origine des données et tous les avertissements destinés aux utilisateurs.
ja: データベースのコメントを使用してデータベースを説明します。たとえば、データの出典や注意など、ユーザーが知っておく必要がある内容を記します。
ko: 데이터베이스를 설명하는 데이터베이스 설명을 사용합니다. 예를 들면, 데이터의 출처와 사용자가 알아야 할 주의 사항 등을 기록해 둡니다.
zh_cn: 使用数据库备注描述数据库。例如，注明数据的出处以及用户需要了解的任何注意事项。

source: Choose Where Your Database's Data is Stored
de: Bestimmen Sie, wo die Daten Ihrer Datenbank gespeichert werden.
es: Seleccione la ubicación en la que se almacenarán los datos de la base de datos
fr: Choisissez l'emplacement de stockage des données de votre base de données
ja: データベースのデータを保存する場所を選択
ko: 데이터베이스의 데이터가 저장될 위치 선택
zh_cn: 选择数据库数据的存储位置

source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
ja: 場所
ko: 위치
zh_cn: 位置

source: Store your database in the default location (controlled by Hive, and typically
de: Speichern Sie Ihre Datenbank am Standardspeicherort (gesteuert durch Hive und typischerweise
es: Almacene la base de datos en la ubicación predeterminada (controlada por Hive y normalmente
fr: Stocker votre base de données dans l'emplacement par défaut (contrôlé par Hive, généralement
ja: デフォルトの場所にデータベースを保存（Hive によって制御され、多くの場合は
ko: 데이터베이스를 기본 위치(보통 Hive가 제어)에 저장
zh_cn: 将数据库存储在默认位置（由 Hive 控制，通常

source: This field is required.
de: Dieses Feld ist erforderlich.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.
ja: このフィールドは必須です。
ko: 이 필드는 필수 항목입니다.
zh_cn: 此字段为必填字段。

source: Enter the path (on HDFS) to your database's data location.
de: Geben Sie den Pfad (in HDFS) zum Speicherort der Daten Ihrer Datenbank an.
es: Introduzca la ruta (en HDFS) hasta la ubicación de los datos de la base de datos.
fr: Indiquez le chemin d'accès (sur HDFS) vers l'emplacement des données de votre base de données.
ja: データベースのデータを保存する場所への（HDFS 上の）パスを入力します。
ko: 데이터베이스의 데이터 위치에 대한 경로(HDFS 상)를 입력합니다.
zh_cn: 输入数据库数据位置的路径（位于 HDFS 上）。

source: Back
de: Zurück
es: Volver
fr: Précédent
ja: 戻る
ko: 뒤로
zh_cn: 返回

source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次
ko: 다음
zh_cn: 下一页

source: Choose a file
de: Datei auswählen
es: Seleccionar un archivo
fr: Choisir un fichier
ja: ファイルを選択
ko: 파일 선택
zh_cn: 选择文件

source: Create table manually
de: Tabelle manuell erstellen
es: Crear tabla manualmente
fr: Créer une table manuellement
ja: 手動でテーブルを作成
ko: 수동으로 테이블 생성
zh_cn: 手动创建表

source: Create a new table from a file
de: Eine neue Tabelle aus einer Datei erstellen
es: Crear una nueva tabla a partir de un archivo
fr: Créer une table à partir d'un fichier
ja: ファイルから新しいテーブルを作成
ko: 파일에서 새 테이블을 생성합니다.
zh_cn: 从文件中创建一个新表

source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
ja: データベース
ko: 데이터베이스
zh_cn: 数据库

source: Create a new table manually
de: Eine neue Tabelle manuell erstellen
es: Crear una nueva tabla manualmente
fr: Créer une table manuellement
ja: 手動で新しいテーブルを作成
ko: 새 테이블을 직접 생성합니다.
zh_cn: 手动创建一个新表

source: Step 2: Record Format
de: Schritt 2: Datensatzformat
es: Paso 2: formato del registro
fr: Etape 2 : Format d'enregistrement
ja: 手順 2：レコードのフォーマット
ko: 2단계: 레코드 형식
zh_cn: 第 2 步：记录格式

source: Step 3: Serialization
de: Schritt 3: Serialisierung
es: Paso 3: serialización
fr: Etape 3 : Sérialisation
ja: 手順 3：シリアル化
ko: 3단계: 직렬화
zh_cn: 第 3 步：序列化

source: Step 4: File Format
de: Schritt 4: Dateiformat
es: Paso 4: formato del archivo
fr: Etape 4 : Format de fichier
ja: 手順 4：ファイルのフォーマット
ko: 4단계: 파일 형식
zh_cn: 第 4 步：文件格式

source: Step 5: Location
de: Schritt 5: Speicherort
es: Paso 5: ubicación
fr: Etape 5 : Emplacement
ja: 手順 5：場所
ko: 5단계: 위치
zh_cn: 步骤 5：位置

source: Step 6: Columns
de: Schritt 6: Spalten
es: Paso 6: columnas
fr: Etape 6 : Colonnes
ja: 手順 6：列
ko: 6단계: 열
zh_cn: 步骤 6：列

source: Create a table
de: Eine Tabelle erstellen
es: Crear una tabla
fr: Créer une table
ja: テーブルを作成
ko: 테이블 생성
zh_cn: 创建表

source: Name of the new table. Table names must be globally unique. Table names tend to correspond to the directory where the data will be stored.
de: Name der neuen Tabelle. Tabellennamen müssen global eindeutig sein. Tabellennamen entsprechen normalerweise auch den Verzeichnissen, in denen die Daten gespeichert werden.
es: Nombre de la nueva tabla. Los nombres de tabla deben ser únicos globalmente. Los nombres de tabla tienden a corresponder con el directorio en el que se almacenarán los datos.
fr: Nom de la nouvelle table. Les noms de table doivent être uniques globalement. Les noms de table tendent à correspondre au répertoire de stockage des données.
ja: 新しいテーブルの名前。テーブル名はグローバルに一意であることが必要です。テーブル名は、そのデータの保存場所とするディレクトリに対応していることが普通です。
ko: 새 테이블의 이름입니다. 테이블 이름은 전역에서 고유해야 합니다. 테이블 이름은 데이터가 저장될 디렉토리와 유사합니다.
zh_cn: 新表的名称。表名必须具有全局唯一性。表名应与数据存储目录对应。

source: Use a table comment to describe your table. For example, note the data's provenance and any caveats users need to know.
de: Verwenden Sie einen Tabellenkommentar, um die Tabelle zu beschreiben. Sie könnten etwa die Herkunft der Daten anmerken oder Hinweise geben, die Benutzer wissen sollten.
es: Utilice un comentario de tabla para describir la tabla. Por ejemplo, puede anotar la procedencia de los datos y cualquier advertencia que el usuario necesite conocer.
fr: Utilisez un commentaire de table pour décrire votre table. Indiquez, par exemple, l'origine des données et tous les avertissements destinés aux utilisateurs.
ja: テーブルのコメントを使用してテーブルを説明します。たとえば、データの出典や注意など、ユーザーが知っておく必要がある内容を記します。
ko: 테이블을 설명하는 테이블 설명을 사용합니다. 예를 들면, 데이터의 출처와 사용자가 알아야 할 주의 사항 등을 기록해 둡니다.
zh_cn: 使用表备注描述您的表。例如，注明数据的出处以及用户需要了解的注意事项。

source: Choose Your Record Format
de: Datensatzformat auswählen
es: Seleccione el formato del registro
fr: Choisir le format d'enregistrement
ja: レコードのフォーマットの選択
ko: 레코드 형식 선택
zh_cn: 选择您的记录格式

source: Individual records are broken up into columns either with delimiters (e.g., CSV or TSV) or using a specific serialization/deserialization (SerDe) implementation. (One common specialized SerDe is for parsing out columns with a regular expression.)
de: Einzelne Datensätze werden in Spalten aufgeteilt, entweder mit Trennzeichen (z. B. CSV oder TSV) oder mithilfe einer spezifischen Serialisierung/Deserialisierung (SerDe)-Implementierung. (Eine verbreitete spezialisierte SerDe ist für das Parsen von Spalten mit einem regulären Ausdruck.)
es: Los registros individuales se dividen en columnas con delimitadores (p. ej., CSV o TSV) o mediante una implementación de serialización/deserialización (SerDe). (Una SerDe especializada común sirve para analizar columnas con una expresión regular).
fr: Les enregistrements individuels sont fragmentés dans des colonnes avec des délimiteurs (par ex. CSV ou TSV) ou à l'aide d'une implémentation de sérialisation/désérialisation spécifique (SerDe). (Une SerDe spécifique courante est l'analyse de colonnes avec une expression régulière.)
ja: 個々のレコードは、区切り文字（CSV、TSV など）または固有のシリアル化と非シリアル化（SerDe）の実装を使用して列の集合に分解されます（広く使用する専用の SerDe として、正規表現を使用して列を解析するものがあります）。
ko: 개별 레코드는 구분 기호(예: CSV 또는 TSV) 또는 특정 직렬화/직렬화 해제(SerDe) 구현을 사용하여 열로 구분됩니다(일반적인 특수 SerDe 중 하나는 정규식을 사용하여 열을 구문 분석하는 데 사용됨).
zh_cn: 单独的记录将使用分隔符（例如，CSV 或 TSV）或使用特定的序列化/反序列化 (SerDe) 实施分割为多个列。（一个常见的专用 SerDe 是使用正则表达式解析列。）

source: Record format
de: Datensatzformat
es: Formato del registro
fr: Format d'enregistrement
ja: レコードのフォーマット
ko: 레코드 형식
zh_cn: 记录格式

source: Delimited
de: Getrennt
es: Delimitado
fr: Délimité
ja: 区切り文字付き
ko: 기호로 구분됨
zh_cn: 已分隔

source: (Data files use delimiters, like commas (CSV) or tabs.)
de: (Datendateien verwenden Trennzeichen, etwa Kommas (CSV) oder Tabs.)
es: (Los archivos de datos utilizan delimitadores, como comas (CSV) o tabuladores).
fr: (Les fichiers de données utilisent des délimiteurs, comme des virgules (CSV) ou des tabulations.)
ja: （カンマ（CSV）やタブなどの区切り文字をデータファイルで使用します。）
ko: (데이터 파일에서 쉼표(CSV) 또는 탭과 같은 구분 기호를 사용합니다.)
zh_cn: （数据文件使用分隔符，如逗号 (CSV) 或制表符。）

source: (Enter a specialized serialization implementation.)
de: (Geben Sie eine spezialisierte Serialisierungs-Implementation ein.)
es: (Introduzca una implementación de serialización especializada).
fr: (Indiquez une implémentation de sérialisation spécifique.)
ja: （専用のシリアル化実装を入力します。）
ko: (특수 직렬화 구현을 입력하십시오.)
zh_cn: （输入一个专用的序列化实施。）

source: Configure Record Serialization
de: Datensatz-Serialisierung konfigurieren
es: Configurar serialización de registro
fr: Configurer une sérialisation d'enregistrement
ja: レコードのシリアル化の設定
ko: 레코드 직렬화 구성
zh_cn: 配置记录序列

source: Only supports single-character delimiters.
de: Unterstützt nur Ein-Zeichen-Trennzeichen.
es: Solo admite delimitadores de un único carácter.
fr: Ne prend en charge que les délimiteurs de type caractère unique.
ja: 1 文字の区切り文字のみを使用できます。
ko: 한 자의 구분 기호만을 지원합니다.
zh_cn: 仅支持单字符分隔符。

source: Enter the column delimiter. Must be a single character. Use syntax like "\001" or " " for special characters.
de: Geben Sie das Spalten-Trennzeichen ein. Es muss ein einzelnes Zeichen sein. Verwenden Sie für Sonderzeichen eine Syntax wie "\001" oder " ".
es: Introduzca el delimitador de columna. Debe ser un único carácter. Utilice una sintaxis como "\001" o " " para caracteres especiales.
fr: Entrez le délimiteur de colonne. Il ne doit comporter qu'un seul caractère. Utilisez une syntaxe de type "\001" ou " " pour les caractères spéciaux.
ja: 列の区切り文字を入力します。これは 1 文字とする必要があります。特殊文字には "\001" や " " のような構文を使用します。
ko: 열 구분 기호를 입력합니다. 구분 기호는 한 자여야 합니다. 특수 문자의 경우 "\001" 또는 " "와 같은 구문을 사용하십시오.
zh_cn: 输入列分隔符。必须是单个字符。对于特殊字符，请使用 ""\001"" 或 "" "" 等语法。

source: Use for array types.
de: Für Array-Typen verwenden.
es: Utilizar para tipos de matriz.
fr: A utiliser pour les types tableau.
ja: 配列型を使用します。
ko: 어레이 유형에 사용합니다.
zh_cn: 用于数组类型。

source: Use for map types.
de: Für Map-Typen verwenden.
es: Utilizar para tipos de map.
fr: A utiliser pour les types de map.
ja: map 型を使用します。
ko: Map 유형에 사용합니다.
zh_cn: 用于 map 类型。

source: The Java class name of your SerDe.
de: Der Java-Klassenname Ihres SerDe.
es: El nombre de la clase Java de su SerDe.
fr: Nom de classe Java de votre SerDe.
ja: SerDe の Java クラス名です。
ko: SerDe의 Java 클래스 이름입니다.
zh_cn: SerDe 的 Java 类名称。

source: e.g.
de: z.B.
es: p. ej.
fr: par ex.
ja: たとえば、
ko: 예:
zh_cn: 例如

source: Properties to pass to the (de)serialization mechanism.
de: Eigenschaften zur Übergabe an den (De)Serialisierungs-Mechanismus.
es: Propiedades que pasar al mecanismo de (de)serialización.
fr: Propriétés pour passer au mécanisme de (dé)sérialisation.
ja: シリアル化（非シリアル化）機能に渡すプロパティ。
ko: 직렬화 (해제) 메커니즘을 전달하는 속성입니다.
zh_cn: 要传递给（反）序列化机制的属性。

source: Choose a File Format
de: Dateiformat auswählen
es: Seleccionar un formato de archivo
fr: Choisir un format de fichier
ja: ファイルフォーマットの選択
ko: 파일 형식 선택
zh_cn: 选择文件格式

source: Use
de: Verwenden
es: Usar
fr: Utiliser
ja: 使用：
ko: 사용
zh_cn: 使用

source: for newline-delimited text files.
de: für mit Zeilenumbruch getrennte Textdateien.
es: para archivos de texto delimitados por nueva línea.
fr: pour les fichiers texte délimités par des sauts de ligne.
ja: 改行区切りテキストファイルには
ko: 줄 바꿈 문자로 구분된 텍스트 파일용입니다.
zh_cn: 用于换行分隔的文本文件。

source: for Hadoop's binary serialization format.
de: für Hadoops binäres Serialisierungsformat.
es: para formato de serialización binaria de Hadoop.
fr: pour le format de sérialisation binaire de Hadoop.
ja: Hadoop のバイナリシリアル化フォーマットには
ko: Hadoop의 바이너리 직렬화 형식에 사용
zh_cn: 用于 Hadoop 的二进制序列化格式。

source: to choose a custom implementation.
de: um eine benutzerdefinierte Implementierung zu wählen.
es: para seleccionar una implementación personalizada.
fr: pour choisir une implémentation personnalisée.
ja: カスタム実装の選択をするには
ko: 사용자 지정 구현 선택
zh_cn: 以选择自定义实现。

source: File format
de: Dateiformat
es: Formato de archivo
fr: Format de fichier
ja: ファイルフォーマット
ko: 파일 형식
zh_cn: 文件格式

source: Java class used to read data.
de: Zum Lesen von Daten verwendete Java-Klasse
es: Clase Java utilizada para leer datos.
fr: Classe Java utilisée pour la lecture de données.
ja: データの読み取りに使用する Java クラスです。
ko: 데이터를 읽는 데 사용된 Java 클래스입니다.
zh_cn: 用于读取数据的 Java 类。

source: Java class used to write data.
de: Zum Schreiben von Daten verwendete Java-Klasse
es: Clase Java utilizada para escribir datos.
fr: Classe Java utilisée pour l'écriture de données.
ja: データの書き込みに使用する Java クラスです。
ko: 데이터를 쓰는 데 사용된 Java 클래스입니다.
zh_cn: 用于写入数据的 Java 类。

source: Choose Where Your Table's Data is Stored
de: Bestimmen Sie, wo die Daten der Tabelle gespeichert sind.
es: Seleccione la ubicación en la que se almacenarán los datos de la tabla
fr: Choisissez l'emplacement de stockage des données de votre table
ja: テーブルのデータを保存する場所を選択
ko: 테이블의 데이터가 저장될 위치 선택
zh_cn: 选择表数据的存储位置
