Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Sort descending
de: Absteigend sortieren
es: Clasificar en orden descendente
fr: Tri descendant
ja: 降順でソート
ko: 내림차순으로 정렬
zh_cn: 降序

source: Latitude
de: Breite
es: Latitud
ja: 緯度
ko: 위도
zh_cn: 纬度

source: Longitude
de: Länge
es: Longitud
ja: 経度
ko: 경도
zh_cn: 经度

source: Label
de: Kennzeichnung
es: Etiqueta
fr: Etiquette
ja: ラベル
ko: 레이블
zh_cn: 标签

source: Please select a chart type.
de: Wählen Sie einen Diagrammtyp aus.
es: Seleccione un tipo de gráfico.
fr: Sélectionnez un type de graphique.
ja: チャートの種類を選択してください。
ko: 차트 종류를 선택하십시오.
zh_cn: 请选择一个图表类型。

source: Please specify parameters for this query
de: Parameter für diese Abfrage angeben
es: Especifique los parámetros de esta consulta
fr: Indiquez des paramètres pour cette requête
ja: このクエリのパラメーターを指定してください
ko: 이 쿼리의 매개변수를 지정하십시오.
zh_cn: 请为此查询指定参数

source: Execute query
de: Abfrage ausführen
es: Ejecutar consulta
fr: Exécuter une requête
ja: クエリを実行
ko: 쿼리 실행
zh_cn: 执行查询

source: Explain query
de: Abfrage erklären
es: Explicar consulta
fr: Expliquer la requête
ja: クエリの実行計画
ko: 쿼리 설명
zh_cn: 解释查询

source: Select a directory
de: Verzeichnis auswählen
es: Seleccionar un directorio
fr: Sélectionnez un répertoire
ja: ディレクトリを選択
ko: 디렉토리 선택
zh_cn: 选择一个目录

source: Select a file or directory
de: Datei oder Verzeichnis auswählen
es: Seleccionar un archivo o directorio
fr: Sélectionnez un fichier ou un répertoire
ja: ファイルまたはディレクトリを選択
ko: 파일 또는 디렉토리 선택
zh_cn: 选择一个文件或目录

source: Choose a name
de: Wählen Sie einen Namen
es: Seleccionar un nombre
fr: Choisir un nom
ja: 名前を選択
ko: 이름 선택
zh_cn: 选择名称

source: Save Query Results
de: Abfrageergebnisse speichern
es: Guardar resultados de la consulta
fr: Enregistrer les résultats de la requête
ja: クエリの結果を保存
ko: 쿼리 결과 저장
zh_cn: 保存查询结果

source: In an HDFS file
de: In einer HDFS-Datei
es: En un archivo HDFS
fr: Dans un fichier HDFS
ja: HDFS ファイルに
ko: HDFS 파일에
zh_cn: 在 HDFS 文件中

source: Path to CSV file
de: Pfad zu CSV-Datei
es: Ruta al archivo CSV
fr: Chemin d'accès au fichier CSV
ja: CSV ファイルへのパス
ko: CSV 파일 경로
zh_cn: CSV 文件路径

source: In a new table
de: In einer neuen Tabelle
es: En una nueva tabla
fr: Dans une nouvelle table
ja: 新しいテーブルに
ko: 새 테이블에서
zh_cn: 在新表中

source: Table name or <database name>.<table name>
de: Tabellenname oder <database name>.<table name>
es: Nombre de tabla o <database name>.<table name>
fr: Nom de la table ou <database name>.<table name>
ja: テーブル名または <database name>.<table name>
ko: 테이블 이름 또는 <database name>.<table name>
zh_cn: 表名或 <database name>.<table name>

source: Big Query in HDFS
de: Große Abfrage in HDFS
es: Consulta de gran tamaño en HDFS
fr: Requête volumineuse dans HDFS
ja: HDFS 内の大きいクエリ
ko: HDFS 내 대량 쿼리
zh_cn: HDFS 中的大查询

source: Use this option if you have a large result. It will rerun the entire query and save the results to the chosen HDFS directory.
de: Verwenden Sie diese Option, wenn ein umfangreiches Ergebnis vorliegt. Dabei wird die gesamte Abfrage erneut ausgeführt. Die Ergebnisse werden im ausgewählten HDFS-Verzeichnis gespeichert.
es: Utilice esta opción si tiene un resultado de gran tamaño. Volverá a ejecutar toda la consulta y guardará los resultados en el directorio HDFS seleccionado.
fr: Utilisez cette option si vous disposez d'un résultat volumineux. Elle relance l'exécution de la requête et enregistre ses résultats dans le répertoire HDFS sélectionné.
ja: 結果が多い場合はこのオプションを使用します。クエリ全体が再実行され、結果は選択した HDFS ディレクトリに保存されます。
ko: 대량의 결과를 얻는 경우 이 옵션을 사용하면 전체 쿼리를 다시 실행하고 선택한 HDFS 디렉토리에 결과를 저장합니다.
zh_cn: 如果具有大量结果，请使用此选项。它将返回整个查询并将结果保存至所选 HDFS 目录。

source: Show advanced fields
de: Erweiterte Felder anzeigen
es: Mostrar campos avanzados
fr: Afficher les champs avancés
ja: 詳細フィールドを表示
ko: 고급 필드 표시
zh_cn: 显示高级字段

source: Hide advanced fields
de: Erweiterte Felder ausblenden
es: Ocultar campos avanzados
fr: Masquer les champs avancés
ja: 詳細フィールドを非表示
ko: 고급 필드 숨기기
zh_cn: 隐藏高级字段

source: Confirm History Clear
de: Löschen des Verlaufs bestätigen
es: Confirmar borrado de historial
fr: Confirmer l'effacement de l'historique
ja: 履歴のクリアを確認
ko: 기록 지우기 확인
zh_cn: 确认历史记录清除

source: Are you sure you want to clear the query history?
de: Möchten Sie den Abfrageverlauf wirklich löschen?
es: ¿Está seguro de que desea borrar el historial de consultas?
fr: Voulez-vous vraiment supprimer l'historique des requêtes ?
ja: クエリの履歴をクリアしてもよろしいですか？
ko: 쿼리 기록을 지우시겠습니까?
zh_cn: 是否确定要清除查询历史记录？

source: Invalid Query
de: Ungültige Abfrage
es: Consulta no válida
fr: Requête incorrecte
ja: 無効なクエリ
ko: 올바르지 않은 쿼리
zh_cn: 查询无效

source: Query requires a select or an aggregate.
de: Abfrage erfordert eine Auswahl oder eine Sammlung.
es: La consulta requiere una selección o un agregado.
fr: La requête nécessite une sélection ou un agrégat.
ja: クエリでは、選択または集計が必要です。
ko: 쿼리에 선택 또는 집계가 필요합니다.
zh_cn: 查询需要选择或聚合。

source: There was a problem loading the stats.
de: Problem beim Laden der Statistiken.
es: Se ha producido un problema al cargar las estadísticas.
fr: Un problème s'est produit lors du chargement des statistiques.
ja: 統計のロード中に問題が発生しました。
ko: 상태를 로드하는 중에 문제가 발생했습니다.
zh_cn: 加载状态时出现问题。

source: Showing _START_ to _END_ of _TOTAL_ entries
de: _START_ bis _END_ von _TOTAL_ Einträge werden angezeigt
es: Mostrando de _START_ a _END_ entradas de _TOTAL_
fr: Affichage des entrées _START_ to _END_ of _TOTAL_
ja: _TOTAL_ 件のエントリの _START_ から _END_ までを表示
ko: _START_ to _END_ of _TOTAL_ 항목 표시
zh_cn: 显示 _START_ - _END_，共 _TOTAL_ 个条目

source: Showing 0 to 0 of 0 entries
de: 0 bis 0 von 0 Einträgen werden angezeigt
es: Mostrando de 0 a 0 entradas de 0
fr: Affichage des entrées 0 à 0 sur 0
ja: 0 件のエントリの 0 から 0 までを表示
ko: 0~0개(전체 0개 중) 항목 표시
zh_cn: 显示 0－0，共 0 个条目

source: (filtered from _MAX_ total entries)
de: (gefiltert von _MAX_ gesamten Einträgen)
es: (filtrado de _MAX_ entradas totales)
fr: (filtrées à partir des entrées totales _MAX_)
ja: （合計 _MAX_ 件のエントリからフィルタ処理）
ko: (총 _MAX_ 항목에서 필터링됨)
zh_cn: （已从 _MAX_ 个总条目中过滤）

source: First
de: Erster
es: Primero
fr: Premier
ja: 先頭
ko: 처음
zh_cn: 第一个

source: Last
de: Letzter
es: Último
fr: Dernier
ja: 末尾
ko: 마지막
zh_cn: 最后一个

source: Previous
de: Zurück
es: Anterior
fr: Précédent
ja: 前
ko: 이전
zh_cn: 上一页

source: See results...
de: Ergebnisse anzeigen...
es: Ver resultados...
fr: Afficher les résultats…
ja: 結果を参照...
ko: 결과 보기...
zh_cn: 请查看结果...

source: Example: SELECT * FROM tablename, or press CTRL + space
de: Beispiel: "SELECT * FROM Tabellenname", oder STRG + Leerzeichen drücken
es: Ejemplo: SELECT * FROM nombre de tabla o pulse CTRL + espacio
fr: Exemple : SELECT * FROM nom_de_table ou appuyez sur CTRL + espace
ja: 例：SELECT * FROM テーブル名、または CTRL キーを押したまま Space キーを押す
ko: 예: SELECT * FROM 테이블 이름 또는 Ctrl + space 누르기
zh_cn: 示例：SELECT * FROM 表名，或按 CTRL + 空格键

source: Press "tab", then "enter".
de: Drücken Sie die Tabulator- und dann die Eingabetaste.
es: Pulse la tecla "tab" y, a continuación, "intro".
fr: Appuyez sur "Tab", puis sur "Entrée".
ja: Tab キーを押し、続いて Enter キーを押します。
ko: "tab", "enter"를 차례로 누르십시오.
zh_cn: 按“tab”键，再按“enter”。

source: Results exceeds maximum number of columns permitted by Excel, will truncate results to 255 columns.
de: Die Ergebnisse überschreiten die maximal zulässige Anzahl an Spalten in Excel. Das Ergebnis wird auf 255 Spalten gekürzt.
es: Los resultados superan el número máximo de columnas que permite Excel. Los resultados se truncarán a 255 columnas.
fr: Les résultats dépassent le nombre maximum de colonnes accepté par Excel, qui tronque les résultats à 255 colonnes.
ja: 結果は Excel で許容される最大列数を超えており、255 列で切り捨てられます。
ko: 결과가 Excel에서 허용하는 최대 열 수를 초과하므로, 255개 열로 결과가 잘립니다.
zh_cn: 结果超过 Excel 允许的最大列数，将结果截断为 255 列。

source: Empty description
de: Leere Beschreibung
es: Descripción vacía
fr: Vider la description
ja: 空の説明
ko: 설명 없음
zh_cn: 空描述

source: Please select the latitude and longitude columns.
de: Wählen Sie die Spalten "Breite" und "Länge" aus.
es: Seleccione las columnas de latitud y longitud.
fr: Sélectionnez les colonnes latitude et longitude.
ja: 緯度と経度の列を選択してください。
ko: 위도와 경로 열을 선택하십시오.
zh_cn: 请选择纬度列和经度列。

source: Please select the columns you would like to see in this chart.
de: Wählen Sie die Spalten aus, die in diesem Diagramm enthalten sein sollen.
es: Seleccione las columnas que desee ver en este gráfico.
fr: Sélectionnez les colonnes que vous souhaitez visualiser dans ce graphique.
ja: このチャートに表示する列を選択してください。
ko: 이 차트에 표시할 열을 선택하십시오.
zh_cn: 请选择您想要在此图表中查看的列。

source: MR Jobs
es: Trabajos de MR
fr: Jobs MR
ja: MR Job
ko: MR Job
zh_cn: MR 作业

source: Please select a column
de: Wählen Sie eine Spalte aus
es: Seleccione una columna
fr: Veuillez sélectionner une colonne
ja: 列を選択してください
ko: 열을 선택하십시오.
zh_cn: 请选择一列

source: No query provided to save.
de: Keine zu speichernde Abfrage angegeben.
es: No se ha indicado ninguna consulta que guardar.
fr: Aucune requête fournie pour l'enregistrement.
ja: 保存するクエリが指定されていません。
ko: 저장할 쿼리를 제공하지 않았습니다.
zh_cn: 没有提供要保存的查询。

source: Server error occurred:
de: Serverfehler aufgetreten:
es: Se ha producido un error en el servidor:
fr: Erreur du serveur :
ja: サーバーエラーが発生しました：
ko: 서버 오류 발생:
zh_cn: 出现服务器错误：

source: Hue server is probably down.
de: Hue Server ist wahrscheinlich inaktiv.
es: Es posible que Hue Server se encuentre inactivo.
fr: Le serveur Hue est probablement en panne.
ja: Hue Server がダウンしていている可能性があります。
ko: Hue 서버가 작동하지 않을 수 있습니다.
zh_cn: Hue 服务器可能会关闭。

source: Unmanageable server error occurred:
de: Unkontrollierbarer Serverfehler aufgetreten:
es: Se ha producido un error de servidor no administrable:
fr: Une erreur de serveur non gérable s'est produite :
ja: 管理不能なサーバーエラーが発生しました：
ko: 관리할 수 없는 서버 오류 발생:
zh_cn: 出现无法管理的服务器错误：

source: Query saved.
de: Abfrage gespeichert.
es: Consulta guardada.
fr: Requête enregistrée.
ja: クエリを保存しました。
ko: 쿼리가 저장되었습니다.
zh_cn: 已保存查询。

source: Could not save design
de: Design konnte nicht gespeichert werden
es: No se ha podido guardar el diseño
fr: Impossible d'enregistrer la conception
ja: 設計を保存できませんでした
ko: 디자인을 저장할 수 없음
zh_cn: 无法保存设计

source: Could not save results
de: Ergebnisse konnten nicht gespeichert werden
es: No se pudieron guardar los resultados
fr: Impossible d'enregistrer les résultats
ja: 結果を保存できませんでした
ko: 결과를 저장할 수 없음
zh_cn: 无法保存结果

source: Problem:
es: Problema:
fr: Problème :
ja: 問題：
ko: 문제:
zh_cn: 问题：

source: Query canceled!
de: Abfrage abgebrochen!
es: ¡Consulta cancelada!
fr: Requête annulée !
ja: クエリがキャンセルされました。
ko: 쿼리가 취소되었습니다!
zh_cn: 已取消查询！

source: Did you know?
de: Wussten Sie schon?
es: ¿Lo sabía?
fr: Le saviez-vous ?
ja: 便利な使い方
ko: 유용한 정보
zh_cn: 您知道吗？

source: Missing some tables? In order to update the list of tables/metadata seen by Impala, execute one of these queries:
de: Fehlen Tabellen? Führen Sie eine der folgenden Abfragen aus, um die Liste der für Impala sichtbaren Tabellen/Metadaten zu aktualisieren:
es: ¿Faltan algunas tablas? Para actualizar la lista de tablas/metadatos que ve Impala, ejecute una de las siguientes consultas:
fr: Il manque certaines tables ? Afin de mettre à jour la liste des tables/métadonnées suivies par Impala, exécutez l'une de ces requêtes :
ja: 足りないテーブルがありますか？Impala が認識するテーブル／メタデータのリストを更新するには、次のクエリのいずれかを実行します：
ko: 일부 테이블이 없습니까? Impala에 표시된 테이블/메타데이터 목록을 업데이트하려면 다음 쿼리 중 하나를 실행하십시오.
zh_cn: 缺少某些表？为了更新 Impala 能够查看的表/元数据列表，请执行以下查询之一：

source: Create table from file
de: Tabelle aus Datei erstellen
es: Crear una tabla a partir de un archivo
fr: Créer une table à partir d'un fichier
ja: ファイルからテーブルを作成
ko: 파일에서 테이블 생성
zh_cn: 从文件中创建一个表

source: Step 1: Choose File
de: Schritt 1: Datei wählen
es: Paso 1: seleccionar archivo
fr: Etape 1 : choisir un fichier
ja: 手順 1：ファイルの選択
ko: 1단계: 파일 선택
zh_cn: 第 1 步：选择文件

source: Step 2: Choose Delimiter
de: Schritt 2: Trennzeichen wählen
es: Paso 2: seleccionar delimitador
fr: Etape 2 : choisir un délimiteur
ja: 手順 2：区切り文字の選択
ko: 2단계: 구분 기호 선택
zh_cn: 第 2 步：选择分隔符

source: Step 3: Define Columns
de: Schritt 3: Spalten definieren
es: Paso 3: definir columnas
fr: Etape 3 : définir les colonnes
ja: 手順 3：列の定義
ko: 3단계: 열 정의
zh_cn: 第 3 步：定义列

source: Choose a Delimiter
de: Trennzeichen wählen
es: Seleccionar un delimitador
fr: Choisir un délimiteur
ja: 区切り文字を選択
ko: 구분 기호 선택
zh_cn: 选择分隔符

source: Beeswax has determined that this file is delimited by
de: Beeswax hat festgestellt, wird diese Datei getrennt ist durch
es: Beeswax ha determinado que este archivo está delimitado por
fr: Beeswax a déterminé que ce fichier est délimité par
ja: Beeswax は、このファイルが次の文字で区切られていると判断しました：
ko: Beeswax에서 결정한 이 파일의 구분 기호:
zh_cn: Beeswax 已确定此文件被分隔

source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu
ja: プレビュー
ko: 미리 보기
zh_cn: 预览

source: Enter the column delimiter which must be a single character. Use syntax like "\001" or " " for special characters.
de: Geben Sie das Spalten-Trennzeichen ein. Es muss ein einzelnes Zeichen sein. Verwenden Sie für Sonderzeichen eine Syntax wie "\001" oder " ".
es: Introduzca el delimitador de columna, que debe ser un único carácter. Utilice una sintaxis como "\001" o " " para caracteres especiales.
fr: Entrez le délimiteur de colonne, qui ne doit comporter qu'un seul caractère. Utilisez une syntaxe de type "\001" ou " " pour les caractères spéciaux.
ja: 列の区切り文字を入力します。これは 1 文字とする必要があります。特殊文字には "\001" や " " のような構文を使用します。
ko: 한 자여야 하는 열 구분 기호를 입력합니다. 특수 문자의 경우 "\001" 또는 " "와 같은 구문을 사용하십시오.
zh_cn: "输入列分隔符，该分隔符必须是单个字符。对于特殊字符，请使用 ""\001"" 或 "" "" 等语法。"

source: Table preview
de: Tabellenvorschau
es: Vista previa de tabla
fr: Aperçu de la table
ja: テーブルのプレビュー
ko: 테이블 미리 보기
zh_cn: 表预览

source: Type your delimiter here
de: Geben Sie Ihr Trennzeichen hier ein
es: Introduzca el delimitador aquí
fr: Saisissez votre délimiteur ici
ja: ここに区切り文字を入力してください
ko: 여기에 구분 기호 입력
zh_cn: 在此处键入您的分隔符

source: Name Your Table and Choose A File
de: Benennen Sie Ihre Tabelle und wählen Sie eine Datei aus.
es: Asigne un nombre a la tabla y seleccione un archivo
fr: Nommez votre table et choisissez un fichier
ja: テーブルの命名とファイルの選択
ko: 테이블 이름 입력 및 파일 선택
zh_cn: 对表命名并选择文件

source: Use a table comment to describe the table. For example, note the data's provenance and any caveats users need to know.
de: Verwenden Sie einen Tabellenkommentar, um die Tabelle zu beschreiben. Sie könnten etwa die Herkunft der Daten anmerken oder Hinweise geben, die Benutzer wissen sollten.
es: Utilice un comentario de tabla para describir la tabla. Por ejemplo, puede anotar la procedencia de los datos y cualquier advertencia que los usuarios necesiten conocer.
fr: Utilisez un commentaire de table pour décrire la table. Indiquez, par exemple, l'origine des données et tous les avertissements destinés aux utilisateurs.
ja: テーブルのコメントを使用してテーブルを説明します。たとえば、データの出典や注意など、ユーザーが知っておく必要がある内容を記します。
ko: 테이블을 설명하는 테이블 설명을 사용합니다. 예를 들어, 데이터의 출처와 사용자가 알아야 할 주의 사항 등을 기록해 둡니다.
zh_cn: 使用表备注描述表。例如，注明数据的出处以及用户需要了解的注意事项。

source: The path to the file(s) or directory on which to base this new table definition. It can be compressed (gzip) or not.
de: Der Pfad zu den Dateien oder zu dem Verzeichnis, auf dem diese neue Tabellendefinition aufbauen soll. Sie ist möglicherweise komprimiert (gzip).
es: La ruta de los archivos o directorio en los que se basa esta nueva definición de tabla. Puede estar comprimido (gzip) o no.
fr: Chemin d'accès aux fichiers ou au répertoire sur lequel doit reposer cette nouvelle définition de table. Il peut être compressé (gzip) ou non.
ko: 새 테이블 정의를 기준으로 할 파일 또는 디렉토리에 대한 경로입니다. 압축(gzip)하거나 압축하지 않을 수 있습니다.

source: Select whether table data should be imported, external or empty.
de: Auswählen, ob die Tabellendaten importiert, extern oder leer sein sollen.
es: Seleccione si los datos de tabla se deben importar, ser externos o estar vacíos.
fr: Indiquez si les données de table doivent être importées, externes ou vides.
ko: 테이블 데이터를 가져올지, 외부에 둘지 또는 비울지 선택하십시오.

source: The selected file is going to be moved during the import.
de: Die ausgewählte Datei wird während des Imports verschoben.
es: El archivo seleccionado se va a mover durante la importación.
fr: Le fichier sélectionné sera déplacé lors de l'importation.
ja: 選択したファイルはインポートの際に移動します。
ko: 선택한 파일은 가져오는 동안 이동됩니다.
zh_cn: 所选文件将在导入过程中移动。

source: Define your columns
de: Spalten definieren
es: Defina las columnas
fr: Définissez vos colonnes
ja: 列を定義
ko: 열 정의
zh_cn: 定义列

source: Use first row as column names
de: Erste Zeile als Spaltennamen verwenden
es: Utilizar la primera fila como nombres de columnas
fr: Utiliser la première ligne comme noms de colonne
ja: 最初の行を列名として使用
ko: 첫째 행을 열 이름으로 사용
zh_cn: 使用第一行作为列名称

source: Bulk edit column names
de: Spaltennamen zusammen bearbeiten
es: Editar nombres de columnas en bloque
fr: Modifier les noms de colonne par bloc
ja: 列名を一括編集
ko: 열 이름 일괄 편집
zh_cn: 批量编辑列名

source: Sample Row
de: Beispielzeile
es: Fila de ejemplo
fr: Exemple de ligne
ja: サンプル行
ko: 샘플 행
zh_cn: 样本行

source: Create Table
de: Tabelle erstellen
es: Crear tabla
fr: Créer une table
ja: テーブルを作成
ko: 테이블 생성
zh_cn: 创建表

source: Write or paste comma separated column names
de: Durch Kommas abgetrennte Spaltennamen schreiben oder einfügen
es: Escriba o pegue nombres con columnas separadas por comas
fr: Saisir ou coller les noms de colonne séparés par une virgule
ja: カンマで区切った列名を入力するか、貼り付けます
ko: 쉼표로 구분된 열 이름 쓰기 또는 붙여넣기
zh_cn: 写入或粘贴由逗号分隔的列名称

source: e.g. id, name, salary
de: z. B. ID, Name, Gehalt
es: p. ej., id, nombre, sueldo
fr: par exemple, id, nom, salaire
ja: 例：id, name, salary
ko: 예: id, 이름, 급여
zh_cn: 例如，ID、名称、薪资

source: Impala icon
de: Impala-Symbol
es: Icono de Impala
fr: Icône Impala
ko: Impala 아이콘

source: DBQuery icon
de: DBQuery-Symbol
es: Icono de DBQuery
fr: Icône DBQuery
ko: DBQuery 아이콘

source: Beeswax icon
de: Beeswax-Symbol
es: Icono de Beeswax
fr: Icône Beeswax
ko: Beeswax 아이콘

source: My Queries
de: Meine Abfragen
es: Mis consultas
fr: Mes requêtes
ja: マイクエリ
ko: 내 쿼리
zh_cn: 我的查询

source: Saved Queries
de: Gespeicherte Abfragen
es: Consultas guardadas
fr: Requêtes enregistrées
ja: 保存したクエリ
ko: 저장된 쿼리
zh_cn: 保存的查询

source: History
de: Verlauf
es: Historial
fr: Historique
ja: 履歴
ko: 기록
zh_cn: 历史记录

source: Metastore icon
de: Metastore-Symbol
es: Icono de Metastore
fr: Icône Metastore
ko: Metastore 아이콘

source: App Configurations
de: Anwendungskonfigurationen
es: Configuraciones de la aplicación
fr: Configurations d'application
ja: アプリケーションの設定
ko: 앱 구성
zh_cn: 应用程序配置

source: Search for %s
de: Nach %s suchen
es: Buscar %s
fr: Rechercher %s
ja: %s を検索
ko: %s 검색
zh_cn: 搜索 %s

source: Edit the selected %s
de: Ausgewählte %s bearbeiten
es: Editar los %s seleccionados
fr: Copier le %s sélectionné
ja: 選択した %s を編集
ko: 선택한 %s 편집
zh_cn: 编辑所选 %s

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
zh_cn: 编辑

source: Copy the selected %s
de: Ausgewählte %s kopieren
es: Copiar los %s seleccionados
fr: Copier le ou les %s sélectionnés
ja: 選択した %s をコピー
ko: 선택한 %s 복사
zh_cn: 复制所选 %s

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
ko: 복사
zh_cn: 复制

source: View the usage history of the selected %s
de: Nutzungsverlauf der ausgewählten %s anzeigen
es: Ver el historial de uso de los %s seleccionados
fr: Afficher l'historique d'utilisation du %s sélectionné
ja: 選択した %s の使用履歴を表示
ko: 선택한 %s의 사용량 기록 보기
zh_cn: 查看所选 %s 的使用历史记录

source: Usage history
de: Nutzungsverlauf
es: Historial de uso
fr: Historique d'utilisation
ja: 使用履歴
ko: 사용량 기록
zh_cn: 使用情况历史记录

source: Move to trash
de: In Papierkorb verschieben
es: Mover a papelera
fr: Déplacer vers la corbeille
ja: ゴミ箱に移動
ko: 휴지통으로 이동
zh_cn: 移至垃圾桶

source: Delete forever
de: Dauerhaft löschen
es: Eliminar permanentemente
fr: Supprimer définitivement
ja: 完全に削除
ko: 영구적으로 삭제
zh_cn: 永久删除

source: Create new %s
de: Neue %s erstellen
es: Crear nuevo %s
fr: Créer un %s
ja: %s を新規作成
ko: 새 %s 생성
zh_cn: 新建 %s

source: New %s
de: Neue %s
es: Nuevo %s
fr: Nouveau %s
ja: 新しい %s
ko: 새 %s
zh_cn: 新 %s

source: Go to the trash
de: Zum Papierkorb
es: Ir a papelera
fr: Accéder à la corbeille
ja: ゴミ箱を開く
ko: 휴지통으로 이동
zh_cn: 转到垃圾桶

source: View trash
de: Papierkorb anzeigen
es: Ver papelera
fr: Afficher la corbeille
ja: ゴミ箱を表示
ko: 휴지통 보기
zh_cn: 查看垃圾桶

source: Owner
de: Eigentümer
es: Propietario
fr: Propriétaire
ja: 所有者
ko: 소유자
zh_cn: 所有者

source: Last Modified
de: Zuletzt geändert
es: Última modificación
fr: Dernière modification
ja: 前回の変更
ko: 최종 수정 날짜
zh_cn: 上次修改

source: Move the selected %s to the trash?
de: Ausgewählte %s in den Papierkorb verschieben?
es: ¿Mover los %s seleccionados a la papelera?
fr: Déplacer le %s sélectionné vers la Corbeille ?
ja: 選択した %s をゴミ箱に移動しますか？
ko: 선택한 %s을(를) 휴지통으로 이동하겠습니까?
zh_cn: 将所选 %s 移至垃圾桶？

source: Delete the selected %s?
de: Ausgewählte %s löschen?
es: ¿Eliminar los %s seleccionados?
fr: Supprimer le %s sélectionné ?
ja: 選択した %s を削除しますか？
ko: 선택한 %s을(를) 삭제하시겠습니까?
zh_cn: 删除所选 %s？

source: Unsaved
de: Ungespeichert
es: Sin guardar
fr: Non enregistré
ja: 未保存
ko: 미저장
zh_cn: 未保存

source: Copy this query.
de: Kopieren Sie diese Abfrage.
es: Copiar esta consulta.
fr: Copier cette requête.
ja: このクエリをコピーします。
ko: 이 쿼리를 복사합니다.
zh_cn: 复制此查询。

source: Auto generated action
de: Automatisch generierte Aktion
es: Acción generada automáticamente
fr: Action générée automatiquement
ja: 自動生成されたアクション
ko: 자동 생성된 작업
zh_cn: 自动生成的操作

source: Actions
de: Aktionen
es: Acciones
ja: アクション
ko: 작업
zh_cn: 操作

source: Show my queries
de: Meine Abfragen anzeigen
es: Mostrar mis consultas
fr: Afficher mes requêtes
ja: 自分のクエリを表示
ko: 내 쿼리 표시
zh_cn: 显示我的查询

source: Show everyone's queries
de: Abfragen von jedem anzeigen
es: Mostrar todas las consultas
fr: Afficher toutes les requêtes
ja: 全員のクエリを表示
ko: 모든 사용자의 쿼리 표시
zh_cn: 显示所有人的查询

source: Show auto queries
de: Automatische Abfragen anzeigen
es: Mostrar consultas automáticas
fr: Afficher les requêtes automatiques
ja: 自動クエリを表示
ko: 자동 쿼리 표시
zh_cn: 显示自动查询

source: Show only saved queries
de: Nur gespeicherte Abfragen anzeigen
es: Mostrar solo las consultas guardadas
fr: Afficher uniquement les requêtes enregistrées
ja: 保存したクエリのみを表示
ko: 저장된 쿼리만 표시
zh_cn: 仅显示保存的查询

source: Search for name, query, etc.
de: Nach Namen, Abfrage usw. suchen
es: Buscar nombre, consulta, etc.
fr: Rechercher un nom, une requête, etc.
ja: 名前、クエリなどを検索
ko: 이름, 쿼리 등을 검색합니다.
zh_cn: 搜索名称、查询等

source: User
de: Benutzer
es: Usuario
fr: Utilisateur
ja: ユーザー
ko: 사용자
zh_cn: 用户

source: State
de: Zustand
es: Estado
fr: Etat
ja: 状態
ko: 상태
zh_cn: 状态

source: Trashed Queries
de: Abfragen im Papierkorb
es: Consultas enviadas a la papelera
fr: Requêtes placées dans la corbeille
ja: ゴミ箱に移動済みのクエリ
ko: 휴지통으로 이동된 쿼리
zh_cn: 已移至垃圾桶的查询

source: Search for query
de: Nach Abfrage suchen
es: Buscar consulta
fr: Rechercher une requête
ja: クエリを検索
ko: 쿼리 검색
zh_cn: 搜索查询

source: Restore from trash
de: Aus Papierkorb wiederherstellen
es: Restaurar contenido de la papelera
fr: Restaurer à partir de la corbeille
ja: ゴミ箱から復元する
ko: 휴지통 복구
zh_cn: 从垃圾桶还原

source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
ja: 復元
ko: 복구
zh_cn: 还原

source: Empty trash
de: Papierkorb leeren
es: Vaciar papelera
fr: Vider la corbeille
ja: ゴミ箱を空にする
ko: 휴지통 비우기
zh_cn: 清空垃圾桶

source: View queries
de: Abfragen anzeigen
es: Ver consultas
fr: Afficher les requêtes
ja: クエリを表示
ko: 쿼리 보기
zh_cn: 查看查询

source: ago
de: vor
es: hace
fr: auparavant
ja: 前
ko: 전
zh_cn: 前

source: Restore the selected queries?
de: Ausgewählte Abfragen wiederherstellen?
es: ¿Restaurar las consultas seleccionadas?
fr: Restaurer les requêtes sélectionnées ?
ja: 選択したクエリを復元しますか？
ko: 선택한 쿼리를 복구하시겠습니까?
zh_cn: 恢复所选查询？

source: Delete the selected queries?
de: Ausgewählte Abfragen löschen?
es: ¿Eliminar las consultas seleccionadas?
fr: Supprimer les requêtes sélectionnées ?
ja: 選択したクエリを削除しますか？
ko: 선택한 쿼리를 삭제하시겠습니까?
zh_cn: 删除所选查询？

source: Empty the trash?
de: Papierkorb leeren?
es: ¿Desea vaciar la papelera?
fr: Vider la Corbeille ?
ja: ゴミ箱を空にしますか？
ko: 휴지통을 비우시겠습니까?
zh_cn: 清空垃圾桶？
