Repository: cloudera/hue
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Internal error: Missing needed parameter to load data into table.
de: Interner Fehler: Fehlender erforderlicher Parameter für das Laden der Daten in Tabelle.
es: Error interno: falta el parámetro necesario para cargar datos en la tabla.
fr: Erreur interne : absence d'un paramètre requis pour charger les données dans une table.
ja: 内部エラー：テーブルにデータをロードするために必要なパラメータがありません。
ko: 내부 오류: 테이블로 데이터를 로드하는 필수 매개변수가 없습니다.
zh_cn: 内部错误：缺少将数据加载到表中所需的参数。

source: %s already exists.
de: %s ist bereits vorhanden.
es: %s ya existe.
fr: %s existe déjà.
ja: %s はすでに存在します。
ko: %s이(가) 이미 존재합니다.
zh_cn: %s 已存在。

source: Invalid %s, missing required attributes: %s.
de: %s ungültig, folgende erforderliche Attribute fehlen: %s.
es: %s no válido, faltan atributos obligatorios: %s.
fr: %s non valable, attributs requis manquants : %s.
ja: 無効な %s です。必要な属性 %s がありません。
ko: 올바르지 않은 %s, 필수 특성 누락: %s.
zh_cn: 无效的 %s，缺少所需属性：%s。

source: Invalid settings, expected list of dict items.
de: Ungültige Einstellungen, Liste von dict-Elementen erwartet.
es: Ajustes no válidos, se esperaba una lista de elementos de diccionario.
fr: Paramètres non valables, liste d'éléments dict attendue.
ja: 無効な設定です。dict アイテムの予想されるリストです。
ko: 올바르지 않은 설정입니다. 사전 항목 목록이 예상됩니다.
zh_cn: 无效的设置，目录项的预期列表。

source: Change the name to save as a new design.
de: Namen ändern, um als neues Design zu speichern.
es: Cambie el nombre que desea guardar como diseño nuevo.
fr: Modifiez le nom sous lequel enregistrer une nouvelle conception.
ja: 名前を変更して新しい設計として保存します。
ko: 새 디자인으로 저장할 이름을 변경합니다.
zh_cn: 更改名称以将其另存为新设计。

source: Description
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_cn: 描述

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_cn: 保存

source: Save As
de: Speichern als
es: Guardar como
fr: Enregistrer sous
ja: 名前を付けて保存
ko: 다른 이름으로 저장
zh_cn: 另存为

source: Enter a name.
de: Geben Sie einen Namen ein.
es: Introduzca un nombre.
fr: Entrez un nom.
ja: 名前を入力してください。
ko: 이름을 입력하십시오.
zh_cn: 请输入一个名称。

source: Directory
de: Verzeichnis
es: Directorio
fr: Répertoire
ja: ディレクトリ
ko: 디렉토리
zh_cn: 目录

source: Path to directory
de: Pfad zu Verzeichnis
es: Ruta a directorio
fr: Chemin d'accès au répertoire
ja: ディレクトリへのパス
ko: 디렉토리 경로
zh_cn: 目录路径

source: Target directory should begin with a /
de: Zielverzeichnis muss mit einem / beginnen
es: El directorio de destino debe empezar con /
fr: Le répertoire cible doit commencer par le caractère /
ja: ターゲットディレクトリは「/」で始まる必要があります
ko: 대상 디렉토리는 / 기호로 시작해야 함
zh_cn: 目标目录应该以 / 开头

source: Directory already exists.
de: Verzeichnis ist bereits vorhanden.
es: El directorio ya existe.
fr: Le répertoire existe déjà.
ja: ディレクトリはすでに存在しています。
ko: 디렉토리가 이미 존재합니다.
zh_cn: 目录已存在。

source: File path
de: Dateipfad
es: Ruta de archivo
fr: Chemin du fichier
ja: ファイルのパス
ko: 파일 경로
zh_cn: 文件路径

source: Path to file
de: Pfad zu Datei
es: Ruta al archivo
fr: Chemin d'accès au fichier
ja: ファイルへのパス
ko: 파일 경로
zh_cn: 文件路径

source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Remplacer
ja: 上書き
ko: 덮어쓰기
zh_cn: 覆盖

source: Overwrite the selected files
de: Ausgewählte Dateien überschreiben
es: Sobreescribir los archivos seleccionados
fr: Remplacer les fichiers sélectionnés
ja: 選択したファイルを上書き
ko: 선택한 파일 덮어쓰기
zh_cn: 覆盖选定的文件

source: Table Name
de: Tabellenname
es: Nombre de tabla
fr: Nom de la table
ja: テーブル名
ko: 테이블 이름
zh_cn: 表名

source: Name of the new table
de: Name der neuen Tabelle
es: Nombre de la nueva tabla
fr: Nom de la nouvelle table
ja: 新しいテーブルの名前
ko: 새 테이블의 이름
zh_cn: 新表的名称

source: Table name is required.
de: Der Tabellenname ist erforderlich.
es: Se necesita un nombre de tabla.
fr: Un nom de table est requis.
ja: テーブル名が必要です。
ko: 테이블 이름을 입력해야 합니다.
zh_cn: 表名为必填字段。

source: Cannot validate form, db object is required.
de: Formular kann nicht überprüft werden; db-Objekt ist erforderlich.
es: No se puede validar el formulario porque se requiere un objeto de la base de datos.
fr: Impossible de valider le formulaire, le db_object est requis.
ja: フォームを検証できません。db オブジェクトが必要です。
ko: 양식을 유효성을 검사할 수 없습니다. db 개체가 필요합니다.
zh_cn: 无法验证表单，需要 db 对象。

source: Invalid table prefix name.
de: Tabellenpräfixname ungültig.
es: Nombre de prefijo de tabla no válido.
fr: Nom du préfixe de la table non valable.
ja: 無効なテーブルプレフィックス名です。
ko: 올바르지 않은 테이블 접두사 이름입니다.
zh_cn: 无效的表前缀名。

source: Table %s.%s already exists
de: Tabelle %s.%s ist bereits vorhanden
es: La tabla %s.%s ya existe
fr: La table %s.%s existe déjà
ja: テーブル %s.%s がすでに存在しています
ko: 테이블 %s.%s이(가) 이미 존재함
zh_cn: 表 %s.%s 已存在

source: Query Editor
de: Abfrage-Editor
es: Editor de consultas
fr: Editeur de requêtes
ko: 쿼리 편집기
zh_cn: 查询编辑器

source: archive
de: Archivieren
es: almacenamiento
ko: 아카이브
zh_cn: 存档

source: Resources to upload with your Hive job. Use 'jar' for UDFs. Use 'file' and 'archive' for files to be copied and made locally available during MAP/TRANSFORM. Paths are on HDFS.
de: Mit Ihrem Hive-Job hochzuladende Ressourcen. Verwenden Sie 'jar' für UDFs. Verwenden Sie 'file' und 'archive' für zu kopierende und lokal während MAP/TRANSFORM verfügbar gemachte Dateien. Pfade sind auf HDFS.
es: Recursos que cargar con el trabajo de hive. Utilice 'jar' para UDF. Utilice "archivo" y "almacenamiento" para archivos que se van a copiar y estarán disponibles localmente durante MAP/TRANSFORM. Las rutas están en HDFS.
fr: Ressources à charger avec votre job Hive. Utilisez 'jar' pour les UDF. Utilisez 'fichier' et 'archive' pour les fichiers à copier et à rendre disponibles en local lors de MAP/TRANSFORM. Les chemins sont sur HDFS.
ja: Hive ジョブでアップロードするリソースです。UDF には 'jar' を使用します。コピーして MAP/TRANSFORM の際にローカルで使用可能にするファイルには 'file' と 'archive' を使用します。パスは HDFS 上のパスです。
ko: Hive Job과 함께 업로드할 리소스입니다. UDF에 'jar'를 사용합니다. 파일을 복사하여 MAP/TRANSFORM 동안 로컬에서 사용할 수 있도록 '파일' 및 '아카이브'를 사용합니다. 경로는 HDFS에 있습니다.
zh_cn: 要通过您的 Hive 作业上载的资源。对 UDF 使用 'jar'。对要在 MAP/TRANSFORM 期间复制且在本地提供的文件使用 'file' 和 'archive'。路径位于 HDFS 上。

source: Path to file on HDFS.
de: Pfad zu Datei auf HDFS.
es: Ruta al archivo en HDFS.
fr: Chemin d'accès vers un fichier sur HDFS.
ja: HDFS 上のファイルのパスです。
ko: HDFS의 파일에 대한 경로입니다.
zh_cn: HDFS 上的文件路径。

source: Field terminator
de: Feldabschlusszeichen
es: Terminador de campo
fr: Marque de fin de champ
ja: フィールドの終端文字
ko: 필드 터미네이터
zh_cn: 字段终止符

source: Collection terminator
de: Sammlungsabschlusszeichen
es: Terminador de recopilación
fr: Marque de fin de collecte
ja: コレクションの終端文字
ko: 컬렉션 터미네이터
zh_cn: 集合终结符

source: Map key terminator
de: Map-Schlüsselabschlusszeichen
es: Terminador de clave de map
fr: Marque de fin de clé de map
ja: map キーの終端文字
ko: Map 키 터미네이터
zh_cn: Map 键终止符

source: SerDe Name
es: Nombre de SerDe
fr: Nom SerDe
ja: SerDe の名前
ko: SerDe 이름
zh_cn: SerDe 名称

source: Comma-separated list of key-value pairs. E.g. 'p1=v1, p2=v2'
de: Komma-getrennte Liste von Schlüssel-Wert-Paaren, z. B. "p1=v1, p2=v2"
es: Lista de pares de clave-valor separados por comas, ej., 'p1=v1, p2=v2'
fr: Liste de paires de valeurs clés, séparées par des virgules, par exemple : 'p1=v1, p2=v2'
ja: キーと値のペアのカンマ区切りリストです（'p1=v1, p2=v2' など）。
ko: 쉼표로 구분한 키-값 쌍(예: 'p1=v1, p2=v2') 목록입니다.
zh_cn: 逗号分隔的键值对列表，如 'p1=v1, p2=v2'

source: InputFormat Class
de: InputFormat-Klasse
es: Clase InputFormat
fr: Classe InputFormat
ja: InputFormat クラス
ko: InputFormat 클래스
zh_cn: InputFormat 类

source: OutputFormat Class
de: OutputFormat-Klasse
es: Clase OutputFormat
fr: Classe OutputFormat
ja: OutputFormat クラス
ko: OutputFormat 클래스
zh_cn: OutputFormat 类

source: Use default location.
de: Standard-Speicherort verwenden.
es: Utilizar ubicación predeterminada.
fr: Utilisez l'emplacement par défaut.
ja: デフォルトの場所を使用します。
ko: 기본 위치를 사용합니다.
zh_cn: 使用默认位置。

source: Path to HDFS directory or file of table data.
de: Pfad zu HDFS-Verzeichnis oder Datei von Tabellendaten.
es: Ruta al directorio de HDFS o al archivo de datos de tabla.
fr: Chemin d'accès vers le répertoire HDFS ou fichier des données de table.
ja: HDFS ディレクトリまたはテーブルデータのファイルへのパスです。
ko: 테이블 데이터의 HDFS 디렉토리 또는 파일의 경로입니다.
zh_cn: HDFS 目录或表数据文件的路径。

source: Use header row for column names?
de: Erste Zeile als Spaltennamen verwenden?
es: ¿Utilizar la primera fila como nombres de columnas?
fr: Utiliser la ligne d'en-tête pour les noms de colonne ?
ko: 첫째 행을 열 이름으로 사용하시겠습니까?

source: Spaces are not allowed in table names.
de: Leerzeichen sind in Tabellenamen nicht zulässig.
es: No se permiten espacios en los nombres de tablas.
fr: Les espaces sont interdites dans les noms de tables.
ja: テーブル名には、スペースを使用できません。
ko: 테이블 이름에 공백은 허용되지 않습니다.
zh_cn: 表名中不允许有空格。

source: Table "%(name)s" already exists.
de: Tabelle "%(name)s" besteht bereits.
es: La tabla "%(name)s" ya existe.
fr: La table "%(name)s" existe déjà.
ja: テーブル " %(name)s" はすでに存在します。
ko: "%(name)s" 테이블이 이미 존재합니다.
zh_cn: 表“%(name)s”已存在。

source: Terminator must not be empty.
de: Abschlusszeichen darf nicht leer sein.
es: El terminador no debe estar vacío.
fr: La marque de fin ne doit pas être vide.
ja: 終端文字は空にできません。
ko: 터미네이터는 비어 있을 수 없습니다.
zh_cn: 终止符不能为空。

source: Input File or Directory
de: Datei oder Verzeichnis auswählen
es: Seleccionar un archivo o directorio
fr: Entrer un fichier ou un répertoire
ko: 파일 또는 디렉토리 입력

source: Import data
de: Daten importieren
es: Importar datos
fr: Importer des données
ko: 데이터 가져오기

source: Create External Table
de: Externe Tabelle erstellen
es: Crear tabla externa
fr: Créer une table externe
ko: 외부 테이블 생성

source: Select 'import' to load data from the file into the Hive warehouse directory after creation. Select 'external' if the table is an external table and the data files should not be moved. Select 'empty' if the file should only be used to define the table schema but not loaded (table will be empty).
de: 'Importieren' auswählen, wenn Daten nach dem Erstellen in das VerzeichnisHive-Warehouse geladen werden sollen. 'Extern' auswählen, wenn es sich um eine externeTabelle handelt und die Dateien nicht verschoben werden dürfen. 'Leer' auswählen, wenn die Dateinur zur Definition des Tabellenschemas verwendet und nicht geladen werden soll (Tabelle ist dann leer).
es: Seleccione 'importar' para cargar datos desde el archivo del directorio de almacén de Hive tras haberlo creado. Seleccione 'externo' si la tabla es una tabla externa y los archivos de datos no se deben mover. Seleccione 'vacío' si el archivo se debe utilizar únicamente para definir el esquema de tabla pero no cargarse (la tabla permanecerá vacía).
fr: Sélectionnez « importer » pour charger les données du fichier dans le répertoire de l'entrepôt Hive après la création. Sélectionnez « externe » si la table est une table externe et que les données ne doivent pas être déplacées. Sélectionnez « vide » si le fichier ne doit être utilisé que pour définir le schéma de table, mais pas chargé (la table sera vide).
ko: 생성 후 파일에서 Hive 웨어하우스 디렉토리로 데이터를 로드하려면 ‘가져오기’를 선택하십시오. 테이블이 외부 테이블이고 데이터 파일을 이동하지 말아야 하는 경우 '외부'를 선택하십시오. 파일을 테이블 스키마를 정의하는 데만 사용하고 로드하지 말아야 하는 경우 '비우기'를 선택하십시오 (테이블이 비워집니다).

source: Delimiter
de: Trennzeichen
es: Delimitador
fr: Délimiteur
ja: 区切り文字
ko: 구분 기호
zh_cn: 分隔符

source: Delimiter value must be smaller than 65533.
de: Trennzeichenwert muss kleiner sein als 65533.
es: El valor de delimitador debe ser menor que 65 533.
fr: La valeur du délimiteur doit être inférieure à 65 533.
ja: 区切り文字の値は 65533 未満とする必要があります。
ko: 구분 기호 값은 65533보다 작아야 합니다.
zh_cn: 分隔符值必须小于 65533。

source: Delimiter value is required.
de: Trennzeichenwert ist erforderlich.
es: El valor de delimitador es necesario.
fr: Une valeur de délimiteur doit être indiquée.
ja: 区切り文字の値が必要です。
ko: 구분 기호 값을 입력해야 합니다.
zh_cn: 需要分隔符值。

source: Specify if column_type is char
de: Geben Sie an, ob "column_type" "char" ist.
es: Especifique si column_type es char
fr: Indiquez si column_type est un char
ja: column_type は char であると指定します
ko: column_type이 char인지 여부를 지정합니다.
zh_cn: 指定 column_type 是否为 char

source: Specify if column_is varchar
de: Geben Sie an, ob "column_type" "varchar" ist.
es: Especifique si column_ es varchar
fr: Indiquez si column est un varchar
ja: column は varchar であると指定します
ko: column_type이 varchar인지 여부를 지정합니다.
zh_cn: 指定 column_ 是否为 varchar

source: Column Name
de: Spaltenname
es: Nombre de columna
fr: Nom de la colonne
ja: 列名
ko: 열 이름
zh_cn: 列名称

source: Column Type
de: Spaltentyp
es: Tipo de columna
fr: Type de la colonne
ja: 列の種類
ko: 열 유형
zh_cn: 列类型

source: Array Value Type
de: Array-Werttyp
es: Tipo de valor de matriz
fr: Type de valeur de tableau
ja: 配列の値の種類
ko: 어레이 값 유형
zh_cn: 数组值类型

source: Specify if column_type is map.
de: Geben Sie an, ob "column_type" "map" ist.
es: Especifique si column_type es map.
fr: Précisez si column_type est un map.
ja: column_type は Map であると指定します
ko: column_type이 Map인지 여부를 지정합니다.
zh_cn: 指定 column_type 是否为 map。

source: Add a column
de: Eine Spalte hinzufügen
es: Agregar una columna
fr: Ajouter un colonne
ja: 列を追加
ko: 열 추가
zh_cn: 添加一列

source: Add a partition
de: Eine Partition hinzufügen
es: Agregar una partición
fr: Ajouter une partition
ja: パーティションを追加
ko: 파티션 추가
zh_cn: 添加一个分区

source: Database "%(name)s" already exists.
de: Datenbank "%(name)s" besteht bereits.
es: La base de datos "%(name)s" ya existe.
fr: La base de données "%(name)s" existe déjà.
ja: データベース "%(name)s" はすでに存在します。
ko: "%(name)s" 데이터베이스가 이미 존재합니다.
zh_cn: 数据库“%(name)s”已存在。

source: Database Name
de: Datenbankname
es: Nombre de base de datos
fr: Nom de la base de données
ja: データベース名
ko: 데이터베이스 이름
zh_cn: 数据库名称

source: Use default location
de: Standard-Speicherort verwenden
es: Utilizar ubicación predeterminada
fr: Utiliser l'emplacement par défaut
ja: デフォルトの場所を使用
ko: 기본 위치 사용
zh_cn: 使用默认位置

source: Path to HDFS directory or file of database data.
de: Pfad zu HDFS-Verzeichnis oder Datei von Datenbankdaten.
es: Ruta al directorio de HDFS o al archivo de datos de base de datos.
fr: Chemin d'accès vers le répertoire HDFS ou fichier des données de base de données.
ja: HDFS ディレクトリまたはデータベースデータのファイルへのパスです。
ko: 데이터베이스 데이터의 HDFS 디렉토리 또는 파일의 경로입니다.
zh_cn: HDFS 目录或数据库数据文件的路径。

source: Host of the query server.
de: Host des Abfrageservers.
es: Host del servidor de consultas.
fr: Hôte du serveur de requêtes.
ja: クエリサーバーのホストです。
ko: 쿼리 서버의 호스트입니다.
zh_cn: 查询服务器主机。

source: Port of the query server.
de: Port des Abfrageservers.
es: Puerto del servidor de consultas.
fr: Port du serveur de requêtes.
ja: クエリサーバーのポートです。
ko: 쿼리 서버의 포트입니다.
zh_cn: 查询服务器端口。

source: Name of the query server.
de: Name des Abfrageservers.
es: Nombre del servidor de consultas.
fr: Nom du serveur de requêtes.
ja: クエリサーバーの名前です。
ko: 쿼리 서버의 이름입니다.
zh_cn: 查询服务器名称。

source: Type of the query server.
de: Typ des Abfrageservers.
es: Tipo de servidor de consultas.
fr: Type du serveur de requêtes.
ja: クエリサーバーのタイプです。
ko: 쿼리 서버의 유형입니다.
zh_cn: 查询服务器类型。

source: Type of the query.
de: Typ der Abfrage.
es: Tipo de la consulta.
fr: Type de la requête.
ja: クエリのタイプです。
ko: 쿼리 유형입니다.
zh_cn: 查询类型。

source: My saved query
de: Meine gespeicherte Abfrage
es: Mi consulta guardada
fr: Ma requête enregistrée
ja: マイ保存済みクエリ
ko: 내 저장된 쿼리
zh_cn: 我保存的查询

source: (new)
de: (neu)
es: (nuevo)
fr: (nouvelle)
ja: （新規）
ko: (신규)
zh_cn: （新）

source: Is trashed
de: In den Papierkorb verschoben
es: Se ha enviado a la papelera
fr: Placé dans la corbeille
ja: ゴミ箱に移動済み
ko: 휴지통으로 이동됨
zh_cn: 已移至垃圾桶

source: If this query is trashed.
de: Wenn diese Abfrage gelöscht wurde.
es: Si esta consulta se ha enviado a la papelera.
fr: Si cette requête est placée dans la corbeille.
ja: このクエリがゴミ箱に移動された場合。
ko: 쿼리가 휴지통으로 이동된 경우.
zh_cn: 如果此查询已移至垃圾桶。

source: Cannot retrieve query id %(id)s.
de: Abfrage-ID %(id)s kann nicht abgerufen werden.
es: No se pueden recuperar los ID de consulta %(id)s.
fr: Impossible de récupérer l'ID de requête %(id)s.
ja: クエリ id %(id)s を取得できません。
ko: 쿼리 ID %(id)s을(를) 검색할 수 없습니다.
zh_cn: 无法检索查询 ID %(id)s。

source: Query id %(id)s does not belong to user %(user)s.
de: Abfrage-ID %(id)s gehört nicht zu Benutzer %(user)s.
es: El ID de consulta %(id)s no pertenece al usuario %(user)s
fr: L'ID de requête %(id)s n'appartient pas à l'utilisateur %(user)s.
ja: クエリ ID %(id)s はユーザー %(user)s に属していません。
ko: 쿼리 ID %(id)s은(는) 사용자 %(user)s에 속하지 않습니다.
zh_cn: 查询 ID %(id)s 不属于用户 %(user)s。

source: Type mismatch for design id %(id)s (owner %(owner)s) - Expected %(expected_type)s, got %(real_type)s.
de: Unpassender Typ für Design-ID %(id)s (Eigentümer %(owner)s): erwartet "%(expected_type)s", erhalten "%(real_type)s".
es: El tipo no coincide para el ID de diseño %(id)s (propietario %(owner)s): se esperaba %(expected_type)s, se ha obtenido %(real_type)s.
fr: Type incorrect pour l'ID de conception %(id)s (propriétaire %(owner)s) - type attendu : %(expected_type)s, type obtenu : %(real_type)s.
ja: 設計 ID %(id)s（所有者 %(owner)s）のタイプが一致しません - %(expected_type)s を想定しましたが取得したのは %(real_type)s です。
ko: 디자인 ID %(id)s(소유자 %(owner)s)의 유형이 일치하지 않습니다. %(expected_type)s 대신 %(real_type)s이(가) 반환되었습니다.
zh_cn: 设计 ID %(id)s（所有者为 %(owner)s）的类型不匹配 - 需要 %(expected_type)s，但得到 %(real_type)s。

source: Last used
de: Zuletzt verwendet
es: Último uso
fr: Dernière utilisation
ja: 最後に使用された
ko: 최종 사용 날짜
zh_cn: 上次使用时间

source: Application we communicate with.
de: Anwendung, mit der wir kommunizieren.
es: La aplicación con la que nos comunicamos.
fr: Application avec laquelle nous communiquons.
ja: 通信先のアプリケーションです。
ko: 통신할 애플리케이션입니다.
zh_cn: 我们与其通信的应用程序。

source: Invalid design type %(type)s
de: Ungültiger Designtyp %(type)s
es: Tipo de diseño no válido %(type)s
fr: Type de conception %(type)s incorrect
ja: 無効な設計タイプ %(type)s
ko: 올바르지 않은 디자인 유형 %(type)s
zh_cn: 无效设计类型 %(type)s

source: Delete design(s)?
de: Design(s) löschen?
es: ¿Eliminar diseños?
fr: Supprimer la ou les conception(s) ?
ja: 設計を削除しますか?
ko: 디자인을 삭제하시겠습니까?
zh_cn: 删除设计？

source: Restore design(s)?
de: Design(s) wiederherstellen?
es: ¿Desea restaurar el diseño?
fr: Restaurer les conceptions ?
ja: 設計を復元しますか？
ko: 디자인을 복구하시겠습니까?
zh_cn: 恢复设计？

source: Copied design: %(name)s
de: Kopiertes Design: %(name)s
es: Diseño copiado: %(name)s
fr: Conception copiée : %(name)s
ja: コピーした設計：%(name)s
ko: 복사된 디자인: %(name)s
zh_cn: 复制的设计：%(name)s

source: Beeswax query completed.
de: Beeswax-Abfrage abgeschlossen.
es: Consulta de Beeswax completada.
fr: Requête Beeswax terminée.
ja: Beeswax のクエリが完了しました。
ko: Beeswax 쿼리가 완료되었습니다.
zh_cn: Beeswax 查询已完成。

source: %(subject)s. See the results here: %(link)s Query: %(query)s
de: %(subject)s. Sie können die Ergebnisse hier sehen: %(link)s Abfrage: %(query)s
es: %(subject)s. Consulte los resultados aquí: %(link)s Consulta: %(query)s
fr: %(subject)s. Afficher les résultats ici : %(link)s Requête : %(query)s
ja: %(subject)s。結果は %(link)s で確認します クエリ： %(query)s
ko: %(subject)s. 결과 보기: %(link)s 쿼리: %(query)s
zh_cn: %(subject)s。您会在此看到结果：%(link)s 查询： %(query)s

source: Design %(id)s does not exist.
de: Design %(id)s existiert nicht.
es: El diseño %(id)s no existe.
fr: La conception %(id)s n'existe pas.
ja: 設計 %(id)s は存在しません。
ko: 디자인 %(id)s이(가) 존재하지 않습니다.
zh_cn: 设计 %(id)s 不存在。

source: QueryHistory %(id)s does not exist.
de: QueryHistory %(id)s existiert nicht.
es: El historial de consultas %(id)s no existe.
fr: L'historique de requêtes %(id)s n'existe pas.
ja: クエリ履歴 %(id)s は存在しません。
ko: QueryHistory %(id)s이(가) 존재하지 않습니다.
zh_cn: 查询历史 %(id)s 不存在。

source: Permission denied to read QueryHistory %(id)s
de: Berechtigung zum Lesen von Query-Verlauf %(id)s verweigert
es: Permiso denegado para leer el historial de consultas %(id)s
fr: Autorisation refusée pour lire l'historique de requêtes %(id)s
ja: クエリ履歴 %(id)s を読み取る権限が許可されていません
ko: QueryHistory %(id)s을(를) 읽는 데 필요한 권한이 거부됨
zh_cn: 读取查询历史 %(id)s 的权限被拒绝

source: Failed to retrieve query state from the Query Server.
de: Der Abfragestatus konnte nicht vom Abfrageserver abgerufen werden.
es: Error al recuperar el estado de la consulta del servidor de consultas.
fr: Impossible de récupérer l'état de la requête depuis le serveur de requêtes.
ja: クエリサーバーからクエリの状態を取得できませんでした。
ko: 쿼리 서버에서 쿼리 상태를 검색하지 못했습니다.
zh_cn: 无法从查询服务器检索查询状态。

source: Failed to contact Server to check query status.
de: Server konnte nicht kontaktiert werden, um Abfragestatus zu prüfen.
es: Error al contactar con el servidor para comprobar el estado de la consulta.
fr: Impossible de contacter le serveur pour vérifier l'état de la requête.
ja: クエリステータス確認のためのサーバーアクセスに失敗しました。
ko: 쿼리 상태를 확인하기 위해 서버에 연결하지 못했습니다.
zh_cn: 无法连接服务器以检查查询状态。

source: Cannot parse job IDs for execution engine %(engine)s
de: Job-IDs konnten nicht auf die Ausführungs-Engine %(engine)s hin analysiert werden.
es: No se pueden analizar los ID de job del motor de ejecución %(engine)s
fr: Impossible de parcourir les ID de job pour le moteur d'exécution %(engine)s
ja: 実行エンジン %(engine)s のジョブ ID を解析できません
ko: 실행 엔진 %(engine)s에 대한 Job ID를 분석할 수 없음
zh_cn: 无法解析执行引擎 %(engine)s 的作业 ID

source: list_query_history requires design_id parameter to be an integer: %s
de: list_query_history erfordert eine Ganzzahl für den Parameter design_id: %s
es: list_query_history requiere el parámetro design_id para ser un número entero: %s
fr: list_query_history requiert que le paramètre design_id soit un entier : %s
ja: list_query_history では design_id パラメーターを整数 %s にする必要があります
ko: list_query_history에서 design_id 매개변수가 정수여야 함: %s
zh_cn: list_query_history 需要 design_id 参数为整数：%s

source: SQL table examples already installed.
de: SQL-Tabellenbeispiele sind bereits installiert.
es: Ejemplos de tabla SQL ya instalados.
fr: Exemples de tables SQL déjà installées.
ja: SQL テーブルのサンプルはインストール済みです。
ko: SQL 테이블 예제가 이미 설치되었습니다.
zh_cn: 已安装 SQL 表示例。

source: Permission denied. Please check with your system administrator.
de: Berechtigung verweigert. Wenden Sie sich an Ihren Systemadministrator.
es: Permiso denegado. Consulte al administrador del sistema.
fr: Autorisation refusée. Consultez votre administrateur système.
ja: パーミッションが拒否されました。システム管理者に問い合わせてください。
ko: 권한이 거부되었습니다. 시스템 관리자에게 문의하십시오.
zh_cn: 权限被拒绝。请与您的系统管理员进行确认。

source: Could not install table: %s
de: Tabelle konnte nicht installiert werden: %s
es: No se pudo instalar la tabla: %s
fr: Impossible d'installer la table : %s
ja: 次のテーブルをインストールできませんでした：%s
ko: 테이블을 설치할 수 없음: %s
zh_cn: 无法安装表：%s

source: Could not install query: %s
de: Abfrage konnte nicht installiert werden: %s
es: No se pudo instalar la consulta: %s
fr: Impossible d'installer la requête : %s
ja: クエリ %s をインストールできませんでした
ko: 쿼리를 설치할 수 없음: %s
zh_cn: 无法安装查询：%s

source: Table "%(table)s" already exists.
de: Tabelle "%(table)s" ist bereits vorhanden.
es: La tabla "%(table)s" ya existe.
fr: La table "%(table)s" existe déjà.
ja: テーブル "%(table)s" はすでに存在します
ko: "%(table)s" 테이블이 이미 존재합니다.
zh_cn: 表“%(table)s”已存在。

source: Error creating table %(table)s: Operation timeout.
de: Fehler beim Erstellen der Tabelle %(table)s: Operation-Timeout.
es: Error al crear la tabla %(table)s: tiempo de espera de la operación.
fr: Erreur lors de la création de la table %(table)s : l'opération a expiré.
ja: テーブル %(table)s の作成でエラーが発生しました。操作はタイムアウトします。
ko: 테이블 %(table)s 생성 중 오류 발생: 작업이 시간 초과되었습니다.
zh_cn: 创建表 %(table)s 时出错：操作超时。

source: Error creating table %(table)s: %(error)s.
de: Fehler beim Erstellen der Tabelle %(table)s: %(error)s.
es: Error al crear la tabla %(table)s: %(error)s.
fr: Erreur lors de la création de la table %(table)s : %(error)s.
ja: テーブル %(table)s の作成中にエラーが発生しました：%(error)s。
ko: 테이블 %(table)s 생성 중 오류 발생: %(error)s.
zh_cn: 创建表 %(table)s 时出错：%(error)s。

source: Cannot find table data in "%(file)s".
de: Tabellendaten können in "%(file)s" nicht gefunden werden.
es: No se han encontrado datos de tabla en "%(file)s".
fr: Impossible de trouver des données de table dans "%(file)s".
ja: "%(file)s" にテーブルデータが見つかりません。
ko: "%(file)s"에서 테이블 데이터를 찾을 수 없습니다.
zh_cn: "在 ""%(file)s"" 中找不到表数据。"
