Repository: cloudera/hue
Catalog: desktop/core/ext-py/Django-1.6.10/django/contrib/humanize/locale/*/LC_MESSAGES/django.po
Languages: eo, he

source: today
eo: hodiaŭ
he: היום

source: yesterday
eo: hieraŭ
he: אתמול

source: tomorrow
eo: morgaŭ
he: מחר

source: th
eo: a
he: רביעי

source: st
eo: a
he: ראשון

source: nd
eo: a
he: שני

source: rd
eo: a
he: שלישי

source: %(value).1f million
eo: %(value).1f milionoj
he: %(value).1f מיליון

source: %(value)s million
eo: %(value)s milionoj
he: %(value)s מיליון

source: %(value).1f billion
eo: %(value).1f miliardoj
he: %(value).1f מיליארד

source: %(value)s billion
eo: %(value)s miliardoj
he: %(value)s מיליארד

source: %(value).1f trillion
eo: %(value).1f triiliono
he: %(value).1f טריליון

source: %(value)s trillion
eo: %(value)s triilionoj
he: %(value)s טריליון

source: %(value).1f quadrillion
eo: %(value).1f kvariliono
he: %(value).1f קוודריליון

source: %(value)s quadrillion
eo: %(value)s kvarilionoj
he: %(value)s קוודריליון

source: %(value).1f quintillion
eo: %(value).1f kvinilionoj
he: %(value).1f קווינטיליון

source: %(value)s quintillion
eo: %(value)s kvinilionoj
he: %(value)s קווינטיליון

source: %(value).1f sextillion
eo: %(value).1f sesilionoj
he: %(value).1f סקסטיליון

source: %(value)s sextillion
eo: %(value)s sesilionoj
he: %(value)s סקסטיליון

source: %(value).1f septillion
eo: %(value).1f sepilionoj
he: %(value).1f ספטיליון

source: %(value)s septillion
eo: %(value)s sepilionoj
he: %(value)s ספטיליון

source: %(value).1f octillion
eo: %(value).1f okilionoj
he: %(value).1f אוקטיליון

source: %(value)s octillion
eo: %(value)s okilionoj
he: %(value)s אוקטיליון

source: %(value).1f nonillion
eo: %(value).1f naŭilionoj
he: %(value).1f נוניליון

source: %(value)s nonillion
eo: %(value)s naŭilionoj
he: %(value)s נוניליון

source: %(value).1f decillion
eo: %(value).1f dekilionoj
he: %(value).1f דציליון

source: %(value)s decillion
eo: %(value)s dekilionoj
he: %(value)s דציליון

source: %(value).1f googol
eo: %(value).1f guglo
he: %(value).1f גוגול

source: %(value)s googol
eo: %(value)s gugloj
he: %(value)s גוגול

source: one
eo: unu
he: אחד

source: two
eo: du
he: שניים

source: three
eo: tri
he: שלושה

source: four
eo: kvar
he: ארבעה

source: five
eo: kvin
he: חמישה

source: six
eo: ses
he: שישה

source: seven
eo: sep
he: שבעה

source: eight
eo: ok
he: שמונה

source: nine
eo: naŭ
he: תשעה

# naturaltime
source: %(delta)s ago
eo: %(delta)s antaŭe
he: לפני %(delta)s

source: now
eo: nun
he: עכשיו

source: a second ago
eo: unu sekundo antaŭe
he: לפני שנייה

source: a minute ago
eo: unu minuto antaŭe
he: לפני דקה

source: an hour ago
eo: unu horo antaŭe
he: לפני שעה

# naturaltime
source: %(delta)s from now
eo: %(delta)s ekde nun
he: בעוד %(delta)s

source: a second from now
eo: unu sekundo ekde nun
he: בעוד שנייה

source: a minute from now
eo: unu minuto ekde nun
he: בעוד דקה

source: an hour from now
eo: unu horo ekde nun
he: בעוד שעה
