Repository: cloudera/hue
Catalog: desktop/libs/libsaml/src/libsaml/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, pt_br, zh_cn

source: Xmlsec1 binary path. This program should be executable by the user running Hue.
de: Xmlsec1-Binärpfad. Dieses Programm sollte von dem Benutzer verwendet werden können, der Hue ausführt.
es: Ruta binaria Xmlsec1. Este programa debe ejecutarlo el usuario que ejecute Hue.
fr: Chemin d'accès binaire Xmlsec1. Ce programme doit être exécutable par l'utilisateur exécutant Hue.
ja: Xmlsec1 バイナリパスです。このプログラムは、Hue を実行しているユーザーによって実行可能であることが必要です。
ko: Xmlsec1 바이너리 경로입니다. 이 프로그램은 Hue를 실행 중인 사용자가 실행할 수 있어야 합니다.
pt_br: Caminho binário Xmlsec1. Este programa deve ser executável pelo usuário que está executando Hue.
zh_cn: Xmlsec1 二进制路径。此程序应由运行 Hue 的用户执行。

source: Optional base url the SAML IdP should use for responses.
de: Optionale Basis-URL, die SAML IdP für Antworten verwenden soll.
es: La URL de base opciones que el IDP de SAML deberá utilizar para las respuestas.
fr: URL de base facultative que l'IdP SAML doit utiliser pour les réponses.
ja: SAML IdP が応答に使用するオプションのベース url です。
ko: SAML IdP에서 응답을 위해 사용해야 하는 선택적 기본 URL입니다.
zh_cn: SAML IdP 应使用进行响应的可选基本 URL。

source: Entity ID for Hue acting as service provider. Can also accept a pattern where '<base_url>' will be replaced with server URL base.
de: Entitäts-ID für Hue fungiert als Dienstanbieter. Es kann auch ein Muster akzeptiert werden, dessen "<base_url>" durch die Server-URL-Datenbank ersetzt wird.
es: ID de la entidad de Hue que actúa como proveedor de servicios. También puede aceptar un patrón en el que '<base_url>' se sustituirá con la base de la URL del servidor.
fr: ID d'entité pour Hue se comportant comme un fournisseur de services. Peut également accepter un modèle où '<base_url>' sera remplacé par la base de l'URL du serveur.
ja: サービスプロバイダとして動作している Hue のエンティティ ID です。'<base_url>' をサーバーの URL ベースに置き換えるパターンも受け入れられます。
ko: 서비스 공급자 역할을 하는 Hue의 엔터티 ID입니다. '<base_url>'이 서버 URL 기준으로 바뀌는 패턴을 적용할 수도 있습니다.
pt_br: ID da entidade para Hue agindo como provedor de serviços. Também pode aceitar o padrão onde '<base_url>' será substituído pela base da URL do servidor.
zh_cn: 用作服务提供商的 Hue 的实体 ID。也可接受 '<base_url>' 将被替换为服务器 URL 基的模式。

source: Create users from IdP on login.
de: Benutzer bei der Anmeldung aus IdP erstellen.
es: Crear usuarios de IdP al inicio de sesión.
fr: Créez des utilisateurs à partir de l'IdP lors de la connexion.
ja: ログイン時に IdP からユーザーを作成します。
ko: 로그인 시 IdP에서 사용자를 생성합니다.
pt_br: Crie usuários de IdP ao fazer login.
zh_cn: 登录时从 IdP 创建用户。

source: Attribute map directory contains files that map SAML attributes to pysaml2 attributes.
de: Attributzuordnungsverzeichnis enthält Dateien, durch die SAML-Attribute den pysaml2-Attributen zugeordnet werden.
es: El directorio de asignación de atributos contiene archivos que asignan atributos SAML a atributos pysaml2.
fr: Le répertoire de map d'attributs contient des fichiers qui mappent les attributs SAML aux attributs pysaml2.
ja: 属性マップディレクトリに、SAML 属性を pysaml2 属性にマップするファイルが含まれています。
ko: 특성 맵 디렉토리에 SAML 특성을 pysaml2 특성에 매핑하는 파일이 있습니다.
pt_br: O diretório do mapa de atributos contém arquivos que mapeiam atributos SAML para atributos pysaml2.
zh_cn: 属性映射目录包含将 SAML 属性映射到 pysaml2 属性的文件。

source: Allow responses that are initiated by the IdP.
de: Antworten zulassen, die durch IdP initiiert werden.
es: Permitir respuestas iniciadas por el IdP.
fr: Autorise les réponses initiées par l'IdP.
ja: IdP によって開始される応答を許可します。
ko: IdP에 의해 시작된 응답을 허용합니다.
pt_br: Permitir respostas que sejam iniciadas pelo IdP.
zh_cn: 允许由 IdP 发起的响应。

source: Required attributes to ask for from IdP.
de: Erforderliche Attribute, die bei IdP abgefragt werden.
es: Atributos necesarios que solicitar de IdP.
fr: Attributs requis à demander depuis l'IdP.
ja: IdP に要求する必須の属性です。
ko: IdP에서 요청할 필수 특성입니다.
pt_br: Atributos obrigatórios a serem solicitados do IdP.
zh_cn: IdP 要求的必需属性。

source: Optional attributes to ask for from IdP.
de: Optionale Attribute, die von IdP abgerufen werden sollen.
es: Atributos opcionales que solicitar de IdP.
fr: Attributs facultatifs à demander depuis l'IdP.
ja: IdP に要求するオプションの属性です。
ko: IdP에서 요청할 선택적 특성입니다.
pt_br: Atributo opcionais a serem solicitados do IdP.
zh_cn: 从 IdP 请求的可选属性。

source: IdP metadata in the form of a file. This is generally an XML file containing metadata that the Identity Provider generates.
de: IdP-Metadaten in Form einer Datei. Dies ist normalerweise eine XML-Datei, die Metadaten enthält, die vom Identity Provider generiert werden.
es: Metadatos de IdP en forma de archivo. Normalmente se trata de un archivo XML que contiene los metadatos generados por Identity Provider.
fr: Métadonnées de l'IdP sous forme de fichier. Il s'agit généralement d'un fichier XML contenant des métadonnées que le fournisseur d'identité génère.
ja: ファイル形式の IdP メタデータです。これは通常、Identity Provider が生成するメタデータを含む XML ファイルです。
ko: 파일 형식의 IdP 메타데이터입니다. 일반적으로 ID 공급자가 생성하는 메타데이터가 들어 있는 XML 파일입니다.
pt_br: Metadados de IdP no formato de um arquivo. Geralmente é um arquivo XML contendo metadados que o Provedor de identidades gera.
zh_cn: 文件格式的 IdP 元数据。这通常是包含 Identity Provider 所生成的元数据的 XML 文件。

source: key_file is the name of a PEM formatted file that contains the private key of the Hue service. This is presently used both to encrypt/sign assertions and as client key in a HTTPS session.
de: "key_file" ist der Name einer PEM-formatierten Datei, die den privaten Schlüssel des Hue-Dienstes enthält. Dieser wird derzeit zum Verschlüsseln/Signieren von Bestätigungen und als Client-Schlüssel in einer HTTPS-Sitzung verwendet.
es: key_file es el nombre de un archivo con formato PEM que contiene la clave privada del servicio Hue. Actualmente se utiliza para cifrar/firmar aserciones y como clave de cliente en una sesión HTTPS.
fr: key_file est le nom d'un fichier au format PEM qui contient la clé privée du service Hue. Il est actuellement utilisé pour chiffrer/signer des assertions et comme clé client dans une session HTTPS.
ja: key_file は、Hue サービスの秘密鍵を含む PEM 形式のファイルの名前です。これは現在、アサーションの暗号化／署名、および HTTPS セッションのクライアントキーとして使用されます。
ko: key_file은 Hue 서비스의 개인 키가 들어 있는 PEM 형식의 파일 이름으로, 현재 어설션 암호화/서명 및 HTTPS 세션의 클라이언트 키로 사용됩니다.
pt_br: key_file é o nome de um arquivo com formato PEM que contém a chave principal do serviço Hue. Isso é usado imediatamente para criptografar/assinar declarações e como chave cliente em uma sessão HTTPS.
zh_cn: key_file 是包含 Hue 服务私钥的 PEM 格式文件的名称。这目前用于加密/签署声明以及用作 HTTPS 会话中的客户端密钥。

source: key_file_password password of the private key
de: key_file_password-Kennwort des Privatschlüssels
es: Contraseña de key_file_password de la clave privada
fr: Mot de passe key_file_password de la clé privée
ja: 秘密鍵の key_file_password パスワード
ko: 개인 키의 key_file_password 암호
zh_cn: 私钥的 key_file_password 密码

source: Execute this script to produce the private key password. This will be used when `key_file_password` is not set.
de: Führen Sie dieses Skript aus, um das Privatschlüsselkennwort zu generieren. Dieses wird verwendet, wenn "key_file_password" nicht festgelegt ist.
es: Ejecute esta secuencia de comandos para generar la contraseña de la clave privada. Se utilizará cuando `key_file_password` no esté definido.
fr: Exécutez ce script pour générer le mot de passe de la clé privée. Il sera utilisé si 'key_file_password' n'est pas défini.
ja: このスクリプトを実行して秘密鍵のパスワードを作成します。これは key_file_password が設定されていない場合に利用されます。
ko: 개인 키 암호를 생성하려면 이 스크립트를 실행합니다. `key_file_password`가 설정되지 않은 경우 사용합니다.
zh_cn: 执行此脚本以生成私钥密码。这将用于未设置 `key_file_password` 的情况。

source: This is the public part of the service private/public key pair. cert_file must be a PEM formatted certificate chain file.
de: Dies ist der öffentliche Teil des Schlüsselpaars für private/öffentliche Verwendung. "cert_file" muss eine PEM-formatierte Zertifikatkettendatei sein.
es: Es la parte pública del par de clave privada/pública del servicio. El archivo cert_file debe ser un archivo de cadena con formato PEM.
fr: Il s'agit de la partie publique de la paire de clés publique/privée du service. cert_file doit être un fichier de chaîne de certificat au format PEM.
ja: これは、サービスの秘密鍵／公開鍵ペアの公開部分です。cert_file は、PEM 形式の証明書チェーンファイルであることが必要です。
ko: 서비스 개인/공개 키 쌍의 공개 부분입니다. cert_file은 PEM 형식의 인증서 체인 파일이어야 합니다.
pt_br: Esta é a parte pública do par de chave privada/pública do serviço. cert_file deve ser um arquivo da cadeia de certificados com formato PEM.
zh_cn: 这是服务私钥/公钥对的公共部分。cert_file 必须是 PEM 格式的证书链文件。

source: A mapping from attributes in the response from the IdP to django user attributes.
de: Eine Zuordnung aus Attributen in der Antwort von IdP an django-Benutzerattribute.
es: Mapping de los atributos de la respuesta del IdP a los atributos de usuario de django.
fr: Mappage d'attributs dans la réponse de l'IdP aux attributs d'utilisateur de django.
ja: IdP からの応答の属性から、django ユーザー属性へのマッピングです。
ko: IdP에서 받은 응답의 특성을 django 사용자 특성으로 Mapping 합니다.
pt_br: Um mapeamento dos atributos na resposta dos atributos de usuário IdP para django.
zh_cn: 从来自 IdP 响应的属性到 django 用户属性的映射。

source: Have Hue initiated authn requests be signed and provide a certificate.
de: Lassen Sie von Hue initiierte Authentifizierungsanforderungen signieren und geben Sie ein Zertifikat an.
es: Pida que se firmen las solicitudes de autorización iniciadas por Hue y facilite un certificado.
fr: Faire signer les requêtes d'authentification initiées par Hue et fournir un certificat.
ja: Hue が開始した authn 要求に署名させ、証明書を提供します。
ko: Hue가 서명된 인증 요청을 시작하도록 하고 인증서를 제공합니다.
pt_br: Deixe que as solicitações de autenticação iniciadas pelo Hue sejam assinadas e forneça um certificado.
zh_cn: 签署 Hue 发起的身份验证请求并提供证书。

source: Have Hue initiated logout requests be signed and provide a certificate.
de: Lassen Sie von Hue initiierte Abmeldeanforderungen signieren und geben Sie ein Zertifikat an.
es: Pida que se firmen las solicitudes de cierre de sesión iniciadas por Hue y facilite un certificado.
fr: Faire signer les requêtes de déconnexion initiées par Hue et fournir un certificat.
ja: Hue が開始した logout 要求に署名させ、証明書を提供します。
ko: Hue가 서명된 로그아웃 요청을 시작하도록 하고 인증서를 제공합니다.
pt_br: Deixe que as solicitações de logout iniciadas pelo Hue sejam assinadas e forneça um certificado.
zh_cn: 签署 Hue 发起的注销请求并提供证书。

source: Username can be sourced from 'attributes' or 'nameid'
de: Der Benutzername kann aus "attributes" oder "nameid" entnommen werden.
es: El nombre de usuario puede tener como origen 'attributes' o 'nameid'
fr: Le nom d'utilisateur peut être issu d'un élément 'attributes' ou 'nameid'
ja: ユーザー名は、attributes または nameid から取得できます
ko: 사용자 이름의 출처는 'attributes' 또는 'nameid'일 수 있습니다.
pt_br: O nome do usuário pode ser originado de 'attributes' ou'nameid'
zh_cn: 用户名可源自 'attributes' 或 'nameid'

source: Performs the logout or not.
de: Führt die Anmeldung durch oder nicht.
es: Realiza o no el cierre de sesión.
fr: Effectue ou non la déconnexion.
ja: ログアウトを実行するかどうかを指定します。
ko: 로그아웃을 수행하거나 수행하지 않습니다.
pt_br: Executa o logout ou não.
zh_cn: 执行注销或不执行注销。

source: Request this NameID format from the server
de: Dieses NameID-Format vom Server anfordern
es: Solicitar este formato de NameID del servidor
fr: Demander ce format de NameID auprès du serveur
ja: サーバーからこの NameID 形式を要求します
ko: 서버에서 이 NameID 형식 요청
pt_br: Solicitar este formato NameID do servidor
zh_cn: 来自服务器的此 NameID 格式的请求

source: username_source not configured properly. SAML integration may not work.
de: username_source ist nicht korrekt konfiguriert. SAML-Integration ist vielleicht nicht möglich.
es: username_source no está configurado correctamente. Puede que no funcione la integración de SAML.
fr: L'élément username_source n'est pas correctement configuré. L'intégration SAML ne fonctionnera peut-être pas.
ja: username_source が適切に設定されていません。SAML 統合は動作しない可能性があります。
ko: username_source가 제대로 구성되지 않았습니다. SAML 통합이 작동하지 않을 수 있습니다.
pt_br: username_source não configurado corretamente. Talvez a integração SAML não funcione.
zh_cn: username_source 未正确配置。SAML 集成可能无法正常工作。
