Repository: cloudera/hue
Catalog: desktop/libs/librdbms/src/librdbms/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, pt_br, zh_cn

source: RDBMS server configurations.
de: RDBMS-Serverkonfigurationen.
es: Configuraciones del servidor RDBMS.
fr: Configurations du serveur RDBMS.
ja: RDBMS サーバーの設定です。
ko: RDBMS 서버 구성입니다.
pt_br: Configurações do servidor RDBMS.
zh_cn: RDBMS 服务器配置。

source: RDBMS server configuration.
de: RDBMS-Serverkonfiguration.
es: Configuración del servidor RDBMS.
fr: Configuration du serveur RDBMS.
ja: RDBMS サーバーの設定です。
ko: RDBMS 서버 구성입니다.
pt_br: Configuração do servidor RDBMS.
zh_cn: RDBMS 服务器配置。

source: Nice name of server.
de: Servername.
es: Nombre del servidor en inglés o con etiqueta.
fr: Nom de serveur correct.
ja: サーバーの適切な名前です。
ko: 적절한 서버 이름입니다.
pt_br: Nome legal de servidor.
zh_cn: 服务器名称。

source: Database name or path to database file. If provided, then choosing other databases will not be permitted.
de: Datenbankname oder Pfad zur Datenbankdatei. Wenn dies angegeben wird, ist das Auswählen anderer Datenbanken nicht zulässig.
es: Nombre de la base de datos o ruta del archivo de la base de datos. Si se indica, no se permitirá elegir otras bases de datos.
fr: Nom de la base de données ou chemin d'accès au fichier de la base de données. S'il est fourni, il ne sera pas possible de choisir une autre base de données.
ja: データベース名、またはデータベースファイルへのパスです。指定されている場合、その他のデータベースを選択することは許可されません。
ko: 데이터베이스 파일에 대한 경로 또는 이름입니다. 지정한 경우에는 다른 데이터베이스를 선택할 수 없습니다.
pt_br: Nome do banco de dados ou caminho para o arquivo do banco de dados. Se for fornecido, escolher outros bancos de dados não será permitido.
zh_cn: 数据库名称或数据库文件路径。如果已提供，则不允许选择其他数据库。

source: Database engine, such as postgresql_psycopg2, mysql, or sqlite3.
de: Datenbank-Engine wie postgresq_psycopg2, mysql oder sqlite3.
es: Motor de base de datos, como postgresql_psycopg2, mysql o sqlite3.
fr: Moteur de base de données, tel que postgresql_psycopg2, mysql ou sqlite3.
ja: postgresql_psycopg2、mysql、sqlite3 などのデータベースエンジンです。
ko: postgresql_psycopg2, mysql, sqlite3 같은 데이터베이스 엔진입니다.
pt_br: Mecanismo de banco de dados, como postgresql_psycopg2, mysql ou sqlite3.
zh_cn: 数据库引擎，如 postgresql_psycopg2、mysql 或 sqlite3。

source: Database username.
de: Datenbank-Benutzername.
es: Nombre de usuario de la base de datos.
fr: Nom d'utilisateur de la base de données.
ja: データベースのユーザー名です。
ko: 데이터베이스 사용자 이름입니다.
pt_br: Nome de usuário do banco de dados.
zh_cn: 数据库用户名。

source: Database password.
de: Datenbank-Kennwort.
es: Contraseña de la base de datos.
fr: Mot de passe de la base de données.
ja: データベースのパスワードです。
ko: 데이터베이스 암호입니다.
pt_br: Senha do banco de dados.
zh_cn: 数据库密码。

source: Execute this script to produce the database password. This will be used when `password` is not set.
de: Führen Sie dieses Skript aus, um das Datenbankkennwort zu generieren. Dieses wird verwendet, wenn "password" nicht festgelegt ist.
es: Ejecute esta secuencia de comandos para generar la contraseña de la base de datos. Se utilizará cuando `password` no esté definido.
fr: Exécutez ce script pour générer le mot de passe de base de données. Il sera utilisé si le 'password' n'est pas défini.
ja: このスクリプトを実行してデータベースパスワードを作成します。これは password が設定されていない場合に利用されます。
ko: 데이터베이스 암호를 생성하려면 이 스크립트를 실행합니다. `password`가 설정되지 않은 경우 사용합니다.
zh_cn: 执行此脚本以生成数据库密码。这将用于未设置“密码”的情况。

source: Database host.
de: Datenbank-Host.
es: Host de la base de datos.
fr: Hôte de la base de données.
ja: データベースのホストです。
ko: 데이터베이스 호스트입니다.
pt_br: Host do banco de dados.
zh_cn: 数据库主机。

source: Database port.
de: Datenbank-Port.
es: Puerto de la base de datos.
fr: Port de la base de données.
ja: データベースのポートです。
ko: 데이터베이스 포트입니다.
pt_br: Porta do banco de dados.
zh_cn: 数据库端口。

source: Database options to send to the server when connecting.
de: Datenbankoptionen, die beim Verbindungsaufbau an den Server gesendet werden.
es: Opciones de base de datos que enviar al servidor al conectar.
fr: Options de base de données à envoyer au serveur lors de la connexion.
ja: 接続時にサーバーに送信するデータベースオプションです。
ko: 연결할 때 서버로 전송할 데이터베이스 옵션입니다.
pt_br: Opções do banco de dados a serem enviadas ao servidor ao conectar.
zh_cn: 连接时发送到服务器的数据库选项。

source: Database name should not be empty for the SQLite backend.
de: Datenbankname darf für das SQLite-Backend nicht leer sein.
es: El nombre de la base de datos no debe estar vacío en el back-end de SQLite.
fr: Le nom de la base de données ne doit pas être vide pour le serveur principal SQLite.
ja: SQLite バックエンドのデータベース名は空にできません。
ko: SQLite 백엔드에 대한 데이터베이스 이름은 비워 둘 수 없습니다.
pt_br: O nome do banco de dados não deve estar vazio para o back-end do SQLite.
zh_cn: 对于 SQLite 后端，数据库名称不应为空。

source: Database name should not be empty for the Oracle backend. It should be the SID of your database.
de: Datenbankname darf für das Oracle-Backend nicht leer sein. Es muss die SID Ihrer Datenbank sein.
es: El nombre de la base de datos no debe estar vacío en el back-end de Oracle. Debe ser el SID de su base de datos.
fr: Le nom de la base de données ne doit pas être vide pour le serveur principal Oracle. Il doit correspondre au SID de votre base de données.
ja: Oracle バックエンドのデータベース名は空にできません。データベースの SID にする必要があります。
ko: Oracle 백엔드에 대한 데이터베이스 이름은 비워 둘 수 없습니다. 데이터베이스의 SID여야 합니다.
pt_br: O nome do banco de dados não deve estar vazio para o back-end da Oracle. Ele deve ser o SID do seu banco de dados.
zh_cn: 对于 Oracle 后端，数据库名称不应为空。该名称应为数据库的 SID。

source: Database name should not be empty for the PostgreSQL backend.
de: Der Datenbankname darf für das PostgreSQL-Backend nicht leer sein.
es: El nombre de la base de datos no debe estar vacío en el back-end de PostgreSQL.
fr: Le nom de la base de données ne doit pas être vide pour le serveur principal PostgreSQL.
ja: PostgreSQL バックエンドのデータベース名は空にできません。
ko: PostgreSQL 백엔드에 대한 데이터베이스 이름은 비워 둘 수 없습니다.
pt_br: O nome do banco de dados não deve estar vazio para o back-end do PostgreSQL.
zh_cn: 对于 PostgreSQL 后端，数据库名称不应为空。

source: No server!
de: Kein Server!
es: No hay servidor.
fr: Pas de serveur !
ja: サーバーがありません。
ko: 서버 없음!
pt_br: Nenhum servidor!
zh_cn: 无服务器！

source: No database!
de: Keine Datenbank!
es: No hay base de datos.
fr: Aucune base de données.
ja: データベースがありません。
ko: 데이터베이스 없음!
pt_br: Nenhum banco de dados!
zh_cn: 无数据库！

source: Database '%s' is not allowed. Please use database '%s'.
de: Datenbank "%s" ist nicht zulässig. Verwenden Sie Datenbank "%s".
es: La base de datos '%s' no está permitida. Utilice la base de datos '%s'.
fr: La base de données '%s' n'est pas autorisée. Veuillez utiliser la base de données '%s'.
ja: データベース %s は使用できません。データベース %s を使用してください。
ko: '%s' 데이터베이스를 사용할 수 없습니다. '%s' 데이터베이스를 사용하십시오.
pt_br: Banco de dados '%s' não permitido. Use o banco de dados '%s'.
zh_cn: 不允许使用数据库 '%s'。请使用数据库 '%s'。

source: Cannot locate the %s database. Are you sure your configuration is correct?
de: Datenbank %s nicht gefunden. Sind Sie sicher, dass Ihre Konfiguration korrekt ist?
es: No se puede localizar la base de datos %s. ¿Está seguro de que la configuración es correcta?
fr: Impossible de localiser la base de données %s. Etes-vous sûr que votre configuration est correcte ?
ja: %s データベースが見つかりません。設定は正しいですか？
ko: %s 데이터베이스를 찾을 수 없습니다. 구성이 맞습니까?
pt_br: Não é possível localizar o banco de dados %s. Tem certeza de que sua configuração está correta?
zh_cn: 无法找到 %s 数据库。您是否确定配置正确？
