{"body":"<div><div id=\"transparent_query_retries\"><div class=\"hue-doc-title\">Impala Transparent Query Retries</div><div><p>Transparent query retries will automatically retry any queries that fail\n      due to cluster membership changes. A cluster membership change typically\n      entails a node leaving the cluster before it crashed or for some other\n      reason stopped responding to statestore heartbeats.</p><p>Traditionally, if a query runs on a node in the Impala cluster, and that\n      node crashes, then the query will fail and it is up to the user to retry\n      the query. With transparent query retries, the query will be automatically\n      retried.</p><ul><li>Queries are only retried if the query failed due to a cluster membership\n        change. Trivial failures, like SQL parsing exceptions are <b>not</b>\n        retried.</li><li>Cluster membership changes fall into two categories: membership updates\n        from the statestore or node blacklisting events. <p>impalads periodically\n        send heartbeats to the statestore, if an impalad stops sending heartbeats\n        to the statestore then that impalad is removed from the cluster\n        membership</p><p>Node blacklisting events occur when a query fails and as\n        a result, an impalad in the cluster is added to the Coordinator's node\n        blacklist. In this scenario, the query is retried.</p></li><li>For most users, query retries will be completely transparent, but\n        users who want to know why a retry was necessary can use runtime profiles.\n        Each query attempt is modelled as a completely new query. Thus, each query\n        attempt has its own runtime profiles. Users can look through the profiles\n        of the failed query attempts to determine why the query was retried.</li></ul><p>Transparent query retries are turned off by default, but can be enabled via\n      the <span class=\"hue-doc-codeph\">RETRY_FAILED_QUERIES</span> query option.</p><div class=\"hue-doc-section\"><p><b>Related information:</b><a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_retry_failed_queries.xml\" data-doc-anchor-id=\"RETRY_FAILED_QUERIES\">RETRY_FAILED_QUERIES Query Option</a></p></div></div></div></div>","title":"Impala Transparent Query Retries"}