{"body":"<div><div id=\"impala_isilon\"><div class=\"hue-doc-title\">Using Impala with Isilon Storage</div><div><p>\n      You can use Impala to query data files that reside on EMC Isilon storage devices, rather\n      than in HDFS. This capability allows convenient query access to a storage system where you\n      might already be managing large volumes of data. The combination of the Impala query\n      engine and Isilon storage is certified on Impala 2.2.4 or higher.\n    </p><p id=\"isilon_block_size_caveat\">\n        Because the EMC Isilon storage devices use a global value for the block size rather than\n        a configurable value for each file, the <span class=\"hue-doc-codeph\">PARQUET_FILE_SIZE</span> query option\n        has no effect when Impala inserts data into a table or partition residing on Isilon\n        storage. Use the <span class=\"hue-doc-codeph\">isi</span> command to set the default block size globally on\n        the Isilon device. For example, to set the Isilon default block size to 256 MB, the\n        recommended size for Parquet data files for Impala, issue the following command:\n<div class=\"hue-doc-codeblock\">isi hdfs settings modify --default-block-size=256MB</div></p><p>\n      The typical use case for Impala and Isilon together is to use Isilon for the default\n      filesystem, replacing HDFS entirely. In this configuration, when you create a database,\n      table, or partition, the data always resides on Isilon storage and you do not need to\n      specify any special <span class=\"hue-doc-codeph\">LOCATION</span> attribute. If you do specify a\n      <span class=\"hue-doc-codeph\">LOCATION</span> attribute, its value refers to a path within the Isilon\n      filesystem. For example:\n    </p><div class=\"hue-doc-codeblock\">-- If the default filesystem is Isilon, all Impala data resides there\n-- and all Impala databases and tables are located there.\nCREATE TABLE t1 (x INT, s STRING);\n\n-- You can specify LOCATION for database, table, or partition,\n-- using values from the Isilon filesystem.\nCREATE DATABASE d1 LOCATION '/some/path/on/isilon/server/d1.db';\nCREATE TABLE d1.t2 (a TINYINT, b BOOLEAN);\n</div><p>\n      Impala can write to, delete, and rename data files and database, table, and partition\n      directories on Isilon storage. Therefore, Impala statements such as <span class=\"hue-doc-codeph\">CREATE\n      TABLE</span>, <span class=\"hue-doc-codeph\">DROP TABLE</span>, <span class=\"hue-doc-codeph\">CREATE DATABASE</span>,\n      <span class=\"hue-doc-codeph\">DROP DATABASE</span>, <span class=\"hue-doc-codeph\">ALTER TABLE</span>, and <span class=\"hue-doc-codeph\">INSERT</span>\n      work the same with Isilon storage as with HDFS.\n    </p><p>\n      When the Impala spill-to-disk feature is activated by a query that approaches the memory\n      limit, Impala writes all the temporary data to a local (not Isilon) storage device.\n      Because the I/O bandwidth for the temporary data depends on the number of local disks, and\n      clusters using Isilon storage might not have as many local disks attached, pay special\n      attention on Isilon-enabled clusters to any queries that use the spill-to-disk feature.\n      Where practical, tune the queries or allocate extra memory for Impala to avoid spilling.\n      Although you can specify an Isilon storage device as the destination for the temporary\n      data for the spill-to-disk feature, that configuration is not recommended due to the need\n      to transfer the data both ways using remote I/O.\n    </p><p>\n      When tuning Impala queries on HDFS, you typically try to avoid any remote reads. When the\n      data resides on Isilon storage, all the I/O consists of remote reads. Do not be alarmed\n      when you see non-zero numbers for remote read measurements in query profile output. The\n      benefit of the Impala and Isilon integration is primarily convenience of not having to\n      move or copy large volumes of data to HDFS, rather than raw query performance. You can\n      increase the performance of Impala I/O for Isilon systems by increasing the value for the\n      <span class=\"hue-doc-codeph\">‑‑num_remote_hdfs_io_threads</span> startup option for the\n      <span class=\"hue-doc-cmdname\">impalad</span> daemon.\n    </p></div></div></div>","title":"Using Impala with Isilon Storage"}