{"body":"<div><div id=\"scan_bytes_limit\"><div class=\"hue-doc-title\">SCAN_BYTES_LIMIT Query Option (Impala 3.1 or higher only)</div><div><p>\n      The <span class=\"hue-doc-codeph\">SCAN_BYTES_LIMIT</span> query option sets a limit on the bytes scanned by\n      HDFS and HBase SCAN operations. If a query is still executing when the query’s\n      coordinator detects that it has exceeded the limit, the query is terminated with an error.\n      The option is intended to prevent runaway queries that scan more data than is intended.\n    </p><p>\n      For example, an Impala administrator could set a default value of\n      <span class=\"hue-doc-codeph\">SCAN_BYTES_LIMIT=100GB</span> for a resource pool to automatically kill queries\n      that scan more than 100 GB of data (see\n      <a class=\"hue-doc-external-link\" href=\"https://impala.apache.org/docs/build/html/topics/impala_admission.html\" target=\"_blank\">Impala\n      Admission Control and Query Queuing</a> for information about default query options).\n      If a user accidentally omits a partition filter in a <span class=\"hue-doc-codeph\">WHERE</span> clause and\n      runs a large query that scans a lot of data, the query will be automatically terminated\n      after it scans more data than the <span class=\"hue-doc-codeph\">SCAN_BYTES_LIMIT</span>.\n    </p><p>\n      You can override the default value per-query or per-session, in the same way as other\n      query options, if you do not want the default <span class=\"hue-doc-codeph\">SCAN_BYTES_LIMIT</span> value to\n      apply to a specific query or session.\n      <div class=\"hue-doc-note\"><ul><li><p>\n              Only data actually read from the underlying storage layer is counted towards the\n              limit. E.g. Impala’s Parquet scanner employs several techniques to skip over\n              data in a file that is not relevant to a specific query, so often only a fraction\n              of the file size is counted towards <span class=\"hue-doc-codeph\">SCAN_BYTES_LIMIT</span>.\n            </p></li><li><p>\n              As of Impala 3.1, bytes scanned by Kudu tablet servers are not counted towards the\n              limit.\n            </p></li></ul></div></p><p>\n      Because the checks are done periodically, the query may scan over the limit at times.\n    </p><p><b>Syntax:</b><span class=\"hue-doc-codeph\">SET SCAN_BYTES_LIMIT=bytes;</span></p><p><b>Type:</b> numeric\n    </p><p><b>Units:</b><ul><li>\n          A numeric argument represents memory size in bytes.\n        </li><li>\n          Specify a suffix of <span class=\"hue-doc-codeph\">m</span> or <span class=\"hue-doc-codeph\">mb</span> for megabytes.\n        </li><li>\n          Specify a suffix of <span class=\"hue-doc-codeph\">g</span> or <span class=\"hue-doc-codeph\">gb</span> for gigabytes.\n        </li><li>\n          If you specify a suffix with unrecognized formats, subsequent queries fail with an\n          error.\n        </li></ul></p><p><b>Default:</b><span class=\"hue-doc-codeph\">0</span> (no limit)\n    </p><p><b>Added in:</b>Impala 3.1</p></div></div></div>","title":"SCAN_BYTES_LIMIT Query Option (Impala 3.1 or higher only)"}