{"body":"<div><div id=\"disable_codegen_rows_threshold\"><div class=\"hue-doc-title\">DISABLE_CODEGEN_ROWS_THRESHOLD Query Option (Impala 2.10 or higher only)</div><div><p> This setting controls the cutoff point (in terms of number\n      of rows processed per Impala daemon) below which Impala disables native\n      code generation for the whole query. Native code generation is very\n      beneficial for queries that process many rows because it reduces the time\n      taken to process of each row. However, generating the native code adds\n      latency to query startup. Therefore, automatically disabling codegen for\n      queries that process relatively small amounts of data can improve query\n      response time. </p><p id=\"syntax_blurb\"><b>Syntax:</b></p><div class=\"hue-doc-codeblock\">SET DISABLE_CODEGEN_ROWS_THRESHOLD=<span class=\"hue-doc-varname\">number_of_rows</span></div><p><b>Type:</b> numeric\n    </p><p><b>Default:</b> 50000\n    </p><p><b>Usage notes:</b> Typically, you increase the default value to make this optimization apply to more queries.\n      If incorrect or corrupted table and column statistics cause Impala to apply this optimization incorrectly to\n      queries that actually involve substantial work, you might see the queries being slower as a result of codegen\n      being disabled. In that case, recompute statistics with the <span class=\"hue-doc-codeph\">COMPUTE STATS</span> or\n      <span class=\"hue-doc-codeph\">COMPUTE INCREMENTAL STATS</span> statement. If there is a problem collecting accurate statistics,\n      you can turn this feature off by setting the value to 0.\n    </p><p id=\"internals_blurb\"><b>Internal details:</b></p><p>\n      This setting applies to queries where the number of rows processed can be accurately\n      determined, either through table and column statistics, or by the presence of a\n      <span class=\"hue-doc-codeph\">LIMIT</span> clause. If Impala cannot accurately estimate the number of rows,\n      then this setting does not apply.\n    </p><p>\n      If a query uses the complex data types <span class=\"hue-doc-codeph\">STRUCT</span>, <span class=\"hue-doc-codeph\">ARRAY</span>,\n      or <span class=\"hue-doc-codeph\">MAP</span>, then codegen is never automatically disabled regardless of the\n      <span class=\"hue-doc-codeph\">DISABLE_CODEGEN_ROWS_THRESHOLD</span> setting.\n    </p><p id=\"added_in_2100\"><b>Added in:</b>Impala 2.10.0</p></div></div></div>","title":"DISABLE_CODEGEN_ROWS_THRESHOLD Query Option (Impala 2.10 or higher only)"}