{"body":"<div><div id=\"mem_limits\"><div class=\"hue-doc-title\">Controlling Impala Resource Usage</div><div><p>\n      Sometimes, balancing raw query performance against scalability requires limiting the amount of resources,\n      such as memory or CPU, used by a single query or group of queries. Impala can use several mechanisms that\n      help to smooth out the load during heavy concurrent usage, resulting in faster overall query times and\n      sharing of resources across Impala queries, MapReduce jobs, and other kinds of workloads across a CDH\n      cluster:\n    </p><ul><li>\n        The Impala admission control feature uses a fast, distributed mechanism to hold back queries that exceed\n        limits on the number of concurrent queries or the amount of memory used. The queries are queued, and\n        executed as other queries finish and resources become available. You can control the concurrency limits,\n        and specify different limits for different groups of users to divide cluster resources according to the\n        priorities of different classes of users. This feature is new in Impala 1.3.\n        See <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_admission.xml\" data-doc-anchor-id=\"admission_control\">Admission Control and Query Queuing</a> for details.\n      </li><li><p>\n          You can restrict the amount of memory Impala reserves during query execution by specifying the\n          <span class=\"hue-doc-codeph\">-mem_limit</span> option for the <span class=\"hue-doc-codeph\">impalad</span> daemon. See\n          <a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_config_options.html#config_options\" target=\"_blank\">Modifying Impala Startup Options</a> for details. This limit applies only to the\n          memory that is directly consumed by queries; Impala reserves additional memory at startup, for example to\n          hold cached metadata.\n        </p></li><li><p>\n          For production deployments, implement resource isolation using your cluster management\n          tool.\n        </p></li></ul></div></div></div>","title":"Controlling Impala Resource Usage"}