{"body":"<div><div id=\"s3_skip_insert_staging\"><div class=\"hue-doc-title\">S3_SKIP_INSERT_STAGING Query Option (Impala 2.6 or higher only)</div><div><p/><p>\n      Speeds up <span class=\"hue-doc-codeph\">INSERT</span> operations on tables or partitions residing on the\n      Amazon S3 filesystem. The tradeoff is the possibility of inconsistent data left behind\n      if an error occurs partway through the operation.\n    </p><p>\n      By default, Impala write operations to S3 tables and partitions involve a two-stage process.\n      Impala writes intermediate files to S3, then (because S3 does not provide a <q>rename</q>\n      operation) those intermediate files are copied to their final location, making the process\n      more expensive as on a filesystem that supports renaming or moving files.\n      This query option makes Impala skip the intermediate files, and instead write the\n      new data directly to the final destination.\n    </p><p id=\"usage_notes_blurb\"><b>Usage notes:</b></p><div class=\"hue-doc-note\"><p>\n        If a host that is participating in the <span class=\"hue-doc-codeph\">INSERT</span> operation fails partway through\n        the query, you might be left with a table or partition that contains some but not all of the\n        expected data files. Therefore, this option is most appropriate for a development or test\n        environment where you have the ability to reconstruct the table if a problem during\n        <span class=\"hue-doc-codeph\">INSERT</span> leaves the data in an inconsistent state.\n      </p></div><p>\n      The timing of file deletion during an <span class=\"hue-doc-codeph\">INSERT OVERWRITE</span> operation\n      makes it impractical to write new files to S3 and delete the old files in a single operation.\n      Therefore, this query option only affects regular <span class=\"hue-doc-codeph\">INSERT</span> statements that add\n      to the existing data in a table, not <span class=\"hue-doc-codeph\">INSERT OVERWRITE</span> statements.\n      Use <span class=\"hue-doc-codeph\">TRUNCATE TABLE</span> if you need to remove all contents from an S3 table\n      before performing a fast <span class=\"hue-doc-codeph\">INSERT</span> with this option enabled.\n    </p><p>\n      Performance improvements with this option enabled can be substantial. The speed increase\n      might be more noticeable for non-partitioned tables than for partitioned tables.\n    </p><p id=\"type_boolean\"><b>Type:</b> Boolean; recognized values are 1 and 0, or <span class=\"hue-doc-codeph\">true</span> and <span class=\"hue-doc-codeph\">false</span>;\n        any other value interpreted as <span class=\"hue-doc-codeph\">false</span></p><p id=\"default_true_1\"><b>Default:</b><span class=\"hue-doc-codeph\">true</span> (shown as 1 in output of <span class=\"hue-doc-codeph\">SET</span> statement)\n      </p><p id=\"added_in_260\"><b>Added in:</b>Impala 2.6.0</p><p id=\"related_info\"><b>Related information:</b></p><p><a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_s3.html#s3\" target=\"_blank\">Using Impala with the Amazon S3 Filesystem</a></p></div></div></div>","title":"S3_SKIP_INSERT_STAGING Query Option (Impala 2.6 or higher only)"}