{"body":"<div><div id=\"thread_reservation_limit\"><div class=\"hue-doc-title\">THREAD_RESERVATION_LIMIT Query Option (Impala 3.1 or higher only)</div><div><p>\n      The <span class=\"hue-doc-codeph\">THREAD_RESERVATION_LIMIT</span> query option limits the number of reserved\n      threads for a query on each node. The option is intended to prevent execution of complex\n      queries that can consume excessive CPU or operating system resources on a single node.\n      Queries that have more threads per node than this threshold are rejected by Impala’s\n      admission controller before they start executing. You can see the number of reserved\n      threads for a query in its\n      <a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_explain_plan.html#explain_plan\" target=\"_blank\">explain plan</a> in the\n      “Per-Host Resource Reservation\" line.\n    </p><p>\n      For example, an Impala administrator could set a default value of\n      <span class=\"hue-doc-codeph\">THREAD_RESERVATION_LIMIT=100</span> for a resource pool where they expect only\n      relatively simple queries to run. This will reject queries that require more than 100\n      reserved threads on a node, for example, queries with more than 100 fragments.\n    </p><p>\n      You can override the default value per-query or per-session, in the same way as other\n      query options, if you do not want the default <span class=\"hue-doc-codeph\">THREAD_RESERVATION_LIMIT</span>\n      value to apply to a specific query or session.\n    </p><p><div class=\"hue-doc-note\">        The number of reserved threads on a node may be lower than the maximum value in the\n        explain plan if not all fragments of that query are scheduled on every node.\n      </div></p><p><b>Syntax:</b><span class=\"hue-doc-codeph\">SET THREAD_RESERVATION_LIMIT=number;</span></p><p><b>Type:</b> numeric\n    </p><p><b>Default:</b> 3000\n    </p><p><b>Added in:</b>Impala 3.1</p></div></div></div>","title":"THREAD_RESERVATION_LIMIT Query Option (Impala 3.1 or higher only)"}