{"body":"<div><div id=\"disable_unsafe_spills\"><div class=\"hue-doc-title\">DISABLE_UNSAFE_SPILLS Query Option (Impala 2.0 or higher only)</div><div><p>\n      Enable this option if you prefer to have queries fail when they exceed the Impala memory limit, rather than\n      write temporary data to disk.\n    </p><p>\n      Queries that <q>spill</q> to disk typically complete successfully, when in earlier Impala releases they would have failed.\n      However, queries with exorbitant memory requirements due to missing statistics or inefficient join clauses could\n      become so slow as a result that you would rather have them cancelled automatically and reduce the memory\n      usage through standard Impala tuning techniques.\n    </p><p>\n      This option prevents only <q>unsafe</q> spill operations, meaning that one or more tables are missing\n      statistics or the query does not include a hint to set the most efficient mechanism for a join or\n      <span class=\"hue-doc-codeph\">INSERT ... SELECT</span> into a partitioned table. These are the tables most likely to result in\n      suboptimal execution plans that could cause unnecessary spilling. Therefore, leaving this option enabled is a\n      good way to find tables on which to run the <span class=\"hue-doc-codeph\">COMPUTE STATS</span> statement.\n    </p><p>\n      See <a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_scalability.html#spill_to_disk\" target=\"_blank\">SQL Operations that Spill to Disk</a> for information about the <q>spill to disk</q>\n      feature for queries processing large result sets with joins, <span class=\"hue-doc-codeph\">ORDER BY</span>, <span class=\"hue-doc-codeph\">GROUP\n      BY</span>, <span class=\"hue-doc-codeph\">DISTINCT</span>, aggregation functions, or analytic functions.\n    </p><p id=\"type_boolean\"><b>Type:</b> Boolean; recognized values are 1 and 0, or <span class=\"hue-doc-codeph\">true</span> and <span class=\"hue-doc-codeph\">false</span>;\n        any other value interpreted as <span class=\"hue-doc-codeph\">false</span></p><p id=\"default_false_0\"><b>Default:</b><span class=\"hue-doc-codeph\">false</span> (shown as 0 in output of <span class=\"hue-doc-codeph\">SET</span> statement)\n      </p><p id=\"added_in_20\"><b>Added in:</b>Impala 2.0.0</p></div></div></div>","title":"DISABLE_UNSAFE_SPILLS Query Option (Impala 2.0 or higher only)"}