{"body":"<div><div id=\"runtime_bloom_filter_size\"><div class=\"hue-doc-title\">RUNTIME_BLOOM_FILTER_SIZE Query Option (Impala 2.5 or higher only)</div><div><p>\n      Size (in bytes) of Bloom filter data structure used by the runtime filtering\n      feature.\n    </p><div class=\"hue-doc-note\"><p>\n        In Impala 2.6 and higher, this query option only applies as a fallback, when statistics\n        are not available. By default, Impala estimates the optimal size of the Bloom filter structure\n        regardless of the setting for this option. (This is a change from the original behavior in\n        Impala 2.5.)\n      </p><p>\n        In Impala 2.6 and higher, when the value of this query option is used for query planning,\n        it is constrained by the minimum and maximum sizes specified by the\n        <span class=\"hue-doc-codeph\">RUNTIME_FILTER_MIN_SIZE</span> and <span class=\"hue-doc-codeph\">RUNTIME_FILTER_MAX_SIZE</span> query options.\n        The filter size is adjusted upward or downward if necessary to fit within the minimum/maximum range.\n      </p></div><p id=\"type_integer\"><b>Type:</b> integer\n      </p><p><b>Default:</b> 1048576 (1 MB)\n    </p><p><b>Maximum:</b> 16 MB\n    </p><p id=\"added_in_250\"><b>Added in:</b>Impala 2.5.0</p><p id=\"usage_notes_blurb\"><b>Usage notes:</b></p><p>\n      This setting affects optimizations for large and complex queries, such\n      as dynamic partition pruning for partitioned tables, and join optimization\n      for queries that join large tables.\n      Larger filters are more effective at handling\n      higher cardinality input sets, but consume more memory per filter.\n      </p><p>\n      If your query filters on high-cardinality columns (for example, millions of different values)\n      and you do not get the expected speedup from the runtime filtering mechanism, consider\n      doing some benchmarks with a higher value for <span class=\"hue-doc-codeph\">RUNTIME_BLOOM_FILTER_SIZE</span>.\n      The extra memory devoted to the Bloom filter data structures can help make the filtering\n      more accurate.\n    </p><p id=\"runtime_filtering_option_caveat\">\n        Because the runtime filtering feature applies mainly to resource-intensive\n        and long-running queries, only adjust this query option when tuning long-running queries\n        involving some combination of large partitioned tables and joins involving large tables.\n      </p><p>\n      Because the effectiveness of this setting depends so much on query characteristics and data distribution,\n      you typically only use it for specific queries that need some extra tuning, and the ideal value depends\n      on the query. Consider setting this query option immediately before the expensive query and\n      unsetting it immediately afterward.\n    </p><p id=\"kudu_blurb\"><b>Kudu considerations:</b></p><p id=\"filter_option_bloom_only\">\n        This query option affects only Bloom filters, not the min/max filters\n        that are applied to Kudu tables. Therefore, it does not affect the\n        performance of queries against Kudu tables.\n      </p><p id=\"related_info\"><b>Related information:</b></p><p><a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_runtime_filtering.html\" target=\"_blank\">Runtime Filtering for Impala Queries (Impala 2.5 or higher only)</a>,\n      <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_runtime_filter_mode.xml\" data-doc-anchor-id=\"runtime_filter_mode\">RUNTIME_FILTER_MODE Query Option (Impala 2.5 or higher only)</a>,\n      <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_runtime_filter_min_size.xml\" data-doc-anchor-id=\"runtime_filter_min_size\">RUNTIME_FILTER_MIN_SIZE Query Option (Impala 2.6 or higher only)</a>,\n      <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_runtime_filter_max_size.xml\" data-doc-anchor-id=\"runtime_filter_max_size\">RUNTIME_FILTER_MAX_SIZE Query Option (Impala 2.6 or higher only)</a></p></div></div></div>","title":"RUNTIME_BLOOM_FILTER_SIZE Query Option (Impala 2.5 or higher only)"}