{"body":"<div><div id=\"identifiers\"><div class=\"hue-doc-title\">Overview of Impala Identifiers</div><div><p>\n      Identifiers are the names of databases, tables, or columns that you specify in a SQL statement. The rules for\n      identifiers govern what names you can give to things you create, the notation for referring to names\n      containing unusual characters, and other aspects such as case sensitivity.\n    </p><ul><li><p>\n        The minimum length of an identifier is 1 character.\n        </p></li><li><p>\n        The maximum length of an identifier is currently 128 characters, enforced by the metastore database.\n        </p></li><li><p>\n        An identifier must start with an alphanumeric or underscore character. Quoting the identifier with\n        backticks has no effect on the allowed characters in the name.\n        </p></li><li><p>\n        An identifier can contain only ASCII characters.\n        </p></li><li><p>\n        To use an identifier name that matches one of the Impala reserved keywords (listed in\n        <a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_reserved_words.html#reserved_words\" target=\"_blank\">Impala Reserved Words</a>), surround the identifier with <span class=\"hue-doc-codeph\">``</span>\n        characters (backticks). Quote the reserved word even if it is part of a fully qualified name.\n        The following example shows how a reserved word can be used as a column name if it is quoted\n        with backticks in the <span class=\"hue-doc-codeph\">CREATE TABLE</span> statement, and how the column name\n        must also be quoted with backticks in a query:\n        </p><div class=\"hue-doc-codeblock\">[localhost:21000] &gt; create table reserved (`data` string);\n\n[localhost:21000] &gt; select data from reserved;\nERROR: AnalysisException: Syntax error in line 1:\nselect data from reserved\n       ^\nEncountered: DATA\nExpected: ALL, CASE, CAST, DISTINCT, EXISTS, FALSE, IF, INTERVAL, NOT, NULL, STRAIGHT_JOIN, TRUE, IDENTIFIER\nCAUSED BY: Exception: Syntax error\n\n[localhost:21000] &gt; select reserved.data from reserved;\nERROR: AnalysisException: Syntax error in line 1:\nselect reserved.data from reserved\n                ^\nEncountered: DATA\nExpected: IDENTIFIER\nCAUSED BY: Exception: Syntax error\n\n[localhost:21000] &gt; select reserved.`data` from reserved;\n\n[localhost:21000] &gt;\n</div><div class=\"hue-doc-note\">          Because the list of reserved words grows over time as new SQL syntax is added,\n          consider adopting coding conventions (especially for any automated scripts\n          or in packaged applications) to always quote all identifiers with backticks.\n          Quoting all identifiers protects your SQL from compatibility issues if\n          new reserved words are added in later releases.\n        </div></li><li><p>\n        Impala identifiers are always case-insensitive. That is, tables named <span class=\"hue-doc-codeph\">t1</span> and\n        <span class=\"hue-doc-codeph\">T1</span> always refer to the same table, regardless of quote characters. Internally, Impala\n        always folds all specified table and column names to lowercase. This is why the column headers in query\n        output are always displayed in lowercase.\n        </p></li></ul><p>\n      See <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_aliases.xml\" data-doc-anchor-id=\"aliases\">Overview of Impala Aliases</a> for how to define shorter or easier-to-remember aliases if the\n      original names are long or cryptic identifiers.\n      <span class=\"hue-doc-ph\" id=\"aliases_vs_identifiers\"> Aliases follow the same rules as identifiers when it comes to case\n        insensitivity. Aliases can be longer than identifiers (up to the maximum length of a Java string) and can\n        include additional characters such as spaces and dashes when they are quoted using backtick characters.\n        </span></p><p id=\"views_vs_identifiers\">\n        Another way to define different names for the same tables or columns is to create views. See\n        <a class=\"hue-doc-internal-link\" href=\"javascript:void(0);\" data-doc-ref=\"topics/impala_views.xml\" data-doc-anchor-id=\"views\">Overview of Impala Views</a> for details.\n      </p></div></div></div>","title":"Overview of Impala Identifiers"}