{"body":"<div><div id=\"exec_time_limit_s\"><div class=\"hue-doc-title\">EXEC_TIME_LIMIT_S Query Option (Impala 2.12 or higher only)</div><div><p>\n      The <span class=\"hue-doc-codeph\">EXEC_TIME_LIMIT_S</span> query option sets a time limit on query execution.\n      If a query is still executing when time limit expires, it is automatically canceled. The\n      option is intended to prevent runaway queries that execute for much longer than intended.\n    </p><p>\n      For example, an Impala administrator could set a default value of\n      <span class=\"hue-doc-codeph\">EXEC_TIME_LIMIT_S=3600</span> for a resource pool to automatically kill queries\n      that execute for longer than one hour (see\n      <a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_admission.html#admission_control\" target=\"_blank\">Admission Control and Query Queuing</a> for information about default query\n      options). Then, if a user accidentally runs a large query that executes for more than one\n      hour, it will be automatically killed after the time limit expires to free up resources.\n      Users can override the default value per query or per session if they do not want the\n      default <span class=\"hue-doc-codeph\">EXEC_TIME_LIMIT_S</span> value to apply to a specific query or a\n      session.\n    </p><div class=\"hue-doc-note\"><p>\n        The time limit only starts once the query is executing. Time spent planning the query,\n        scheduling the query, or in admission control is not counted towards the execution time\n        limit. <span class=\"hue-doc-codeph\">SELECT</span> statements are eligible for automatic cancellation until\n        the client has fetched all result rows. DML queries are eligible for automatic\n        cancellation until the DML statement has finished.\n      </p></div><p id=\"syntax_blurb\"><b>Syntax:</b></p><div class=\"hue-doc-codeblock\">SET EXEC_TIME_LIMIT_S=<span class=\"hue-doc-varname\">seconds</span>;</div><p><b>Type:</b> numeric\n    </p><p><b>Default:</b> 0 (no time limit )\n    </p><p id=\"added_in_212\"><b>Added in:</b>Impala 2.12</p><p id=\"related_info\"><b>Related information:</b></p><p><a class=\"hue-doc-external-link\" href=\"https://www.cloudera.com/documentation/enterprise/latest/topics/impala_timeouts.html#timeouts\" target=\"_blank\">Setting Timeout Periods for Daemons, Queries, and Sessions</a></p></div></div></div>","title":"EXEC_TIME_LIMIT_S Query Option (Impala 2.12 or higher only)"}