{"body":"<div><div id=\"num_nodes\"><div class=\"hue-doc-title\">NUM_NODES Query Option</div><div><p>\n      Limit the number of nodes that process a query, typically during debugging.\n    </p><p><b>Type:</b> numeric\n    </p><p><b>Allowed values:</b> Only accepts the values 0\n      (meaning all nodes) or 1 (meaning all work is done on the coordinator node).\n</p><p><b>Default:</b> 0\n    </p><p id=\"usage_notes_blurb\"><b>Usage notes:</b></p><p>\n       If you are diagnosing a problem that you suspect is due to a timing issue due to\n       distributed query processing, you can set <span class=\"hue-doc-codeph\">NUM_NODES=1</span> to verify\n       if the problem still occurs when all the work is done on a single node.\n     </p><p id=\"num_nodes_tip\">\n        You might set the <span class=\"hue-doc-codeph\">NUM_NODES</span> option to 1 briefly, during <span class=\"hue-doc-codeph\">INSERT</span> or\n        <span class=\"hue-doc-codeph\">CREATE TABLE AS SELECT</span> statements. Normally, those statements produce one or more data\n        files per data node. If the write operation involves small amounts of data, a Parquet table, and/or a\n        partitioned table, the default behavior could produce many small files when intuitively you might expect\n        only a single output file. <span class=\"hue-doc-codeph\">SET NUM_NODES=1</span> turns off the <q>distributed</q> aspect of the\n        write operation, making it more likely to produce only one or a few data files.\n      </p><div class=\"hue-doc-note\"><p>\n      Because this option results in increased resource utilization on a single host,\n      it could cause problems due to contention with other Impala statements or\n      high resource usage. Symptoms could include queries running slowly, exceeding the memory limit,\n      or appearing to hang. Use it only in a single-user development/test environment;\n      <b>do not</b> use it in a production environment or in a cluster with a high-concurrency\n      or high-volume or performance-critical workload.\n    </p></div></div></div></div>","title":"NUM_NODES Query Option"}