Repository: cloudera/hue
Catalog: desktop/libs/indexer/src/indexer/locale/*/LC_MESSAGES/django.po
Languages: pt, pt_br

source: POST request required.
pt: É necessário um pedido POST.
pt_br: Solicitação POST necessária.

source: Could not detect any fields.
pt: Não foram detectados quaisquer campos.
pt_br: Não é possível detectar qualquer campo.

source: Type %s not supported.
pt: Tipo %s não suportado.
pt_br: Tipo %s incompatível.

source: Source type %s not supported.
pt: Tipo de origem %s não suportado.
pt_br: Tipod e origem %s não compatível.

source: Collection created!
pt: Colecção criada!
pt_br: Coleção criada!

source: Collection missing.
pt: Colecção em falta!
pt_br: Coleção ausente.

source: No collections to remove.
pt: Nenhuma colecção a remover.
pt_br: Não há coleções a serem excluídas.

source: Collections removed!
pt: Colecções removidas!
pt_br: Coleção excluída!

source: GET request required.
pt: Pedido GET necessário.
pt_br: Solicitação GET necessária.

source: No collection to update.
pt: Nenhuma colecção a actualizar.
pt_br: Não há coleções a serem atualizadas.

source: Collection updated!
pt: Colecção actualizada!
pt_br: Coleção atualizada!

source: Index imported!
pt: Índice importado!
pt_br: Índice importado!

source: Unsupported source %s
pt: Origem não suportada: %s
pt_br: Origem %s incompatível

source: Batch indexer path in HDFS.
pt: Caminho do indexador em lote no HDFS.
pt_br: Caminho do indexador em lote no HDFS.

source: Local path to Hue folder where Solr instance directories will be created in non-solrcloud mode.
pt: Caminho local para a pasta do Hue onde os directórios de instância Solr serão criados no modo non-solrcloud.
pt_br: Caminho local para a pasta Hue onde os diretórios da instância Solr serão criados em modo não solrcloud.

source: Default template used at collection creation.
pt: Modelo predefinido utilizado na criação da recolha.
pt_br: Modelo padrão usado na criação da coleção.

source: Location of the solrctl binary.
pt: Localização do binário solrctl.
pt_br: Localização do Solrctl binário.

source: Zookeeper ensemble.
pt: Grupo do ZooKeeper.
pt_br: Grupo Zookeeper.

source: Could not fetch fields for collection %s.
pt: Não foi possível obter campos para a colecção %s.
pt_br: Não é possível obter campos para a coleção %s.

source: Could not fetch fields for collection %s. See logs for more info.
pt: Não foi possível obter campos para a colecção %s. Consulte os registos para mais informações.
pt_br: Não é possível obter campos para a coleção %s.Consulte os registros para mais informações.

source: Could not fetch unique key for collection %s.
pt: Não foi possível obter a chave única para a colecção %s.
pt_br: Não é possível obter uma chave exclusiva para a coleção %s.

source: Could not fetch unique key for collection %s. See logs for more info.
pt: Não foi possível obter a chave única para a colecção %s. Consulte os registos para mais informações.
pt_br: Não é possível obter uma chave exclusiva para a coleção %s. Consulte os registros para mais informações.

source: Could not create instance directory. Check if solr_zk_ensemble and solrctl_path are correct in Hue config [indexer].
pt: Não foi possível criar um directório de instância. Verifique se solr_zk_ensemble and solrctl_path são correctos e corrija no [indexer] de configuração do Hue.
pt_br: Não foi possível criar o diretório da instância. Verifique se solr_zk_ensemble e solrctl_path estão corretos na configuração do Hue [indexador].

source: Could not create collection. Check error logs for more info.
pt: Não foi possível criar a colecção. Consulte os registos de erros para mais informações.
pt_br: Não é possível criar uma coleção. Verifique os registros de erros para obter mais informações.

source: Instance directory %s already exists! Please remove it from the file system.
pt: O directório de instância %s já existe! Remova-o do sistema de ficheiros.
pt_br: O diretório da instância %s já existe! Remova-o do sistema de arquivos.

source: Cannot remove Solr cores.
pt: Não é possível remover os núcleos do Solr.
pt_br: Não é possível remover núcleos Solr.

source: Could not create instance directory. Check error logs for more info.
pt: Não foi possível criar um directório de instância. Verifique os registos de erros para obter mais informações.
pt_br: Não é possível criar o diretório da instância. Verifique os registros de erros para obter mais informações.

source: Could not remove collection. Check error logs for more info.
pt: Não é possível eliminar a recolha. Verifique os registos de erros para obter mais informações.
pt_br: Não é possível remover a coleção. Verifique os registros de erros para obter mais informações.

source: File size is too large to handle!
pt: O tamanho do ficheiro é demasiado grande para ser processado!
pt_br: O tamanho do arquivo é muito grande para manipulação!

source: Could not update index. Unknown type %s
pt: Não foi possível actualizar o índice. Tipo desconhecido: %s
pt_br: Não é possível atualizar o índice. Tipo desconhecido %s

source: Could not update index. Check error logs for more info.
pt: Não foi possível actualizar o índice. Verifique os registos de erros para obter mais informações.
pt_br: Não é possível atualizar o índice. Verifique os registros de erros para obter mais informações.

source: Could not update index. Indexing strategy %s not supported.
pt: Não foi possível actualizar o índice. A estratégia de indexação %s não é suportada.
pt_br: Não foi possível atualizar o índice. A estratégia de indexação %s não tem suporte.

source: Could not update index. Could not fetch any data from Hive.
pt: Não foi possível actualizar o índice. Não foi possível obter quaisquer dados do Hive.
pt_br: Não foi possível atualizar o índice. Não foi possível obter dados do Hive.

source: %s is not a boolean value
pt: %s não é um valor booleano
pt_br: %s não é um valor booleano

source: A POST request is required.
pt: É necessário um pedido POST.
pt_br: É necessária uma solicitação POST.

source: Installing twitter collection
pt: A instalar a colecção do Twitter
pt_br: Instalação da coleção do Twitter

source: Twitter collection successfully installed
pt: Colecção do Twitter instalada com sucesso
pt_br: Coleção do Twitter instalada com êxito

source: Installing yelp collection
pt: A instalar colecção do Yelp
pt_br: Instalação da coleção Yelp

source: Yelp collection successfully installed
pt: Colecção do Yelp instalada com sucesso
pt_br: Coleção Yelp instalada com êxito

source: Installing jobs collection
pt: A instalar colecção de trabalhos
pt_br: Instalação da coleção de jobs

source: Jobs collection successfully installed
pt: Colecção de trabalhos instalada com sucesso
pt_br: Coleção de jobs instalada com êxito

source: Installing logs collection
pt: A instalar colecção de registos
pt_br: Instalação da coleção de registros

source: Logs collection successfully installed
pt: Colecção de registos instalada com sucesso
pt_br: Coleção de registros instalada com êxito

source: Search Indexes
pt: Pesquisar índices
pt_br: Pesquisar índices

source: Collections
pt: Colecções
pt_br: Coleções

source: Dashboards
pt: Painéis
pt_br: Painéis

source: Indexes
pt: Índices
pt_br: Índices

source: Choose a file
pt: Escolha um ficheiro
pt_br: Escolha um arquivo

source: Delete indexes
pt: Eliminar índices
pt_br: Excluir índices

source: Cancel
pt: Cancelar
pt_br: Cancelar

source: Confirm
pt: Confirmar
pt_br: Confirmar

source: Delete index
pt: Eliminar índice
pt_br: Excluir índice

source: Filter indexes...
pt: Filtrar índices...
pt_br: Filtrar índices...

source: Delete the selected indexes. These must be solr cloud collections. Cores cannot be deleted currently.
pt: Eliminar os índices seleccionados. Estes têm de ser recolhas de nuvem solr. Os núcleos não podem ser eliminados actualmente.
pt_br: Exclua os índices selecionados. Eles devem ser coleções solr cloud. Núcleos não podem ser excluídos no momento.

source: Delete
pt: Eliminar
pt_br: Excluir

source: Show cores
pt: Mostrar núcleos
pt_br: Exibir núcleos

source: Create
pt: Criar
pt_br: Criar

source: There are currently no indexes defined.
pt: Neste momento, não existem índices definidos.
pt_br: No momento não há índices definidos.

source: Click here to add
pt: Clique aqui para adicionar
pt_br: Clique aqui para adicionar

source: one or more.
pt: um ou mais.
pt_br: um ou mais.

source: Name
pt: Nome
pt_br: Nome

source: Previous
pt: Anterior
pt_br: Anterior

source: Next
pt: Seguinte
pt_br: Próximo

source: Finish
pt: Terminar
pt_br: Concluir

source: Pick a name and a CSV or Tab separated file with header to index from HDFS
pt: Escolha um nome e um ficheiro CSV ou separado por tabulações com cabeçalho para indexar a partir do HDFS
pt_br: Escolha um nome e um arquivo CSV ou Tab separado com com cabeçalho para indexar do HDFS

source: Name of index
pt: Nome do índice
pt_br: Nome do índice

source: Files
pt: Ficheiros
pt_br: Arquivos

source: Source type
pt: Tipo de origem
pt_br: Tipo de origem

source: Format of the selected file to index
pt: Formato do ficheiro seleccionado para índice
pt_br: Formato do arquivo selecionado para indexação

source: Separator
pt: Separador
pt_br: Separador

source: Quote character
pt: Carácter de aspas
pt_br: Caractere com aspas

source: Morphlines config name
pt: Nome da config. do Morphlines
pt_br: Nome da configuração Morphlines

source: Morphlines config expression
pt: Expressão da config. do Morphlines
pt_br: Expressão de configuração Morphlines

source: Type
pt: Tipo
pt_br: Tipo

source: Required
pt: Obrigatório
pt_br: Obrigatório

source: Indexed
pt: Indexado
pt_br: Indexado

source: Stored
pt: Armazenado
pt_br: Armazenado

source: Unique Key
pt: Chave única
pt_br: Chave exclusiva

source: Default Field
pt: Campo predefinido
pt_br: Campo padrão

source: Add
pt: Adicionar
pt_br: Adicionar

source: Actions
pt: Acções
pt_br: Ações

source: Search
pt: Pesquisar
pt_br: Pesquisar

source: Index file
pt: Ficheiro de índice
pt_br: Indexar arquivo

source: Unique key field
pt: Campo-chave único
pt_br: Campo de chave exclusiva

source: Update
pt: Actualizar
pt_br: Atualizar

source: CSV or TSV file to index
pt: Ficheiro CSV ou TSV para índice
pt_br: Arquivo CSV ou TSV para indexar

source: Name is missing
pt: Nome em falta
pt_br: Nome ausente

source: File path is missing
pt: Caminho de ficheiro está em falta
pt_br: Está faltando o caminho do arquivo

source: Field name is missing
pt: Nome de ficheiro está em falta
pt_br: Está faltando o nome do campo

source: Field type is missing
pt: Tipo de campo está em falta
pt_br: Está faltando o tipo de campo

source: Upload data
pt: Carregar dados
pt_br: Dados carregados

source: Retweeted %s times
pt: Tweet reenviado %s vezes
pt_br: Retweetado %s vezes

source: Reply
pt: Responder
pt_br: Responder

source: Retweet
pt: Reenviar tweet
pt_br: Retweetar
