Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Location on local FS where the xslt files are stored for workflow import.
de: Ordner auf lokalem Dateisystem, in dem die xslt-Dateien zur Eingabe in den Workflow gespeichert werden.
es: Ubicación, en el sistema de archivos local, en la que se almacenan los archivos xslt para la importación de workflows.
fr: Emplacement sur le système de fichiers local où les fichiers xslt sont stockés en vue de l'importation de workflow.
ja: Workflow をインポートするために xslt ファイルが保存されているローカル FS 上の場所です。
ko: Workflow 가져오기에 필요한 xslt 파일이 저장되는 로컬 FS상의 위치입니다.
zh_cn: 本地文件系统中存储用于 workflow 导入的 xslt 文件的位置。

source: Location on local filesystem where the examples are stored.
de: Ordner auf lokalem Dateisystem, in dem die Beispiele gespeichert werden
es: Ubicación, en el sistema de archivos local, en la que se almacenan los ejemplos.
fr: Emplacement sur le système de fichiers local où les exemples sont stockés.
ja: 例が保存されているローカルファイルシステム上の場所です。
ko: 예제가 저장되는 로컬 파일 시스템상의 위치입니다.
zh_cn: 本地文件系统中存储示例的位置。

source: Location on local filesystem where the data for the examples is stored.
de: Ordner auf dem lokalen Dateisystem, in dem die Daten für die Beispiele gespeichert werden
es: Ubicación, en el sistema de archivos local, en la que se almacenan los datos para los ejemplos.
fr: Emplacement sur le système de fichiers local où les données des exemples sont stockées.
ja: 例のデータが保存されているローカルファイルシステム上の場所です。
ko: 예제의 데이터가 저장되는 로컬 파일 시스템상의 위치입니다.
zh_cn: 本地文件系统中存储示例数据的位置。

source: Location on HDFS where the Oozie workflows are stored. Parameters are $TIME and $USER, e.g. /user/$USER/hue/workspaces/workflow-$TIME
de: Speicherort in HDFS, an dem die Oozie-Workflows gespeichert sind. Parameter sind $TIME und $USER, z.B. /user/$USER/hue/workspaces/workflow-$TIME
es: Ubicación en HDFS donde se almacenan los workflows de Oozie. Los parámetros son $TIME y $USER, p. ej., /user/$USER/hue/workspaces/workflow-$TIME
fr: Emplacement sur HDFS où les workflows Oozie sont stockés. Les paramètres sont $TIME et $USER, par exemple /user/$USER/hue/workspaces/workflow-$TIME
ja: Oozie Workflow が保存されている HDFS 上の場所です。パラメータは $TIME および $USER です（たとえば、/user/$USER/hue/workspaces/workflow-$TIME のようになります）。
ko: Oozie Workflow가 저장되는 HDFS상의 위치입니다. 매개변수는 $TIME 및 $USER(예: /user/$USER/hue/workspaces/workflow-$TIME)입니다.
zh_cn: HDFS 中存储 Oozie workflow 的位置。参数是 $TIME 和 $USER，例如 /user/$USER/hue/workspaces/workflow-$TIME

source: Maximum number of Oozie workflows or coodinators or bundles to retrieve in one API call.
de: Maximale Anzahl von Oozie-Workflows oder -Coordinators, die in einem API-Anruf abgerufen werden können.
es: Número máximo de workflows o de coordinators de Oozie, o de bundles por recuperar en una llamada API.
fr: Nombre maximal de workflows, de coordinators ou de bundles Oozie à récupérer dans un appel API.
ja: 1 回の API 呼び出しで取得する Oozie Workflow、Coordinator、Bundle の最大数です。
ko: 하나의 API 호출로 불러오는 Oozie Workflow나 Coodinator 또는 Bundles의 최대 개수입니다.
zh_cn: 一次 API 调用中最多可检索到的 Oozie Workflow 或 Coordinator 或 Bundle 数量。

source: Use version 2 of Editor.
de: Verwenden Sie Version 2 des Editors.
es: Utilice la versión 2 del editor.
fr: Utiliser la version 2 de l'Editeur.
ja: エディタのバージョン 2 を使用してください。
ko: 편집기 버전 2를 사용하십시오.
zh_cn: 使用 Editor 版本 2。

source: Use Cron format for defining the frequency of a Coordinator instead of the old frequency number/unit.
de: Verwenden Sie das Cron-Format zum Definieren der Frequenz eines Coordinators anstelle der alten Frequenznummer/-einheit.
es: Utilizar el formato de Cron para definir la frecuencia de un coordinator en lugar del número/unidad de frecuencia antiguos.
fr: Utilisez le format Cron pour définir la fréquence d'un coordinator plutôt que l'ancienne fréquence qui était exprimée en nombre/unité.
ja: Coordinator の頻度の定義に、古い頻度数／単位ではなく Cron 形式を使用します。
ko: 기존 주기 수/단위 대신 Coordinator의 주기를 정의하는 데 Cron 형식을 사용합니다.
zh_cn: 使用 Cron 格式而非旧频数/单位来定义 Coordinator 的频率。

source: Flag to enable Oozie backend filtering instead of doing it at the page level in Javascript. Requires Oozie 4.3+.
de: Flag zum Aktivieren des Backend-Filterns von Oozie anstatt auf Seitenebene in JavaScript. Erfordert Oozie 4.3+.
es: Marque para habilitar el filtrado de back-end de Oozie en lugar de hacerlo a nivel de la página en Javascript. Es necesario Oozie 4.3+.
fr: Indicateur permettant d'activer le filtrage du serveur principal Oozie au lieu de faire cela au niveau de la page dans Javascript. Nécessite Oozie 4.3+.
ja: JavaScript のページレベルのフィルタの代わりに、Oozie バックエンドフィルタを有効にするフラグです。Oozie 4.3 以上が必要です。
ko: 페이지 레벨에서 Javascript로 수행하는 대신 Oozie 백엔드 필터링을 허용하는 플래그입니다. Oozie 4.3+이 필요합니다.
zh_cn: 此标记用于启用 Oozie 后端筛选，而不是在 Javascript 的页面级别执行。需要 Oozie 4.3+。

source: Flag to enable the saved Editor queries to be dragged and dropped into a workflow.
de: Flag, das das Ziehen und Ablegen von gespeicherten Editor-Abfragen in einen Workflow aktiviert.
es: Marque para permitir que las consultas guardadas en el Editor se puedan arrastrar y soltar en un workflow.
fr: Drapeau pour activer le glisser-déposer des requêtes enregistrées de l'éditeur dans un workflow.
ja: 保存済みの Editor クエリを Workflow にドラッグアンドドロップできるようにするフラグです。
ko: 저장된 편집기 쿼리를 Workflow에 끌어서 놓도록 허용하는 플래그입니다.
zh_cn: 此标记用于将已保存的编辑器查询拖放到 Workflow 中。

source: Flag to enable the Impala action.
de: Kennzeichnen zur Aktivierung der Impala-Aktion.
es: Marque esta opción para habilitar la acción de Impala.
fr: Indicateur permettant d'activer l’action Impala.
ja: Impala アクションを有効にするフラグです。
ko: Impala 동작을 설정하는 플래그입니다.
zh_cn: 此标记用于启用 Impala 操作。

source: The app won't work without a running Oozie server
de: Die App funktioniert nicht, wenn kein Oozie-Server aktiv ist
es: La aplicación no funcionará sin un servidor Oozie en ejecución
fr: Sans un serveur Oozie en cours d'exécution, l'application ne fonctionnera pas.
ja: 実行中の Oozie Server が存在しない場合、アプリが機能しません
ko: Oozie Server를 실행하지 않으면 이 앱을 사용할 수 없습니다.
zh_cn: Oozie Server 不运行的情况下应用程序不工作

source: Job with %(key)s=%(value)s does not exist
de: Job mit %(key)s=%(value)s ist nicht vorhanden.
es: El job con %(key)s=%(value)s no existe
fr: Le job avec %(key)s=%(value)s n'existe pas
ja: %(key)s=%(value)s のジョブは存在しません
ko: %(key)s=%(value)s인 Job이 존재하지 않음
zh_cn: 具有 %(key)s=%(value)s 的作业不存在

source: Job %(id)s does not exist
de: Job %(id)s ist nicht vorhanden
es: El job %(id)s no existe
fr: Le job %(id)s n'existe pas
ja: ジョブ %(id)s が存在しません
ko: Job %(id)s이(가) 존재하지 않음
zh_cn: 作业 %(id)s 不存在

source: Missing permission to access the Oozie Editor
de: Keine Berechtigung für den Zugriff auf den Oozie-Editor
es: Falta el permiso para acceder al Editor de Oozie
fr: Autorisation manquante pour accéder à l'éditeur Oozie
ja: Oozie Editor にアクセスするパーミッションがありません
ko: Oozie 편집기에 액세스할 권한이 없음
zh_cn: 缺失访问 Oozie 编辑器的权限

source: Local workflow.xml file
de: Lokale workflow.xml-Datei
es: Archivo workflow.xml local
fr: Fichier workflow.xml local
ja: ローカルの workflow.xml ファイル
ko: 로컬 workflow.xml 파일
zh_cn: 本地 workflow.xml 文件

source: Workflow resource archive (zip)
de: Workflow-Ressourcenarchiv (ZIP)
es: Archivo del recurso de workflow (zip)
fr: Archive de ressource du workflow (zip)
ja: Workflow リソースアーカイブ（zip）
ko: Workflow 자원 아카이브(zip)
zh_cn: Workflow 资源存档 (zip)

source: Local coordinator.xml file
de: Lokale coordinator.xml-Datei
es: Archivo coordinator.xml local
fr: Fichier local coordinator.xml
ja: ローカルの coordinator.xml ファイル
ko: 로컬 coordinator.xml 파일
zh_cn: 本地 coordinator.xml 文件

source: Coordinator resource archive (zip)
de: Coordinator-Ressourcenarchiv (ZIP)
es: Archivo del recurso de coordinator (zip)
fr: Archive de ressource du coordinator (zip)
ja: Coordinator リソースアーカイブ（zip）
ko: Coordinator 자원 아카이브(zip)
zh_cn: Coordinator 资源存档 (zip)

source: Used to indicate if user wants to refresh an action's input and output events
de: Hiermit wird angegeben, ob der Benutzer die Ein- und Ausgabeereignisse einer Aktion aktualisieren möchte.
es: Utilizado para indicar si el usuario desea actualizar los eventos de entrada y salida de una acción
fr: Utilisé pour indiquer si l'utilisateur veut actualiser les événements d'entrée et de sortie d'une action
ja: アクションの入出力イベントを更新するかどうかを示すために使用
ko: 작업의 입력 및 출력 이벤트를 새로 고칠 것인지를 표시할 때 사용
zh_cn: 用于指明用户是否想要刷新操作的输入和输出事件

source: Used to indicate if user wants to cleanup output events for given rerun actions
de: Hiermit wird angegeben, ob der Benutzer Ausgabeereignisse für bestimmte Wiederholungsaktionen beenden möchte.
es: Utilizado para indicar si el usuario desea limpiar los eventos de salida para volver a ejecutar unas acciones de determinadas
fr: Utilisé pour indiquer si l'utilisateur veut nettoyer les événements de sortie pour des actions de réexécution données
ja: 特定の再実行アクションに対して、出力イベントのクリーンアップを実行するかどうかを示すために使用
ko: 주어진 다시 실행 작업의 출력 이벤트를 정리할 것인지를 표시할 때 사용
zh_cn: 用于指明用户是否想要清理给定重新运行操作的输出事件

source: Enter a valid value: combination of 2 - 40 letters and digits starting by a letter
de: Geben Sie einen gültigen Wert ein: Kombination aus 2 bis 40 Buchstaben und Ziffern, beginnend mit einem Buchstaben
es: Introducir un valor válido: combinación de 2 - 40 letras y dígitos comenzando por una letra
fr: Entrez une valeur valide, commençant par une lettre et composée de 2 à 40 caractères alphanumériques.
ja: 次の形式で有効な値を入力してください：アルファベットで始まる英数字 2 ～ 40 文字の組み合わせ
ko: 올바른 값을 입력하십시오. 문자로 시작하는 2~40자 길이의 영숫자 조합입니다.
zh_cn: 请输入有效值：以字母开头的 2 - 40 个字母和数字的组合

source: Permission denied. %(username)s does not have the permissions required to access job %(id)s
de: Zugriff verweigert. Als %(username)s verfügen Sie nicht über die Berechtigung, auf Job %(id)s zuzugreifen.
es: Permiso denegado. %(username)s no tiene permisos para acceder al job %(id)s
fr: Autorisation refusée. %(username)s n'a pas l'autorisation requise pour accéder au job %(id)s
ja: パーミッションにより、拒否されました。%(username)s はジョブ %(id)s へのアクセスに必要なパーミッションがありません
ko: 권한이 거부되었습니다. %(username)s(은)는 %(id)s Job에 액세스하는 데 필요한 권한이 없습니다.
zh_cn: 权限被拒绝。%(username)s 不具备访问作业 %(id)s 所需的权限

source: job %(id)s does not exist
de: Job %(id)s ist nicht vorhanden
es: El job %(id)s no existe
fr: le job %(id)s n'existe pas
ja: ジョブ %(id)s が存在しません
ko: Job %(id)s이(가) 없음
zh_cn: 作业 %(id)s 不存在

source: Not allowed to modified this job
de: Keine Erlaubnis zur Änderung dieses Jobs
es: No está permitido modificar este trabajo
fr: Vous n'êtes pas autorisé à modifier ce job
ja: このジョブの変更は許可されません
ko: 이 Job을 수정할 수 없습니다.
zh_cn: 禁止修改此作业

source: Owner
de: Eigentümer
es: Propietario
fr: Propriétaire
ja: 所有者
ko: 소유자
zh_cn: 所有者

source: Person who can modify the job.
de: Person, die den Job ändern kann.
es: La persona que puede modificar el trabajo.
fr: Personne en mesure de modifier le job.
ja: ジョブを変更できるユーザー。
ko: Job을 수정할 수 있는 사람입니다.
zh_cn: 可修改该作业的人员。

source: Name of the job, which must be unique per user.
de: Name des Jobs, der für jeden Benutzer eindeutig sein muss.
es: Nombre del diseño, que debe ser único para cada usuario.
fr: Nom du job, devant être unique pour chaque utilisateur.
ja: ジョブの名前。ユーザーごとに一意にする必要があります。
ko: Job 이름으로, 사용자마다 고유해야 합니다.
zh_cn: 作业名称，每个用户的作业名称必须具有唯一性。

source: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
zh_cn: 名称

source: Description
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
zh_cn: 描述

source: The purpose of the job.
de: Der Zweck des Jobs.
es: Propósito del trabajo.
fr: Objectif du job.
ja: ジョブの目的です。
ko: Job의 목적입니다.
zh_cn: 作业目的。

source: Last modified
de: Zuletzt geändert
es: Última modificación
fr: Dernière modification
ja: 前回の変更
ko: 최종 수정 날짜
zh_cn: 上次修改

source: Schema version
es: Versión del esquema
fr: Version du schéma
ja: スキーマバージョン
ko: 스키마 버전
zh_cn: 架构版本

source: The version of the XML schema used to talk to Oozie.
de: Die Version des XML-Schemas, das für die Kommunikation mit Oozie verwendet wird.
es: La versión del esquema XML que se utiliza para comunicarse con Oozie.
fr: Version du schéma XML utilisé pour communiquer avec Oozie.
ja: Oozie との通信に使用された XML スキーマのバージョンです。
ko: Oozie와 대화하는 데 사용되는 XML 스키마 버전입니다.
zh_cn: 用于与 Oozie 通信的 XML 架构版本。

source: HDFS deployment directory
de: HDFS-Bereitstellungsverzeichnis
es: Directorio de implementación HDFS
fr: Répertoire de déploiement HDFS
ja: HDFS 配置ディレクトリ
ko: HDFS 배포 디렉토리
zh_cn: HDFS 部署目录

source: The path on the HDFS where all the workflows and dependencies must be uploaded.
de: Der Pfad auf HDFS, in den alle Workflows und Abhängigkeiten hochgeladen werden müssen.
es: La ruta en HDFS en la que se deben cargar todos los workflows y dependencias.
fr: Chemin sur HDFS où tous les workflows et dépendances doivent être envoyés.
ja: すべての Workflow と依存関係がアップロードされている必要がある HDFS 上のパス。
ko: 모든 workflow와 종속성이 업로드되어야 할 HDFS 상의 경로입니다.
zh_cn: HDFS 中所有 workflow 和附属物的上传路径。

source: Is shared
de: Ist freigegeben
es: Se ha compartido
fr: Est partagé
ja: 共有される
ko: 공유됨
zh_cn: 已共享

source: Enable other users to have access to this job.
de: Gewähren Sie anderen Benutzern Zugriff auf diesen Job.
es: Active la opción de que otros usuarios tengan acceso a este trabajo.
fr: Autorisez d'autres utilisateurs à accéder à ce job.
ja: このジョブにアクセスすることを他のユーザーに許可します。
ko: 다른 사용자가 이 Job에 액세스할 수 있도록 설정합니다.
zh_cn: 使其他用户能够访问此作业。

source: Oozie parameters
de: Oozie-Parameter
es: Parámetros Oozie
fr: Paramètres Oozie
ja: Oozie パラメータ
ko: Oozie 매개변수
zh_cn: Oozie 参数

source: Parameters used at the submission time (e.g. market=US, oozie.use.system.libpath=true).
de: Parameter, die bei der Übermittlung verwendet werden (z. B. market=US, oozie.use.system.libpath=true).
es: Parámetros utilizados en la hora de envío (p. ej., market=US, oozie.use.system.libpath=true).
fr: Paramètres utilisés lors de l'envoi (par exemple, marché=US, oozie.use.system.libpath=true).
ja: サブミッション時に使用されるパラメータです（例：market=US、oozie.use.system.libpath=true）。
ko: 제출 시 사용되는 매개변수입니다(예: market=US, oozie.use.system.libpath=true).
zh_cn: 提交时间中所用的参数（例如，市场=美国，oozie.use.system.libpath=真）。

source: Is trashed
de: In den Papierkorb verschoben
es: Se ha enviado a la papelera
fr: Placé dans la corbeille
ja: ゴミ箱に移動済み
ko: 휴지통으로 이동됨
zh_cn: 已移至垃圾桶

source: If this job is trashed.
de: Wenn dieser Job gelöscht wurde.
es: Si este trabajo se ha enviado a la papelera.
fr: Si ce job est placé dans la corbeille.
ja: このジョブがゴミ箱に移動された場合。
ko: 이 작업을 휴지통으로 이동한 경우
zh_cn: 如果此作业移至垃圾桶。

source: shared
de: freigegeben
es: compartido
fr: partagé
ja: 共有
ko: 공유됨
zh_cn: 已共享

source: personal
de: Persönlich
fr: personnel
ja: 個人用
ko: 개인
zh_cn: 个人

source: Job XML
es: Trabajo XML
fr: Fichier XML du job
ja: ジョブ XML
zh_cn: 作业 XML

source: Refer to a Hadoop JobConf job.xml file bundled in the workflow deployment directory. Properties specified in the Job Properties element override properties specified in the files specified in the Job XML element.
de: Verweisen Sie auf eine Hadoop JobConf job.xml-Datei, die im Workflow-Bereitstellungsverzeichnis gebündelt ist. Die im Jobeigenschaften-Element angegebenen Eigenschaften überschreiben die in den vom Job-XML-Element angegebenen Dateien angegebenen Eigenschaften.
es: Consulte un archivo Hadoop JobConf job.xml integrado en el directorio de implementación de workflow. Las propiedades especificadas en el elemento Propiedades del trabajo reemplazan a las propiedades especificadas en los archivos especificados en el elemento de trabajo XML.
fr: Référez-vous à un fichier job.xml JobConf de Hadoop situé dans le répertoire de déploiement du workflow. Les propriétés spécifiées dans l'élément de Propriétés du job remplace les propriétés spécifiées dans l'élément Fichier XML du job.
ja: Workflow 配置ディレクトリにバンドルされている Hadoop JobConf job.xml ファイルを参照してください。ジョブのプロパティの要素で指定されたプロパティは、ジョブ XML の要素によって指定されたファイルで指定したプロパティをオーバーライドします。
ko: workflow 배포 디렉토리에 포함된 Hadoop JobConf job.xml 파일을 참조하십시오. 작업 속성에 지정된 속성이 모든 작업 XML 요소에 지정된 파일의 속성을 재정의합니다.
zh_cn: 请参考 workflow 部署目录中包含的 Hadoop JobConf job.xml 文件。作业属性元素中指定的属性优于作业 XML 元素指定文件中指定的属性。

source: Hadoop job properties
de: Hadoop-Jobeigenschaften
es: Propiedades de trabajos de Hadoop
fr: Propriétés du job Hadoop
ja: Hadoop ジョブプロパティ
ko: Hadoop Job 속성
zh_cn: Hadoop 作业属性

source: Job configuration properties used by all the actions of the workflow (e.g. mapred.job.queue.name=production)
de: Eigenschaften der Jobkonfiguration, die von allen Aktionen des Workflows verwendet werden (z. B. mapred.job.queue.name=production)
es: Las propiedades de configuración del trabajo que se utilizan por todas las acciones del workflow (p. ej., mapred.job.queue.name=production)
fr: Propriétés de configuration du job utilisées pour l'ensemble des actions du flux de travail (par exemple, mapred.job.queue.name=production)
ja: Workflow のすべてのアクションによって使用されるジョブ設定プロパティ (例：mapred.job.queue.name=production)
ko: workflow의 모든 작업이 사용하는 Job 구성 속성(예: mapred.job.queue.name=production)
zh_cn: workflow 的所有操作使用的作业配置属性（如 mapred.job.queue.name=production）

source: The copy of the deployment directory failed: %s.
de: Kopieren des Bereitstellungsverzeichnisses fehlgeschlagen: %s.
es: Error al copiar el directorio de implementación: %s.
fr: Echec de la copie du répertoire de déploiement : %s.
ja: 配置ディレクトリのコピーに失敗しました：%s。
ko: 배포 디렉토리 복사 실패: %s
zh_cn: 无法复制部署目录：%s。

source: Name of the action, which must be unique by workflow.
de: Name der Aktion, der für den Workflow eindeutig sein muss.
es: Nombre de la acción, que deber ser único por workflow.
fr: Nom de l'action, qui doit être unique pour chaque workflow.
ja: アクションの名前です。Workflow 単位で一意にする必要があります。
ko: 동작 이름으로, workflow별로 고유해야 합니다.
zh_cn: 操作名称，每个 workflow 的操作名称必须唯一。

source: The purpose of the action.
de: Der Zweck dieser Aktion.
es: Propósito de la acción.
fr: Objet de l'action.
ja: アクションの目的です。
ko: 동작의 목적입니다.
zh_cn: 操作目的。

source: Type
de: Typ
es: Tipo
ja: タイプ
ko: 유형
zh_cn: 类型

source: The type of action (e.g. MapReduce, Pig...)
de: Aktionstyp (z. B. MapReduce, Pig...)
es: El tipo de acción (p. ej., MapReduce, Pig...)
fr: Type d'action (MapReduce, Pig, etc.)
ja: アクションのタイプ (例：MapReduce、Pig...)
ko: 작업 유형(예: MapReduce, Pig...)
zh_cn: 操作类型（如 MapReduce, Pig...）

source: Unknown Node type: %s. Was it set at its creation?
de: Unbekannter Node-Typ: %s. Wurde er bei seiner Erstellung festgelegt?
es: Tipo de nodo desconocido: %s. ¿Se ha configurado en su creación?
fr: Type de nœud inconnu : %s. A-t-il été défini lors de sa création ?
ja: 不明なノード タイプ：%s。作成時に設定されましたか?
ko: %s의 노드 유형을 알 수 없습니다. 생성 시에 설정되었습니까?
zh_cn: 未知节点类型：%s。是否在创建节点时设置？

source: %(node_type)s has not implemented the 'add_node' method.
de: In %(node_type)s ist die Methode 'add_node' nicht implementiert.
es: %(node_type)s no ha implementado el método 'add_node'.
fr: Le noeud %(node_type)s n'a pas mis en oeuvre la méthode "add_node".
ja: %(node_type)s は 'add_node' メソッドを実装しませんでした。
ko: %(node_type)s은(는) 'add_node' 메소드를 구현하지 않습니다.
zh_cn: %(node_type)s 未实施“add_node”方法。

source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
ko: 파일
zh_cn: 文件

source: List of names or paths of files to be added to the distributed cache and the task running directory.
de: Liste von Namen oder Pfaden von Dateien, die zum verteilten Cache und Verzeichnis der ausgeführten Aufgabe hinzugefügt werden sollen.
es: Lista de nombres o rutas de archivos que se van a agregar a la caché distribuida y al directorio que ejecuta la tarea.
fr: Liste des noms ou chemins de fichiers à ajouter au cache distribué et au répertoire d'exécution de la tâche.
ja: 分散キャッシュおよびタスク実行ディレクトリに追加されるファイルの名前またはパスのリストです。
ko: 분산된 캐시 및 태스크 실행 디렉토리에 추가할 파일 이름 또는 경로의 목록입니다.
zh_cn: 要添加到分布式缓存和任务运行目录的文件名称或路径列表。

source: Archives
de: Archive
es: Almacenamientos
ja: アーカイブ
ko: 아카이브
zh_cn: 存档

source: List of names or paths of the archives to be added to the distributed cache.
de: Liste von Pfaden zu Archiven, die dem verteilten Cache hinzuzufügen sind.
es: Lista de nombres o rutas de almacenamientos que se van a agregar a la caché distribuida.
fr: Liste de noms ou de chemins aux archives à ajouter au cache distribué.
ja: 分散キャッシュに追加されるアーカイブの名前またはパスのリストです。
ko: 분산 캐시에 추가할 아카이브의 이름 또는 경로의 목록입니다.
zh_cn: 要添加到分布式缓存的存档的名称或路径列表。

source: For the job configuration (e.g. mapred.job.queue.name=production)
de: Für die Job-Konfiguration (z.B. mapred.job.queue.name=production)
es: Para la configuración del trabajo (p. ej., mapred.job.queue.name=production)
fr: Pour la configuration du job (par exemple, mapred.job.queue.name=production)
ja: ジョブ設定用 (例：mapred.job.queue.name=production)
ko: 작업 구성용(예: mapred.job.queue.name=production)
zh_cn: 对于作业配置（如 mapred.job.queue.name=production）

source: Jar name
es: Nombre jar
fr: Nom du fichier Jar
ja: Jar 名
ko: Jar 이름
zh_cn: Jar 名称

source: Name or path to the %(program)s jar file on HDFS. E.g. examples.jar.
de: Name oder Pfad der %(program)s-JAR-Datei auf dem HDFS, z. B. examples.jar.
es: Nombre o ruta del archivo jar %(program)s de HDFS. Por ejemplo: examples.jar.
fr: Nom ou chemin du fichier Jar de %(program)s sur HDFS. Par exemple, examples.jar.
ja: HDFS 上の %(program)s jar ファイルの名前またはパスです（例：examples.jar）。
ko: HDFS상의 %(program)s jar 파일의 이름 또는 경로입니다(예: examples.jar).
zh_cn: HDFS 上 %(program)s jar 文件的名称或路径。例如示例 jar。

source: Prepares
de: Vorbereitungen
es: Prepara
fr: Prépare
ja: 準備する
ko: 준비
zh_cn: 准备

source: List of absolute paths to delete and then to create before starting the application. This should be used exclusively for directory cleanup.
de: Liste von absoluten Pfaden, die vor dem Starten der Anwendung gelöscht und dann erstellt werden sollen. Dies sollte ausschließlich für die Verzeichnisbereinigung verwendet werden.
es: Lista de rutas absolutas para eliminar y, a continuación, para crear antes de arrancar la aplicación. Se debería utilizar exclusivamente para limpiar el directorio.
fr: Liste des chemins absolus à supprimer puis à créer avant le démarrage de l'application. A n'utiliser que pour le nettoyage des répertoires.
ja: アプリケーションを開始する前に削除して作成する絶対パスのリストです。これはディレクトリのクリーンアップのためにのみ使用してください。
ko: 애플리케이션을 시작하기 전에 삭제한 다음 생성해야 할 절대 경로 목록입니다. 이는 디렉토리 정리 시에만 사용해야 합니다.
zh_cn: 启用应用程序之前应删除并创建的绝对路径列表。这仅适用于目录清理。

source: The executable/script to be used as mapper.
de: Die ausführbare Datei/das ausführbare Skript, die/das als Mapper verwendet werden soll.
es: El ejecutable/secuencia de comandos que se va a utilizar como mapper.
fr: Exécutable/Script à utiliser comme mapper.
ja: mapper として使用する実行可能ファイル／スクリプトです。
ko: Mapper로 사용할 실행 파일/스크립트입니다.
zh_cn: 用作 mapper 的可执行文件/脚本。

source: The executable/script to be used as reducer.
de: Die ausführbare Datei/das Skript, die/das als Reducer verwendet werden soll.
es: El ejecutable/secuencia de comandos que se va a utilizar como reducer.
fr: Exécutable/Script à utiliser comme reducer.
ja: reducer として使用する実行可能ファイル／スクリプトです。
ko: Reducer로 사용할 실행 파일/스크립트입니다.
zh_cn: 用作 reducer 的可执行文件/脚本。

source: Full name of the Java class. E.g. org.apache.hadoop.examples.Grep
de: Vollständiger Name der Java-Klasse, z. B. org.apache.hadoop.examples.Grep
es: Nombre completo de la clase Java. P. ej., org.apache.hadoop.examples.Grep
fr: Nom complet de la classe Java (par exemple, org.apache.hadoop.examples.Grep)
ja: Java クラスの完全な名前です（例：org.apache.hadoop.examples.Grep）。
ko: Java 클래스의 전체 이름(예: org.apache.hadoop.examples.Grep)
zh_cn: Java 类的全名。如 org.apache.hadoop.examples.Grep

source: Arguments
de: Argumente
es: Argumentos
ja: 引数
ko: 인수
zh_cn: 参数

source: Arguments of the main method. The value of each arg element is considered a single argument and they are passed to the main method in the same order.
de: Argumente der Hauptmethode. Der Wert jedes arg-Elements wird als ein einzelnes Argument betrachtet, und sie werden in derselben Reihenfolge an die Hauptmethode übergeben.
es: Argumentos del método principal. El valor de cada elemento de argumento se considera un argumento único y todos se pasan al método principal en el mismo orden.
fr: Arguments de la méthode principale. La valeur de chaque élément arg est considérée comme un argument simple. Les arguments sont transmis à la méthode principale dans le même ordre.
ja: メインメソッドの引数です。各 arg 要素の値は単一の引数と見なされ、メインメソッドに同じ順序で渡されます。
ko: Main 메서드의 인수입니다. 각 인수 요소의 값은 단일 인수로 간주되고 동일한 순서로 Main 메서드에 전달됩니다.
zh_cn: 主方法的参数。每个参数元素的值被视为单个参数，并以相同的顺序传递到主方法。
