Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Days
de: Tage
es: Días
fr: Jours
ja: 日
ko: 일
zh_cn: 日

source: Months
de: Monate
es: Meses
fr: Mois
ja: か月
ko: 월
zh_cn: 月

source: Frequency number
de: Häufigkeitsnummer
es: Número de frecuencia
fr: Numéro de fréquence
ja: 頻度数
ko: 주기 수
zh_cn: 频数

source: The number of units of the rate at which data is periodically created.
de: Die Anzahl von Einheiten der Häufigkeit, mit der Daten periodisch erstellt werden.
es: El número de unidades de la velocidad a la que se crean los datos periódicamente.
fr: Nombre d'unités de la périodicité à laquelle les données sont créées.
ja: 定期的なデータの作成率の単位数です。
ko: 데이터가 주기적으로 생성되는 속도 단위의 수입니다.
zh_cn: 定期创建数据的速率的单位数量。

source: Frequency unit
de: Einheit der Häufigkeit
es: Unidad de frecuencia
fr: Unité de fréquence
ja: 頻度単位
ko: 주기 단위
zh_cn: 速率单位

source: The unit of the rate at which data is periodically created.
de: Die Einheit der Häufigkeit, mit der Daten periodisch erstellt werden.
es: La unidad de la velocidad a la que se crean los datos periódicamente.
fr: Unité de la périodicité à laquelle les données sont créées.
ja: 定期的なデータの作成率の単位です。
ko: 주기적으로 데이터가 생성되는 비율의 단위입니다.
zh_cn: 定期创建数据的速率的单位。

source: Timezone
de: Zeitzone
es: Franja horaria
fr: Fuseau horaire
ja: タイムゾーン
ko: 시간대
zh_cn: 时区

source: The timezone of the coordinator. Only used for managing the daylight saving time changes when combining several coordinators.
de: Die Zeitzone des Coordinators. Sie wird nur zum Verwalten der Änderungen von Sommer- und Winterzeit verwendet, wenn mehrere Coordinators kombiniert werden.
es: La franja horaria del coordinator. Solo se utiliza para gestionar los cambios en el tiempo de ahorro de luz solar al combinar varios coordinators.
fr: Fuseau horaire du coordinator. Uniquement utilisé pour la gestion des changements d'heure d'été/hiver lorsque plusieurs coordinators sont associés.
ja: Coordinator のタイムゾーンです。複数の Coordinator を組み合わせる場合の夏時間の変更管理にのみ使用します。
ko: Coordinator의 시간대입니다. 여러 개의 Coordinator를 조합할 때 일광 절약 시간 변경을 관리하는 데에만 사용됩니다.
zh_cn: Coordinator 的时区。与几个 Coordinator 结合使用时，仅用于管理夏令时更改。

source: Start
es: Iniciar
fr: Début
ja: 開始
ko: 시작
zh_cn: 开始

source: When to start the first workflow.
de: Wann der erste Workflow gestartet wird.
es: Cuándo empezar el primer workflow.
fr: Heure de démarrage du premier workflow.
ja: 最初の Workflow を開始する日時です。
ko: 처음 워workflow를 시작하는 시간입니다.
zh_cn: 何时开始第一个 workflow。

source: End
de: Ende
es: Finalización
fr: Fin
ja: 終了
ko: 종료
zh_cn: 结束

source: When to start the last workflow.
de: Wann der letzte Workflow gestartet wird.
es: Cuándo empezar el último workflow.
fr: Heure de démarrage du dernier workflow.
ja: 最後の Workflow を開始する日時です。
ko: 마지막 workflow를 시작하는 시간입니다.
zh_cn: 何时开始最后一个 workflow。

source: The workflow to schedule repeatedly.
de: Der Workflow, der wiederholt geplant werden soll.
es: Workflow para programar de forma repetida.
fr: Workflow à planifier de manière répétitive.
ja: 繰り返しスケジュール設定される Workflow です。
ko: 반복 일정을 수립할 workflow입니다.
zh_cn: 用于重复计划的 workflow。

source: Timeout
es: Tiempo de espera
fr: Temporisation
ja: タイムアウト
ko: 시간 제한
zh_cn: 超时

source: Number of minutes the coordinator action will be in WAITING or READY status before giving up on its execution.
de: Angabe in Minuten, wie lange die Coordinator-Aktion im Status WAITING oder READY bleibt, bevor ihre Ausführung aufgegeben wird.
es: Número de minutos que la acción del coordinator estará en estado WAITING o READY antes de abandonarse su ejecución.
fr: Durée en minutes pendant laquelle l'action de coordinator présente l'état WAITING ou READY avant l'abandon de son exécution.
ja: Coordinator アクションを WAITING または READY ステータスにしておく時間（単位は分）の上限です。指定された時間が経過すると、実行されません。
ko: Coordinator 동작이 실행을 포기하기까지 WAITING 또는 READY 상태로 있는 시간(분)입니다.
zh_cn: 放弃 Coordinator 操作执行前，Coordinator 操作将处于 WATTING 或 READY 状态的分钟数。

source: Concurrency
de: Nebenläufigkeit
es: Simultaneidad
fr: Simultanéité
ja: 同時実行
ko: 동시성
zh_cn: 并发

source: The number of coordinator actions that are allowed to run concurrently (RUNNING status) before the coordinator engine starts throttling them.
de: Die Zahl der Coordinator-Aktionen, die gleichzeitig ausgeführt werden können (mit dem Status RUNNING), bevor die Coordinator-Engine beginnt, sie zu drosseln.
es: Número de acciones del coordinator que se permiten ejecutar simultáneamente (estado EN EJECUCIÓN) antes de que el motor del coordinator empiece a limitarlas.
fr: Nombre d'actions de coordinator pouvant s'exécuter simultanément (état EXECUTION) avant que le moteur du coordinator ne commence à les limiter.
ja: 同時に実行（RUNNING ステータスに）できる Coordinator アクションの最大数です。上限を超えると、Coordinator エンジンにより、アクションのスロットルが開始されます。
ko: Coordinator 엔진이 제한을 시작하기 전에 동시에 실행할 수 있는(실행 상태) Coordinator 동작의 수입니다.
zh_cn: Coordinator 引擎开始限制前，允许同时运行的 Coordinator 操作（RUNNING（运行）状态）的数量。

source: Execution
de: Ausführung
es: Ejecución
fr: Exécution
ja: 実行
ko: 실행
zh_cn: 执行

source: FIFO (oldest first) default
de: FIFO-Standardwert (Älteste zuerst)
es: FIFO (más antiguas primero) predeterminado
fr: FIFO (le plus ancien d'abord) par défaut
ja: FIFO（最も古いものを先に実行）デフォルト
ko: FIFO(오래된 것 먼저) 기본값
zh_cn: FIFO（先进先出）默认值

source: LIFO (newest first)
de: LIFO (Neueste zuerst)
es: LIFO (más nuevas primero)
fr: LIFO (le plus récent d'abord)
ja: LIFO（最も新しいものを先に実行）
ko: LIFO(최신 것 먼저)
zh_cn: LIFO（后进先出）

source: LAST_ONLY (discards all older materializations)
de: LAST_ONLY (verwirft alle älteren Materialisierungen)
es: LAST_ONLY (descartar todas las materializaciones antiguas)
fr: LAST_ONLY (ignore les matérialisations plus anciennes)
ja: LAST_ONLY（古い実体化をすべて破棄）
ko: LAST_ONLY(이전 구체화 모두 버리기)
zh_cn: LAST_ONLY（放弃所有更早的具体化）

source: Execution strategy of its coordinator actions when there is backlog of coordinator actions in the coordinator engine. The different execution strategies are 'oldest first', 'newest first' and 'last one only'. A backlog normally happens because of delayed input data, concurrency control or because manual re-runs of coordinator jobs.
de: Ausführungsstrategie der Coordinator-Aktionen, wenn in der Coordinator-Engine ein Rückstand von Coordinator-Aktionen auftritt. Die verschiedenen Ausführungsstrategien sind 'Älteste zuerst', 'Neueste zuerst' und 'Nur letzte'. Ein Rückstand tritt normalerweise aufgrund von verzögerten Eingabedaten, Nebenläufigkeitssteuerung oder manueller erneuter Ausführungen von Coordinator-Jobs auf.
es: Estrategia de ejecución de las acciones del coordinator cuando hay un trabajo pendiente de las acciones del motor del coordinator. Las distintas estrategias de ejecución son "más antiguas primero", "más nuevas primero" y "sólo última". Un trabajo pendiente ocurre normalmente a causa de los datos de entrada retrasados, el control de simultaneidad o por la repetición de ejecuciones manuales de los trabajos del coordinator.
fr: Stratégie d'exécution de ses actions coordinator lorsque le moteur du coordinator contient une accumulation d'actions de ce type. Les stratégies d'exécution sont "le plus ancien d'abord", "le plus récent d'abord" et "le dernier seulement". Une accumulation se produit en raison de retards de données d'entrée, du contrôle de simultanéité ou de réexécutions manuelles de travaux du coordinator.
ja: Coordinator エンジンに Coordinator アクションのバックログがある場合の、Coordinator アクションの実行戦略です。指定可能な実行戦略は、「最も古いものを先に実行」、「最も新しいものを先に実行」、および「最後のものだけを実行」です。バックログは通常、入力データの遅延、同時実行制御、または Coordinator ジョブの手動による再実行が原因で起こります。
ko: Coordinator 엔진에 Coordinator 동작의 백로그가 있을 때 Coordinator 동작의 실행 전략입니다. 다른 실행 전략은 '오래된 것 먼저', '최신 것 먼저' 및 '마지막 것만'입니다. 백로그는 일반적으로 입력 데이터 지연, 동시성 제어 또는 Coordinator 작업의 수동 재실행 때문에 발생합니다.
zh_cn: coordinator 引擎中有 coordinator 操作的积压工作时，coordinator 操作的执行策略。不同的执行策略为 “先进先出”、“后进先出” 和 “仅最后一个”。积压工作通常由于延迟的输入数据、并发控制，或由于 coordinator 作业的手动重新运行而发生。

source: Throttle
de: Drosseln
es: Limitación
fr: Limite
ja: スロットル
ko: 스로틀
zh_cn: 限制

source: The materialization or creation throttle value for its coordinator actions. Number of maximum coordinator actions that are allowed to be in WAITING state concurrently.
de: Die Materialisierung oder Erstellung eines Drosselwerts für die Coordinator-Aktionen. Die maximale Zahl der Coordinator-Aktionen, die gleichzeitig im Status WAITING sein können.
es: Valor de limitación de la materialización o creación de las acciones de su coordinator. Número máximo de acciones del coordinator permitidas para estar simultáneamente en estado EN ESPERA.
fr: Valeur de la limite de création ou de matérialisation pour les actions de coordinator. Nombre maximal d'actions de coordinator autorisées à présenter l'état EN ATTENTE simultanément.
ja: Coordinator アクションに対する実体化または作成スロットル値です。同時に WAITING 状態にできる Coordinator アクションの最大数を表しています。
ko: Coordinator 동작의 스로틀 값을 구체화 또는 생성합니다. 동시에 대기 상태에 있을 수 있는 Coordinator 동작의 최대 개수입니다.
zh_cn: 相应 Coordinator 操作的具体化或创建限制值。允许同时处于 WAITING（等待）状态的 Coordinator 操作的最大数量。

source: Workflow properties
de: Workflow-Eigenschaften
es: Propiedades del workflow
fr: Propriétés du workflow
ja: Workflow のプロパティ
ko: Workflow 속성
zh_cn: Workflow 属性

source: Additional properties to transmit to the workflow, e.g. limit=100, and EL functions, e.g. username=${coord:user()}
de: Weitere Eigenschaften zum Übertragen an den Workflow, z. B. limit=100 und EL-Funktionen, z. B. username=${coord:user()}
es: Propiedades adicionales para transmitir al workflow, p. ej., limit=100, y funciones EL, p. ej., username=${coord:user()}
fr: Propriétés supplémentaires à transmettre au workflow, par ex. limite=100, et fonctions EL, par ex. nom d'utilisateur=${coord:user()}
ja: Workflow に送信するその他のプロパティ（例：limit=100）、および EL 関数（例：username=${coord:user()}）
ko: Workflow 및 EL 함수에 전송할 추가 속성입니다(예: limit=100 및 username=${coord:user()}).
zh_cn: 要传输到 Workflow 的其他属性，如 limit=100 以及 EL 函数，如 username=${coord:user()}

source: Every 15 minutes
de: Alle 15 Minuten
es: Cada 15 minutos
fr: Toutes les 15 minutes
ja: 15 分ごと
ko: 매15분
zh_cn: 每 15 分钟

source: Every 30 minutes
de: Alle 30 Minuten
es: Cada 30 minutos
fr: Toutes les 30 minutes
ja: 30 分ごと
ko: 매30분
zh_cn: 每 30 分钟

source: Every hour
de: Jede Stunde
es: Cada hora
fr: Toutes les heures
ja: 毎時間
ko: 매시간
zh_cn: 每小时

source: Every day
de: Jeden Tag
es: Todos los días
fr: Tous les jours
ja: 毎日
ko: 매일
zh_cn: 每天

source: Every week
de: Jede Woche
es: Cada semana
fr: Toutes les semaines
ja: 毎週
ko: 매주
zh_cn: 每周

source: Every month
de: Jeden Monat
es: Cada mes
fr: Tous les mois
ja: 毎月
ko: 매월
zh_cn: 每月

source: Every year
de: Jedes Jahr
es: Cada año
fr: Tous les ans
ja: 毎年
ko: 매년
zh_cn: 每年

source: Permission denied. %(username)s does not have the permissions to access dataset %(id)s.
de: Genehmigung verweigert. Als %(username)s verfügen Sie nicht über die Berechtigung, auf den Datensatz %(id)s zuzugreifen.
es: Permiso denegado. %(username)s no tiene permisos para acceder al dataset %(id)s.
fr: Autorisation refusée. %(username)s n'a pas l'autorisation d'accéder au dataset %(id)s.
ja: パーミッションが拒否されました。%(username)s は、データセット %(id)s にアクセスするパーミッションを持っていません。
ko: 권한이 거부되었습니다. %(username)s(은)는 %(id)s Dataset에 액세스할 권한이 없습니다.
zh_cn: 权限被拒绝。%(username)s 不具备访问数据集 %(id)s 的权限。

source: dataset %(id)s not exist
de: Dataset %(id)s ist nicht vorhanden
es: El conjunto de datos %(id)s no existe
fr: le dataset %(id)s n'existe pas
ja: Dataset %(id)s が存在しません
ko: Dataset %(id)s이(가) 없음
zh_cn: 数据集 %(id)s 不存在

source: The name of the dataset.
de: Der Name des Datensatzes.
es: Nombre del dataset.
fr: Nom du dataset.
ja: データセットの名前です。
ko: Dataset의 이름입니다.
zh_cn: Dataset 的名称。

source: A description of the dataset.
de: Eine Beschreibung des Datensatzes.
es: Descripción del conjunto de datos.
fr: Description du dataset.
ja: データセットの説明です。
ko: Dataset의 설명입니다.
zh_cn: 数据集的描述。

source: The UTC datetime of the initial instance of the dataset. The initial instance also provides the baseline datetime to compute instances of the dataset using multiples of the frequency.
de: Die UTC-Zeit der ersten Instanz des Datensatzes. Die erste Instanz bietet auch die Basiszeit zur Verarbeitung der Instanzen des Datensatzes unter Verwendung von Vielfachen der Frequenz.
es: La hora y fecha UTC de la instancia inicial del conjunto de datos. La instancia inicial también ofrece la hora y fecha de línea de base para computar las instancias del conjunto de datos utilizando múltiplos de la frecuencia.
fr: Horodatage UTC de l'instance initiale du dataset. L'instance initiale fournit également l'horodatage de référence pour calculer les instances du dataset à l'aide de multiples de la fréquence.
ja: データセットの初期インスタンスの UTC 日時です。初期インスタンスは、頻度の倍数を使用してデータセットのインスタンスを計算するときのベースライン日時にもなります。
ko: Dataset의 UTC DateTime 초기 인스턴스입니다. 이 초기 인스턴스는 주기의 배수를 사용하여 Dataset의 인스턴스를 계산하는 기준 날짜 및 시간이기도 합니다.
zh_cn: 数据集初始实例的 UTC 日期/时间。初始实例还提供基线日期/时间，以使用频率的倍数计算数据集的实例。

source: The URI template that identifies the dataset and can be resolved into concrete URIs to identify a particular dataset instance. The URI consist of constants (e.g. ${YEAR}/${MONTH}) and configuration properties (e.g. /home/${USER}/projects/${PROJECT})
de: Die URI-Vorlage, durch die der Datensatz bestimmt wird und der in konkrete URIs aufgelöst werden kann, um eine bestimmte Datensatzinstanz zu bestimmen. Die URI besteht aus Konstanten (z.B. ${YEAR}/${MONTH}) und Konfigurationseigenschaften (z.B. /home/${USER}/projects/${PROJECT})
es: La plantilla URI que identifica el dataset y que puede resolverse en un URI concreto para identificar una instancia de dataset determinada. El URI está formado por constantes (p. ej. ${YEAR}/${MONTH}) y propiedades de configuración (p. ej. /home/${USER}/projects/${PROJECT})
fr: Modèle URI qui identifie le dataset et qui peut être résolu en URI réelles afin d'identifier une instance de dataset en particulier. L'URI se compose de constantes (par exemple, ${YEAR}/${MONTH}) et de propriétés de configuration (par exemple, /home/${USER}/projects/${PROJECT})
ja: データセットを識別し、特定のデータセットインスタンスを特定する具体的な URI に解決できる URI テンプレートです。URI は定数（例：${YEAR}/${MONTH}）と設定プロパティ（例：/home/${USER}/projects/${PROJECT}）で構成されます。
ko: Dateset를 식별하고 특정 dataset 인스턴스를 식별하기 위해 실제 URI로 확인할 수 있는 URI 템플릿입니다. URI는 상수(예: ${YEAR}/${MONTH}) 및 구성 속성(예: /home/${USER}/projects/${PROJECT})으로 구성됩니다.
zh_cn: URI 模板可标识 dataset，并且可解析为具体的 URI 来标识特定 dataset 实例。URI 包含常量（例如，${YEAR}/${MONTH}）和配置属性（例如，/home/${USER}/projects/${PROJECT}）

source: The timezone of the dataset. Only used for managing the daylight saving time changes when combining several datasets.
de: Die Zeitzone des Datensatzes. Wird nur zum Verwalten der Änderungen von Sommer- und Winterzeit beim Kombinieren mehrerer Datensätze verwendet.
es: La franja horaria del coordinator. Solo se utiliza para gestionar los cambios en el tiempo de ahorro de luz solar al combinar varios datasets.
fr: Fuseau horaire du dataset. Uniquement utilisé pour la gestion des changements d'heure d'été/hiver lorsque plusieurs datasets sont associés.
ja: データセットのタイムゾーンです。複数のデータセットを組み合わせる場合の夏時間の変更管理にのみ使用します。
ko: Dataset의 시간대입니다. 여러 개의 Dataset를 조합할 때 일광 절약 시간 변경을 관리하는 데에만 사용됩니다.
zh_cn: 数据集的时区。与几个数据集结合使用时，仅用于管理夏令时更改。

source: Done flag
de: Markierung "Fertig"
es: Marca de finalización
fr: Drapeau Terminé
ja: 完了フラグ
ko: 완료 플래그
zh_cn: 完成标记

source: The done file for the data set. If the Done flag is not specified, then Oozie configures Hadoop to create a _SUCCESS file in the output directory. If Done flag is set to empty, then Coordinator looks for the existence of the directory itself.
de: Die fertige Datei für den Datensatz. Wenn keine Markierung "Fertig" angegeben ist, konfiguriert Oozie Hadoop zum Erstellen einer _SUCCESS-Datei im Ausgabeverzeichnis. Wenn die Markierung "Fertig" auf leer festgelegt ist, sucht der Coordinator selbst, ob das Verzeichnis vorhanden ist.
es: Archivo de finalización para el conjunto de datos. Si no se ha especificado la marca de finalización, Oozie configura Hadoop para crear un archivo _SUCCESS en el directorio de salida. Si la marca de finalización se ha establecido en vacía, el coordinator busca la existencia del directorio propiamente dicho.
fr: Fichier terminé correspondant au dataset. Si l'indicateur Terminé n'est pas spécifié, Oozie configure Hadoop pour créer un fichier _SUCCESS dans le répertoire de sortie. Si l'indicateur Terminé est vide, alors le coordinator cherche le répertoire lui-même.
ja: データセットの完了ファイルです。Done フラグが指定されていない場合、Oozie は、出力ディレクトリに _SUCCESS ファイルを作成するように Hadoop を設定します。Done フラグが空に設定されている場合、Coordinator はディレクトリ自体が存在するかどうかを検索します。
ko: 데이터 세트의 완료 파일입니다. 완료 플래그가 지정되지 않으면 Oozie가 Hadoop를 구성하여 출력 디렉토리에 _SUCCESS 파일을 생성하도록 합니다. 완료 플래그가 빈 것으로 설정되면 Coordinator가 디렉토리 자체를 찾습니다.
zh_cn: 数据集的完成文件。如果没有指定 Done（完成）标记，则 Oozie 将配置 Hadoop 以在输出目录中创建 _SUCCESS 文件。如果 Done（完成）标记设置为空，则 Coordinator 将自行查找是否存在目录。

source: The coordinator associated with this data.
de: Der diesen Daten zugeordnete Coordinator.
es: El coordinator asociado a estos datos.
fr: Coordinator associé à ces données.
ja: このデータに関連付けられている Coordinator です。
ko: 이 데이터와 연결된 Coordinator입니다.
zh_cn: 与此数据相关的 coordinator。

source: Instance type
de: Instanztyp
es: Tipo de instancia
fr: Type d'instance
ja: インスタンスのタイプ
ko: 인스턴스 유형
zh_cn: 实例类型

source: Customize the date instance(s), e.g. define a range of dates, use EL functions...
de: Die Datumsinstanz(en) anpassen, z.B. durch Definition eines Datumsbereichs, Verwenden von EL-Funktionen...
es: Personalice las instancias de fecha, p. ej. defina un rango de fechas, utilice las funciones EL...
fr: Personnalisez la ou les instance(s) de date ; par exemple définissez une plage de dates, utilisez les fonctions EL...
ja: 日付のインスタンス（例：日付の範囲の定義、EL 関数の使用など）をカスタマイズします。
ko: 날짜 인스턴스(예: 날짜 범위 정의, EL 함수 사용 등) 사용자 지정
zh_cn: 自定义日期实例，例如，定义日期范围，使用 EL 函数...

source: Start instance
de: Startinstanz
es: Iniciar instancia
fr: Instance de début
ja: 開始インスタンス
ko: 인스턴스 시작
zh_cn: 开始实例

source: Shift the frequency for gettting past/future start date or enter verbatim the Oozie start instance, e.g. ${coord:current(0)}
de: Wechseln Sie die Frequenz zum Abrufen des vergangenen/künftigen Startdatums, oder geben Sie wörtlich die Oozie-Startinstanz ein, z.B. ${coord:current(0)}.
es: Modifique la frecuencia para obtener una fecha de inicio pasada/futura o para introducir literalmente la instancia de inicio de Oozie, p. ej. ${coord:current(0)}
fr: Changez la fréquence pour obtenir la date de début passée/future ou entrez l'instance de début Oozie exacte, par exemple ${coord:current(0)}
ja: 過去および将来の開始日を取得する頻度をシフトするか、Oozie 開始インスタンスを逐語的に（例： ${coord:current(0)}）入力します
ko: 과거/미래의 시작 날짜를 가져오는 빈도를 변경하거나 Oozie에서 인스턴스를 시작하는 verbatim 입력(예: ${coord:current(0)})
zh_cn: 变换用于获取过去/将来开始日期的频率，或逐字地输入 Oozie 开始实例，如 ${coord:current(0)}

source: End instance
de: Endinstanz
es: Finalizar instancia
fr: Instance de fin
ja: 終了インスタンス
ko: 인스턴스 종료
zh_cn: 结束时间

source: Optional: Shift the frequency for gettting past/future end dates or enter verbatim the Oozie end instance.
de: Optional: Wechseln Sie die Frequenz zum Abrufen des vergangenen/künftigen Startdatums, oder geben Sie wörtlich die Oozie-Endinstanz ein.
es: Opcional: modifique la frecuencia para obtener una fecha de inicio pasada/futura o para introducir literalmente la instancia de finalización de Oozie.
fr: Facultatif : changez la fréquence pour obtenir la date de fin passée/future ou entrez l'instance de fin Oozie exacte.
ja: オプション：過去および将来の終了日を取得する頻度をシフトするか、Oozie 終了インスタンスを逐語的に入力します。
ko: 선택 사항: 과거/미래의 종료 날짜를 가져오는 빈도를 변경하거나 Oozie에서 인스턴스를 종료하는 verbatim을 입력합니다.
zh_cn: 可选：变换用于获取过去/将来结束日期的频率，或逐字输入 Oozie 结束实例。

source: Name of an input variable in the workflow.
de: Name einer Eingabevariablen im Workflow.
es: Nombre de una variable de salida en el workflow.
fr: Nom d'une variable d'entrée dans le workflow.
ja: Workflow の入力変数の名前です。
ko: workflow의 입력 변수의 이름입니다.
zh_cn: workflow 中的输入变量名称。

source: The name of the variable of the workflow to automatically fill up.
de: Der Name der Variablen des Workflows, der automatisch aufgefüllt wird.
es: El nombre de la variable del workflow que se va a rellenar automáticamente.
fr: Nom de la variable du workflow à remplir automatiquement.
ja: 自動的に入力される Workflow の変数の名前です。
ko: 자동으로 채워지는 workflow 변수의 이름입니다.
zh_cn: workflow 自动填充的变量名称。

source: The dataset representing format of the data input.
de: Der Datensatz, der das Format der Dateneingabe repräsentiert.
es: El conjunto de datos que representa el formato de la entrada de datos.
fr: Dataset représentant le format de l'entrée de données.
ja: データ入力の形式を表すデータセットです。
ko: 데이터 입력 형식을 나타내는 Dataset입니다.
zh_cn: 数据集表示数据输入的格式。

source: The pattern of the input data we want to process.
de: Das Muster der Eingabedaten, die verarbeitet werden sollen.
es: El patrón de los datos de entrada que se quiere procesar.
fr: Motif des données d'entrée que nous souhaitons traiter.
ja: 処理する入力データのパターンです。
ko: 처리할 입력 데이터의 패턴입니다.
zh_cn: 我们需要处理的输入数据的模式。

source: Name of an output variable in the workflow
de: Name einer Ausgabevariablen im Workflow.
es: Nombre de una variable de salida en el workflow.
fr: Nom d'une variable de sortie dans le workflow.
ja: Workflow の出力変数の名前
ko: workflow의 출력 변수의 이름
zh_cn: Workflow 中输出变量的名称

source: The name of the variable of the workflow to automatically filled up.
de: Der Name der Variablen des Workflows, der automatisch aufgefüllt wird.
es: El nombre de la variable del workflow que se va a rellenar automáticamente.
fr: Nom de la variable du workflow à remplir automatiquement.
ja: 自動的に入力される Workflow の変数の名前です。
ko: 자동으로 채워지는 workflow 변수의 이름입니다.
zh_cn: 要自动填充的 workflow 的变量名称。

source: The dataset representing the format of the data output.
de: Der Datensatz, der das Format der Datenausgabe repräsentiert.
es: El dataset que representa el formato de la salida de datos.
fr: Dataset représentant le format de la sortie de données.
ja: データ出力の形式を表すデータセットです。
ko: 데이터 출력 형식을 나타내는 dataset입니다.
zh_cn: 表示数据输出格式的 dataset。

source: The pattern of the output data we want to generate.
de: Das Muster der Ausgabedaten, die generiert werden sollen.
es: Patrón de los datos salientes que se quieren generar.
fr: Modèle des données de sortie à générer.
ja: 生成する出力データのパターンです。
ko: 생성할 출력 데이터의 패턴입니다.
zh_cn: 需要生成的输出数据模式。

source: The bundle regrouping all the coordinators.
de: Das Bundle, durch das alle Coordinators neu gruppiert werden.
es: El bundle que reagrupa a todos los coordinators.
fr: Bundle regroupant tous les coordinators.
ja: すべての Coordinator を再グループ化する Bundle。
ko: 모든 coordinator를 다시 그룹화하는 bundle입니다.
zh_cn: 对所有 coordinator 重新分组的 bundle。

source: The coordinator to batch with other coordinators.
de: Der mit anderen Coordinators zu stapelnde Coordinator.
es: El coordinator que unir a otros coordinators.
fr: Coordinator à placer en lot avec d'autres coordinators.
ja: 他の Coordinator とともにバッチ処理する Coordinator。
ko: 다른 coordinator를 일괄 처리하는 coordinator입니다.
zh_cn: 要与其他 coordinator 一起批处理的 coordinator。

source: Constants used at the submission time (e.g. market=US, oozie.use.system.libpath=true).
de: Konstanten, die bei der Übermittlung verwendet werden (z.B. market=US, oozie.use.system.libpath=true).
es: Constantes utilizadas en la hora de envío (p. ej., market=US, oozie.use.system.libpath=true).
fr: Constantes utilisées à l'heure de l'envoi (par exemple, market=US, oozie.use.system.libpath=true).
ja: サブミット時間に使用される定数です（例：market=US、oozie.use.system.libpath=true）。
ko: 제출 시간에 사용되는 상수입니다(예: market=US, oozie.use.system.libpath=true).
zh_cn: 提交时间中所用的常量（例如，market=US、oozie.use.system.libpath=true）。

source: When to start the first coordinators.
de: Zeitpunkt, zu dem die ersten Coordinators gestartet werden.
es: Cuándo empezar los primeros coordinators.
fr: Heure de démarrage des premiers coordinators.
ja: 最初の Coordinator を開始する日時です。
ko: 처음 Coordinator를 시작하는 경우입니다.
zh_cn: 何时启动第一批 coordinator。

source: Variables
de: Variablen
ja: 変数
ko: 변수
zh_cn: 变量
