Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Add one or more Oozie workflow job parameters.
de: Fügen Sie einen oder mehrere Jobparameter für den Oozie-Workflow hinzu.
es: Agregue uno o más parámetros de job del workflow de Oozie.
fr: Ajoutez un ou plusieurs paramètres de job de workflow Oozie.
ja: 1 つ以上の Oozie Workflow ジョブパラメーターを追加します。
ko: 하나 이상의 Oozie Workflow Job 매개변수를 추가합니다.
zh_cn: 添加一个或多个 Oozie Workflow 作业参数。

source: Workspace
es: Área de trabajo
fr: Espace de travail
ja: ワークスペース
ko: 작업 영역
zh_cn: 工作区

source: Specify the deployment directory.
de: Geben Sie das Bereitstellungsverzeichnis an.
es: Especifique el directorio de implementación.
fr: Précisez le répertoire de déploiement.
ja: 配置ディレクトリを指定します。
ko: 배포 디렉토리를 지정합니다.
zh_cn: 指定部署目录。

source: Hadoop Properties
de: Hadoop-Eigenschaften
es: Propiedades de Hadoop
fr: Propriétés Hadoop
ja: Hadoop プロパティ
ko: Hadoop 속성
zh_cn: Hadoop 属性

source: Hadoop configuration properties.
de: Hadoop-Konfigurationseigenschaften.
es: Propiedades de configuración de Hadoop
fr: Propriétés de configuration d'Hadoop.
ja: Hadoop 設定プロパティです。
ko: Hadoop 구성 속성입니다.
zh_cn: Hadoop 配置属性。

source: Show graph arrows
de: Diagrammpfeile anzeigen
es: Mostrar flechas de gráficos
fr: Afficher les flèches du graphique
ja: グラフの矢印を表示
ko: 그래프 화살표 표시
zh_cn: 显示图形箭头

source: Toggles display of graph arrows.
de: Schaltet die Anzeige von Diagrammpfeilen um.
es: Muestra u oculta las flechas del gráfico.
fr: Affiche/masque les flèches du graphique.
ja: グラフの矢印の表示を切り替えます。
ko: 그래프 화살표 표시 전환
zh_cn: 切换图表箭头显示。

source: Version
es: Versión
ja: バージョン
ko: 버전
zh_cn: 版本

source: Oozie XML Schema Version
de: Version des Oozie-XML-Schemas
es: Versión de esquema XML de Oozie
fr: Version du schéma XML Oozie
ja: Oozie XML スキーマバージョン
ko: Oozie XML 스키마 버전
zh_cn: Oozie XML Schema 版本

source: Oozie Job XML file
de: XML-Datei für Oozie-Job
es: Archivo XML de job de Oozie
fr: Fichier XML du job Oozie
ja: Oozie ジョブ XML ファイル
ko: Oozie Job XML 파일
zh_cn: Oozie Job XML 文件

source: SLA Enabled
de: SLA aktiviert
es: SLA activado
fr: SLA activé
ja: SLA が有効です
ko: SLA 사용
zh_cn: SLA 已启用

source: SLA Configuration
de: SLA-Konfiguration
es: Configuración de SLA
fr: Configuration du SLA
ja: SLA の設定
ko: SLA 구성
zh_cn: SLA 配置

source: Oozie SLA properties
de: Oozie-SLA-Eigenschaften
es: Propiedades SLA de Oozie
fr: Propriétés SLA Oozie
ja: Oozie SLA プロパティ
ko: Oozie SLA 속성
zh_cn: Oozie SLA 属性

source: Action failed, error message[${wf:errorMessage(wf:lastErrorNode())}]
de: Aktion fehlgeschlagen, Fehlermeldung[${wf:errorMessage(wf:lastErrorNode())}]
es: Error al realizar la acción. Mensaje de error [${wf:errorMessage(wf:lastErrorNode())}]
fr: L'action a échoué, message d'erreur[${wf:errorMessage(wf:lastErrorNode())}]
ja: エラーメッセージ [${wf:errorMessage(wf:lastErrorNode())}] が表示され、アクションが失敗しました。
ko: 작업 실패, 오류 메시지[${wf:errorMessage(wf:lastErrorNode())}]
zh_cn: 操作失败，错误消息[${wf:errorMessage(wf:lastErrorNode())}]

source: ${wf:name()} execution failure
de: ${wf:name()} konnte nicht ausgeführt werden
es: Error de ejecución de ${wf:name()}.
fr: Échec de l'exécution de ${wf:name()}
ja: ${wf:name()} 実行失敗
ko: ${wf:name()} 실행 실패
zh_cn: ${wf:name()} 执行失败

source: ${wf:name()} execution successful
de: ${wf:name()} erfolgreich ausgeführt
es: Ejecución de ${wf:name()} correcta.
fr: Réussite de l'exécution de ${wf:name()}
ja: ${wf:name()} 実行成功
ko: ${wf:name()} 실행 성공
zh_cn: ${wf:name()} 执行成功

source: Script
de: Skript
es: Secuencia de comandos
ja: スクリプト
ko: 스크립트
zh_cn: 脚本

source: Path to the script on HDFS.
de: Pfad zu dem Skript auf HDFS.
es: Ruta a la secuencia de comandos en HDFS.
fr: Chemin d'accès au script sur HDFS.
ja: HDFS 上のスクリプトへのパスです。
ko: HDFS의 스크립트에 대한 경로입니다.
zh_cn: HDFS 上的脚本路径。

source: The Pig parameters of the script without -param. e.g. INPUT=${inputDir}
de: Die Pig-Parameter des Skripts ohne "-param", z.B. "INPUT=${inputDir}"
es: Los parámetros Pig de la secuencia de comandos sin -param. p. ej., INPUT=${inputDir}
fr: Paramètres Pig du script sans -param, par exemple INPUT=${inputDir}
ja: -param のないスクリプトの Pig パラメータです（例：INPUT=${inputDir}）
ko: -param이 없는 스크립트의 Pig 매개변수(예: INPUT=${inputDir})
zh_cn: 脚本的 Pig 参数，无 -param.，例如 INPUT=${inputDir}

source: The Pig parameters of the script as is. e.g. -param, INPUT=${inputDir}
de: Die vorhandenen Pig-Parameter des Skripts, z. B. "-param", "INPUT=${inputDir}"
es: Los parámetros Pig de la secuencia de comandos tal cual. P. ej., "-param", "INPUT=${inputDir}"
fr: Paramètres Pig du script tel quel, par exemple -param, INPUT=${inputDir}
ja: 現在のスクリプトの Pig パラメータです（例：-param, INPUT=${inputDir}）
ko: 스크립트 자체의 Pig 매개변수(예: -param, INPUT=${inputDir})
zh_cn: 脚本的 Pig 参数，无改动，例如 -param, INPUT=${inputDir}

source: Files put in the running directory.
de: Dateien im aktiven Verzeichnis.
es: Archivos situados en el directorio en ejecución.
fr: Fichiers placés dans le répertoire en cours d'exécution.
ja: 実行ディレクトリに格納されたファイル。
ko: 실행 중인 디렉토리에 파일을 넣습니다.
zh_cn: 放入运行目录的文件。

source: zip, tar and tgz/tar.gz uncompressed into the running directory.
de: zip, tar und tgz/tar.gz in das aktive Verzeichnis dekomprimiert.
es: zip, tar and tgz/tar.gz descomprimidos en el directorio en ejecución.
fr: fichiers zip, tar et tgz/tar.gz décompressés dans le répertoire en cours d'exécution.
ja: zip、tar、および tgz/tar.gz は圧縮解除されて実行ディレクトリに入れられます。
ko: 실행 중인 디렉토리로 압축되지 않은 zip, tar 및 tgz/tar.gz입니다.
zh_cn: zip、tar 和 tgz/tar.gz 解压到运行目录中。

source: value, e.g. production
de: Wert, z.B. Produktion
es: valor, p. ej., producción
fr: valeur, par exemple production
ja: 値（production など）
ko: 값(예: production)
zh_cn: 值，例如生产

source: Path to manipulate before starting the application.
de: Pfad, der geändert werden muss, bevor die Anwendung gestartet wird.
es: Ruta para manipular antes de iniciar la aplicación.
fr: Chemin d'accès à manipuler avant de démarrer l'application.
ja: アプリケーションを起動する前に操作するパスです。
ko: 애플리케이션을 시작하기 전에 조작할 경로입니다.
zh_cn: 启动应用程序前的操作路径。

source: Refer to a Hadoop JobConf job.xml
de: Siehe Hadoop JobConf-job.xml
es: Consulte un archivo Hadoop JobConf job.xml
fr: Se référer un fichier job.xml JobConf de Hadoop
ja: Hadoop JobConf job.xml を参照してください
ko: Hadoop JobConf job.xml 참조
zh_cn: 请参考 Hadoop JobConf job.xml

source: Max retry
de: Maximale Wiederholungsversuche
es: Máx. de reintentos
fr: Nombre max. de tentatives
ja: 最大再試行回数
ko: 최대 재시도
zh_cn: 最大重试次数

source: Number of times, default is 3
de: Anzahl Wiederholungen, Standardwert ist 3
es: Número de veces, el valor predeterminado es 3
fr: Nombre de fois, 3 par défaut
ja: 回数。デフォルトは 3 です
ko: 횟수(기본값: 3)
zh_cn: 次数，默认为 3

source: Retry interval
de: Wiederholungsintervall
es: Intervalo de reintentos
fr: Intervalle entre les tentatives
ja: 再試行の間隔
ko: 재시도 간격
zh_cn: 重试间隔

source: Wait time in minutes, default is 10
de: Wartezeit in Minuten, Standardwert ist 10
es: Tiempo de espera en minutos, el valor predeterminado es 10
fr: Temps d'attente en minutes, 10 par défaut
ja: 待機時間（分）です。デフォルト値は 10 です
ko: 대기 시간(분, 기본값: 10분)
zh_cn: 等待时间（分钟），默认为 10

source: Path to the jar on HDFS.
de: Pfad zur JAR in HDFS
es: Ruta al archivo jar en HDFS.
fr: Chemin d'accès au fichier jar sur HDFS.
ja: HDFS 上の jar へのパスです。
ko: HDFS의 jar에 대한 경로입니다.
zh_cn: HDFS 上的 jar 路径。

source: Java class. e.g. org.apache.hadoop.examples.Grep
de: Java-Klasse. z.B. org.apache.hadoop.examples.Grep
es: Clase de Java, p. ej., org.apache.hadoop.examples.Grep
fr: Classe Java, par exemple org.apache.hadoop.examples.Grep
ja: Java クラス（org.apache.hadoop.examples.Grep など）
ko: Java 클래스의 전체 이름(예: org.apache.hadoop.examples.Grep)
zh_cn: Java 类。如 org.apache.hadoop.examples.Grep

source: Parameters for the JVM, e.g. -Dprop1=a -Dprop2=b
de: Parameter für JVM, z.B. -Dprop1=a -Dprop2=b
es: Parámetros para la JVM, p. ej., -Dprop1=a -Dprop2=b
fr: Paramètres pour la machine virtuelle Java, par exemple -Dprop1=a -Dprop2=b
ja: JVM のパラメータ（-Dprop1=a -Dprop2=b など）
ko: JVM에 대한 매개변수입니다(예: -Dprop1=a -Dprop2=b).
zh_cn: JVM 的参数，例如 -Dprop1=a -Dprop2=b

source: Refer to a hive-site.xml for connecting to Hive
de: Informationen zum Verbinden mit Hive siehe hive-site.xml
es: Para conectar a Hive, consulte hive-site.xml
fr: Se référer à un fichier hive-site.xml pour la connexion à Hive
ja: Hive への接続については、hive-site.xml を参照してください
ko: Hive에 연결하려면 hive-site.xml 참조
zh_cn: 参见 hive-site.xml 以连接 Hive

source: Arguments for beeline. E.g. --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks
de: Argumente für den kürzesten Weg. Z. B. --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks
es: Argumentos para beeline. P. ej. --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks
fr: Arguments pour Beeline. Par exemple --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks
ja: beeline の引数です（例：--showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks）。
ko: beeline에 대한 인수. 예: --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks
zh_cn: beeline 的参数。例如 --showHeader=true, -Djavax.net.ssl.trustStore=/etc/cdep-ssl-conf/CA_STANDARD/truststore.jks

source: e.g. jdbc:hive2://localhost:10000/default. JDBC URL for the Hive Server 2.
de: z. B. jdbc:hive2://localhost:10000/default. JDBC-URL für den Hive-Server 2.
es: p. ej., jdbc:hive2://localhost:10000/default. URL de JDBC para el servidor Hive 2.
fr: par ex., jdbc:hive2://localhost:10000/default. URL JDBC pour le serveur Hive 2.
ja: jdbc:hive2://localhost:10000/default など。Hive Server 2 の JDBC URL です。
ko: 예: jdbc:hive2://localhost:10000/default. Hive Server 2의 경우 JDBC URL입니다.
zh_cn: 例如，对于 Hive Server 2 为 jdbc:hive2://localhost:10000/default. JDBC URL。

source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
zh_cn: 密码

source: The password element must contain the password of the current user. However, the password is only used if Hive Server 2 is backed by something requiring a password (e.g. LDAP); non-secured Hive Server 2 or Kerberized Hive Server 2 don't require a password.
de: Das Kennwortelement muss das Kennwort des aktuellen Benutzers enthalten. Das Kennwort wird jedoch nur verwendet, wenn Hive-Server 2 durch etwas unterstützt wird, für das ein Kennwort erforderlich ist (z.B. LDAP); Hive-Server 2 ohne Absicherung und Kerberized Hive-Server 2 erfordern kein Kennwort.
es: El elemento de contraseña debe incluir la contraseña del usuario actual. Sin embargo, la contraseña solo se utiliza si el servidor Hive 2 está respaldado por algo que requiera una contraseña (p. ej., LDAP); el servidor Hive 2 no seguro o el servidor kerberizado Hive 2 no requieren contraseña.
fr: L'élément de mot de passe doit contenir le mot de passe de l'utilisateur en cours. Le mot de passe est utilisé uniquement si Hive Server 2 est sauvegardé par un système nécessitant un mot de passe (ex. : LDAP) ; les versions de Hive Server 2 non sécurisées ou kerberisées ne nécessitent pas de mot de passe.
ja: パスワード要素は現在のユーザーのパスワードを含んでいる必要があります。ただし、パスワードが必要なのは、Hive Server 2 がパスワードを必要とする機能（LDAP など）によって補助される場合のみです。セキュリティで保護されていない Hive Server 2 または Kerberos を使用する Hive Server 2 はパスワードを必要としません。
ko: 암호 요소는 현재 사용자의 암호를 포함해야 합니다. 하지만, 이 암호는 Hive Server 2가 암호를 요구하는 특정 항목(예: LDAP)에 의해 백업되었을 경우에만 사용됩니다. 안전하지 않은 Hive Server 2 또는 Kerberized Hive Server 2는 암호를 요구하지 않습니다.
zh_cn: 密码元素必须包含当前用户的密码。但是，仅当 Hive Server 2 受到某些需要密码的元素（例如 LDAP）支持时才会使用密码；非加密 Hive Server 2 或 Kerberized Hive Server 2 不需要密码。

source: Impalad hostname
es: Nombre de host de Impala
fr: Nom d'hôte Impalad
ja: Impalad ホスト名
ko: Impalad 호스트 이름
zh_cn: Impalad 主机名

source: e.g. impalad-001.cluster.com. The hostname of the Impalad to send the query to.
de: z. B. impalad-001.cluster.com. Der Hostname des Impalad, an den die Abfrage gesendet werden soll.
es: por ejemplo, impalad-001.cluster.com. El nombre de host de Impala al que se enviará la consulta.
fr: Par exemple, impalad-001.cluster.com. Nom d’hôte du démon Impalad vers lequel envoyer la requête.
ja: 例：impalad-001.cluster.com。クエリを送信する Impalad のホスト名です。
ko: 예: impalad-001.cluster.com. 쿼리를 보내는 Impalad의 호스트 이름입니다.
zh_cn: 例如 impalad-001.cluster.com。要将查询发送到的 Impalad 的主机名。

source: Keytab path
de: Keytab-Pfad
es: Ruta de keytab
fr: Chemin d’accès au fichier keytab
ja: keytab パス
ko: Keytab 경로
zh_cn: Keytab 路径

source: Path to the keytab to use when on a secure cluster, e.g. /user/joe/joe.keytab.
de: Pfad zum Keytab, der in einem sicheren Cluster verwendet werden soll, z. B. /user/joe/joe.keytab.
es: La ruta de keytab que se usará en un clúster seguro, por ejemplo, /user/joe/joe.keytab.
fr: Chemin d’accès au fichier keytab à utiliser dans le cas d’un cluster sécurisé. Par exemple, /user/joe/joe.keytab.
ja: セキュアなクラスタで使用する keytab へのパスです。例：/user/joe/joe.keytab。
ko: 보안 클러스터에 있는 경우 사용할 Keytab 경로입니다(예: /user/joe/joe.keytab).
zh_cn: 要在安全群集上使用的 keytab 的路径，例如 /user/joe/joe.keytab。

source: User principal
de: Benutzerprinzipal
es: Entidad de seguridad del usuario
fr: Principal d’utilisateur
ja: ユーザープリンシパル
ko: 사용자 계정
zh_cn: 用户主体

source: Name of the principal to use in the kinit, e.g.: kinit -k -t /home/joe/joe.keytab joe@PROD.EDH.
de: Name des Prinzipals, der im Kinit verwendet werden soll, z. B.: kinit -k -t /home/joe/joe.keytab joe@PROD.EDH.
es: Nombre de la entidad de seguridad que se usará en kinit, por ejemplo: kinit -k -t /home/joe/joe.keytab joe@PROD.EDH.
fr: Nom du principal à utiliser dans la commande kinit. Par exemple : kinit -k -t /home/joe/joe.keytab joe@PROD.EDH.
ja: kinit で使用するプリンシパルの名前です。例：kinit -k -t /home/joe/joe.keytab joe@PROD.EDH。
ko: kinit에서 사용할 계정의 이름입니다(예: kinit -k -t /home/joe/joe.keytab joe@PROD.EDH).
zh_cn: 要在 kinit 中使用的主体的名称，例如 kinit -k -t /home/joe/joe.keytab joe@PROD.EDH。

source: The sub-workflow application to include. You must own all the sub-workflows
de: Zu berücksichtigende Unterworkflow-Anwendung. Sie müssen alle Unterworkflows besitzen.
es: La aplicación de subworkflow que se va a incluir. Debe ser propietario de todos los subworkflows.
fr: Application de sous-workflow à inclure. Vous devez détenir tous les sous-workflows
ja: 含めるサブ Workflow アプリケーションです。すべてのサブ Workflow を所有している必要があります。
ko: 포함할 Sub workflow 애플리케이션입니다. 모든 Sub workflow를 소유해야 함
zh_cn: 要包括的子 Workflow 应用程序。您必须拥有所有子 Workflow

source: Sqoop command
de: Sqoop-Befehl
es: Comando Sqoop
fr: Commande Sqoop
ja: Sqoop コマンド
ko: Sqoop 명령
zh_cn: Sqoop 命令

source: Shell command
de: Shell-Befehl
es: Comando Shell
fr: Commande Shell
ja: Shell コマンド
ko: Shell 명령
zh_cn: Shell 命令

source: Shell command to execute, e.g script.sh
de: Auszuführender Shell-Befehl, z.B. script.sh
es: El comando Shell que se va a ejecutar, p. ej., script.sh
fr: Commande Shell à exécuter, par exemple script.sh
ja: 実行する Shell コマンド（script.sh など）
ko: 실행할 shell 명령(예: script.sh)
zh_cn: 要执行的 Shell 命令，例如 script.sh

source: One arg, e.g. -l, --help
de: Ein Arg, z.B. -l, --help
es: Un argumento, p. ej., e.g. -l, --help
fr: Un argument, par exemple -l, --help
ja: 1 つの引数（-l、--help など）
ko: 하나의 인수(예: -l, --help)
zh_cn: 一个 arg，例如 -l, --help

source: Environment variables
de: Umgebungsvariablen
es: Variables del entorno
fr: Variables d'environnement
ja: 環境変数
ko: 환경 변수
zh_cn: 环境变量

source: e.g. MAX=10 or PATH=$PATH:mypath
de: z.B. MAX=10 oder PATH=$PATH:mypath
es: p. ej., MAX=10 o PATH=$PATH:mypath
fr: par exemple MAX=10 ou PATH=$PATH:mypath
ja: MAX=10、PATH=$PATH:mypath など
ko: 예: MAX=10 또는 PATH=$PATH:mypath
zh_cn: 例如 MAX=10 或 PATH=$PATH:mypath

source: User and Host
de: Benutzer und Host
es: Usuario y host
fr: Utilisateur et hôte
ja: ユーザーとホスト
ko: 사용자 및 호스트
zh_cn: 用户和主机

source: Ssh command
de: SSH-Befehl
es: Comando Ssh
fr: Commande Ssh
ja: Ssh コマンド
ko: SSH 명령
zh_cn: SSH 命令

source: Deletes recursively all content.
de: Löscht rekursiv sämtlichen Inhalt.
es: Elimina recursivamente todo el contenido.
fr: Supprime tout le contenu de façon récursive.
ja: すべてのコンテンツを再帰的に削除します。
ko: 모든 콘텐츠를 재귀적으로 삭제합니다.
zh_cn: 递归删除所有内容。

source: Sub directories are created if needed.
de: Unterverzeichnisse werden bei Bedarf erstellt.
es: Si es necesario, se crean subdirectorios.
fr: Des sous-répertoires sont créés si besoin est.
ja: 必要な場合はサブディレクトリが作成されます。
ko: 필요한 경우 하위 디렉토리가 생성됩니다.
zh_cn: 创建子目录（如有必要）。

source: Move file or directory
de: Datei oder Verzeichnis verschieben
es: Mover archivo o directorio
fr: Déplacer le fichier ou le répertoire
ja: ファイルまたはディレクトリを移動
ko: 파일 또는 디렉토리 이동
zh_cn: 移动文件或目录

source: Destination.
de: Ziel.
es: Destino.
ja: 宛先。
ko: 대상입니다.
zh_cn: 目标。

source: File or directory.
de: Datei oder Verzeichnis.
es: Archivo o directorio.
fr: Fichier ou répertoire.
ja: ファイルまたはディレクトリです。
ko: 파일 또는 디렉토리입니다.
zh_cn: 文件或目录。

source: Or update its modification date.
de: Oder aktualisieren Sie sein Änderungsdatum.
es: O actualice su fecha de modificación.
fr: Ou mettez à jour sa date de modification.
ja: または、変更日付を更新します。
ko: 또는 수정 날짜를 업데이트합니다.
zh_cn: 或更新它的修改日期。

source: Change the group
de: Gruppe ändern
es: Cambiar el grupo
fr: Modifier le groupe
ja: グループを変更
ko: 그룹 변경
zh_cn: 更改组

source: To addresses
de: TO-Adressen
es: Direcciones de envío
fr: Adresses des destinataires
ja: 送信先アドレス
ko: 받는 사람 주소
zh_cn: 接收地址

source: Comma-separated values
de: Durch Kommas getrennte Werte
es: Valores separados por comas
fr: Valeurs séparées par des virgules
ja: カンマ区切り値
ko: 쉼표로 구분된 값
zh_cn: 用逗号分开的值

source: Plain-text
de: Nur-Text
es: Texto sin formato
fr: Texte en clair
ja: プレーンテキストです
ko: 일반 텍스트
zh_cn: 纯文本

source: Attachment
de: Anhang
es: Adjunto
fr: Pièce jointe
ja: 添付
ko: 첨부
zh_cn: 附件

source: Comma separated list of HDFS files.
de: Komma-getrennte Liste der HDFS-Dateien.
es: Lista separada por comas de archivos HDFS.
fr: Liste de fichiers HDFS séparés par des virgules.
ja: HDFS ファイルのカンマ区切りリストです。
ko: 쉼표로 구분된 HDFS 파일 목록입니다.
zh_cn: HDFS 文件逗号隔离的列表。

source: Content-type
de: Inhaltstyp
es: Tipo de contenido
fr: Content-type (type de contenu)
ja: コンテンツタイプ
ko: 콘텐츠 유형
zh_cn: 内容类型

source: Default is text/plain
de: Standardwert ist text/plain
es: El valor predeterminado es texto sin formato
fr: Par défaut, text/plain
ja: デフォルト値は text/plain です
ko: 기본값은 텍스트/일반 텍스트
zh_cn: 默认为文本/纯文本

source: Options first, then source / destination paths
de: Optionen zuerst, dann Quell-/Zielpfade
es: Primero las opciones y luego las rutas de origen / destino
fr: Options en premier, puis chemins d'accès de la source/destination
ja: オプションを最初に指定し、次にソース／目的のパスを指定します
ko: 맨 앞에 옵션, 그 다음 소스/대상 경로
zh_cn: 首先是选项，然后是来源/目标路径

source: Ex: spark://host:port, mesos://host:port, yarn, or local.
de: z. B. spark://host:port, mesos://host:port, yarn oder local.
es: P. ej.: spark://host:port, mesos://host:port, yarn o local.
fr: Ex: spark://host:port, mesos://host:port, yarn ou local.
ja: spark://host:port、mesos://host:port、yarn、local など
ko: 예: spark://host:port, mesos://host:port, yarn 또는 local.
zh_cn: Ex: spark://host:port、mesos://host:port、yarn 或本地。

source: Mode
de: Modus
es: Modo
ja: モード
ko: 모드
zh_cn: 模式

source: e.g. Client cluster
de: z. B. Client-Cluster
es: p. ej., clúster de cliente
fr: ex. : client,cluster
ja: クライアントクラスターなど
ko: 예: 클라이언트 클러스터
zh_cn: 例如客户端集群

source: App name
de: Anwendungsname
es: Nombre de la aplicación
fr: Nom de l'application
ja: アプリ名
ko: 앱 이름
zh_cn: 应用程序名称

source: The name of the spark application
de: Der Name der Spark-Anwendung
es: El nombre de la aplicación Spark
fr: Nom de de l'application Spark
ja: Spark アプリケーションの名前です
ko: Spark 애플리케이션 이름
zh_cn: spark 应用程序的名称

source: Path to file to put in the running directory.
de: Pfad der Datei, die im aktiven Verzeichnis abgelegt werden soll.
es: Ruta a archivo para situarlo en el directorio en ejecución.
fr: Chemin d'accès au fichier à placer dans le répertoire en cours d'exécution.
ja: 実行ディレクトリに格納するファイルのパスです。
ko: 실행 중인 디렉토리에 넣을 파일 경로.
zh_cn: 要放入运行目录的文件的路径。

source: Only if using jars, e.g. org.apache.spark.examples.mllib.JavaALS
de: Nur dann, wenn jar-Dateien verwendet werden, z. B. org.apache.spark.examples.mllib.JavaALS
es: Solo si utiliza jars, p. ej., org.apache.spark.examples.mllib.JavaALS
fr: Uniquement en cas d'utilisation de fichiers JAR, par exemple org.apache.spark.examples.mllib.JavaALS
ja: jar を使用する場合にのみ指定します（例：org.apache.spark.examples.mllib.JavaALS）。
ko: jar을 사용하는 경우만, 예: org.apache.spark.examples.mllib.JavaALS
zh_cn: 仅限在使用 jar 时，例如 org.apache.spark.examples.mllib.JavaALS

source: Jar/py name
es: Nombre jar/py
fr: Nom du fichier Jar/py
ja: jar/py 名
ko: Jar/py 이름
zh_cn: Jar/py 名称

source: Name of main file added in Files.
de: Name der Hauptdatei, die in Dateien hinzugefügt wird.
es: Nombre de archivo principal añadido en Archivos.
fr: Nom du fichier principal ajouté dans Fichiers.
ja: 追加するメインファイルの名前です。
ko: 파일에 추가된 주 파일의 이름.
zh_cn: 在文件中添加的主文件的名称。

source: Options list
de: Optionsliste
es: Lista de opciones
fr: Liste d'options
ja: オプションリスト
ko: 옵션 목록
zh_cn: 选项列表

source: Arguments, one by one, e.g. 1000, /path/a.
de: Argumente, nacheinander, z. B. 1000, /path/a.
es: Argumentos, uno por uno, p. ej., 1000, /path/a.
fr: Arguments, un par un, par ex. 1 000, /path/a.
ja: 引数。1 つずつ。1000、/path/a など
ko: 인수(차례대로, 예: 1000, /path/a).
zh_cn: 逐个参数，例如，1000, /path/a。

source: Message
de: Meldung
es: Mensaje
ja: メッセージ
ko: 메시지
zh_cn: 消息

source: Message to display when the workflow fails. Can contain some EL functions.
de: Anzuzeigende Meldung, wenn der Workflow fehlschlägt. Kann EL-Funktionen enthalten.
es: El mensaje que se muestra cuando el workflow falla. Puede contener algunas funciones EL.
fr: Message à afficher en cas d'échec du workflow. Peut contenir des fonctions EL.
ja: Workflow が失敗したときに表示するメッセージ。EL 関数を複数含めることができます。
ko: workflow가 실패했을 때 표시되는 메시지입니다. 일부 EL 함수를 포함할 수 있습니다.
zh_cn: workflow 失败时显示的消息。可以包含一些 EL 函数。

source: XML of the action
de: XML der Aktion
es: XML de la acción
fr: XML de l'action
ja: アクションの XML
ko: 작업 XML
zh_cn: 操作 XML

source: Insert verbatim the XML of the action to insert into the workflow.
de: Fügen Sie den Wortlaut der XML für die Aktion ein, die in den Workflow integriert werden soll.
es: Introduzca literalmente el XML de la acción que se insertará en el workflow.
fr: Insérez l'instance du XML de l'action à insérer dans le workflow.
ja: Workflow に挿入するために、アクションの XML を逐語的に挿入します。
ko: Workflow에 삽입할 작업의 XML을 그대로 삽입합니다.
zh_cn: 逐字插入操作 XML 以插入到 Workflow。

source: Hive query
de: Hive-Abfrage
es: Consulta de Hive
fr: Requête Hive
ja: Hive クエリ
ko: Hive 쿼리
zh_cn: Hive 查询

source: Select a saved Hive query you want to schedule.
de: Wählen Sie eine gespeicherte Hive-Abfrage aus, die Sie planen möchten.
es: Seleccione una consulta de Hive que desee programar.
fr: Sélectionnez une requête Hive enregistrée que vous souhaitez planifier.
ja: スケジュールする保存済み Hive クエリを選択します。
ko: 일정을 지정할 저장된 Hive 쿼리를 선택합니다.
zh_cn: 选择您想要计划的已保存 Hive 查询。

source: The parameters of the script. E.g. N=5, INPUT=${inputDir}
de: Die Parameter des Skripts. Beispiel: N=5, INPUT=${inputDir}
es: Los parámetros de la secuencia de comandos. Por ejemplo: N=5, INPUT=${inputDir}
fr: Paramètres du script. Par exemple, N=5, INPUT=${inputDir}
ja: スクリプトのパラメータです。例：N=5、INPUT=${inputDir}
ko: 스크립트의 매개변수입니다(예: N=5, INPUT=${inputDir}).
zh_cn: 脚本的参数。例如 N=5, INPUT=${inputDir}

source: e.g. impalad-001.cluster.com (optional)
de: z. B. impalad-001.cluster.com (optional)
es: por ejemplo: impalad-001.cluster.com (opcional)
fr: Par exemple, impalad-001.cluster.com (facultatif)
ja: 例：impalad-001.cluster.com（オプション）
ko: 예: impalad-001.cluster.com(선택 사항)
zh_cn: 例如 impalad-001.cluster.com（可选）

source: Impala query
de: Impala-Abfrage
es: Consulta de Impala
fr: Requête Impala
ja: Impala クエリ
ko: Impala 쿼리
zh_cn: Impala 查询

source: Select a saved Impala query you want to schedule.
de: Wählen Sie eine gespeicherte Impala-Abfrage aus, die Sie planen möchten.
es: Seleccione la consulta de Impala guardada que desee programar.
fr: Sélectionnez une requête Impala enregistrée que vous souhaitez planifier.
ja: スケジュールする保存済み Impala クエリを選択します。
ko: 일정을 지정할 저장된 Impala 쿼리를 선택하십시오.
zh_cn: 选择您想要计划的已保存 Impala 查询。
