Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Java options
de: Java-Optionen
es: Opciones de Java
fr: Options Java
ja: Java オプション
ko: Java 옵션
zh_cn: Java 选项

source: Command-line parameters used to start the JVM that will execute the Java application. Using this element is equivalent to using the mapred.child.java.opts configuration property. E.g. -Dexample-property=hue
de: Befehlszeilenparameter zum Starten der JVM, welche die Java-Anwendung ausführt. Die Verwendung dieses Elements entspricht der Verwendung der Konfigurationseigenschaft mapred.child.java.opts. Zum Beispiel -Dexample-property=hue
es: Parámetros de la línea de comandos utilizados al iniciar la JVM que ejecutará la aplicación Java. Utilizar este elemento es equivalente a utilizar la propiedad de configuración mapred.child.java.opts. P. ej., -Dexample-property=hue
fr: Paramètres de ligne de commande utilisés pour démarrer la machine virtuelle Java qui va exécuter l'application Java. Utiliser cet élément équivaut à utiliser la propriété de configuration mapred.child.java.opts. Exemple : -Dexample-property=hue
ja: Java アプリケーションを実行する JVM の起動に使用されるコマンドラインパラメータです。この要素を使用することは、mapred.child.java.opts 設定プロパティを使用するのと等価です。例：-Dexample-property=hue
ko: Java 애플리케이션을 실행할 JVM이 시작되는 데 사용하는 명령줄 매개변수입니다. 이 요소를 사용하는 것은 mapred.child.java.opts 구성 속성을 사용하는 것과 동일합니다(예: -Dexample-property=hue).
zh_cn: 命令行参数用于启动将执行 Java 应用程序的 JVM。使用此元素等效于使用 mapred.child.java.opts 配置属性。例如，-Dexample-property=hue

source: Capture output
de: Ausgabe erfassen
es: Capturar resultado
fr: Résultat de capture
ja: 出力をキャプチャ
ko: 출력 캡처
zh_cn: 捕获输出

source: Capture output of the stdout of the %(program)s command execution. The %(program)s command output must be in Java Properties file format and it must not exceed 2KB. From within the workflow definition, the output of an %(program)s action node is accessible via the String action:output(String node, String key) function
de: Erfasst die stdout-Ausgabe für die Ausführung des Befehls %(program)s. Die Ausgabe des Befehls %(program)s muss im Java-Eigenschaftsdateiformat vorliegen und darf nicht größer als 2 KB sein. Innerhalb der Workflow-Definition ist die Ausgabe eines %(program)s-Aktionsknotens über die Funktion "String action:output(String node, String key)" zugänglich.
es: Capturar salida del stdout de la ejecución del comando %(program)s. La salida del comando %(program)s debe tener el formato de archivo de propiedades Java y no superar los 2 KB. Desde dentro de la definición de workflow, la salida de un nodo de acción %(program)s es accesible a través de la función String action:output(String node, String key)
fr: Sortie de capture stdout de l'exécution de la commande %(program)s. La sortie de la commande %(program)s doit figurer dans le format du fichier des propriétés Java mais ne doit pas dépasser 2 Ko. A partir de la définition du workflow, la sortie d'un noeud d'action %(program)s est accessible par le biais de la fonction String action:output(String node, String key).
ja: %(program)s コマンド実行の stdout の出力をキャプチャします。%(program)s コマンドの出力は、ファイルフォーマットが Java Properties でなければならず、サイズが 2KB を超えてはなりません。%(program)s アクションノードの出力へは、Workflow 定義内から String action:output(String node, String key) 関数を使用してアクセスできます。
ko: %(program)s 명령 실행의 stdout 출력을 캡처합니다. %(program)s 명령 출력은 Java 속성 파일 형식이어야 하고 2KB를 초과할 수 없습니다. workflow 정의 내에서 %(program)s 동작 노드의 출력은 String action:output(String node, String key) 함수를 통해 액세스할 수 있습니다.
zh_cn: %(program)s 命令执行 StdOut 的捕获输出。%(program)s 命令输出必须为 Java 属性文件格式，且不得超过 2KB。在 workflow 定义中，可通过字符串 action:output（字符串节点，字符串密钥）功能访问 %(program)s 操作节点的输出

source: Script name
de: Skriptname
es: Nombre de la secuencia de comandos
fr: Nom du script
ja: スクリプト名
ko: 스크립트 이름
zh_cn: 脚本名称

source: Script name or path to the Pig script. E.g. my_script.pig.
de: Skriptname oder Pfad zum Pig-Skript, z. B. my_script.pig.
es: Nombre de la secuencia de comandos o ruta a la secuencia de comandos Pig. P. ej., my_script.pig.
fr: Nom ou chemin du script Pig (par exemple, mon_script.pig).
ja: Pig スクリプトのスクリプト名またはパスです（例：my_script.pig）。
ko: Pig 스크립트의 이름 또는 경로입니다(예: my_script.pig).
zh_cn: 脚本名称或 Pig 脚本路径。如 my_script.pig。

source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres
ja: パラメーター
ko: 매개변수
zh_cn: 参数

source: The Pig parameters of the script. e.g. "-param", "INPUT=${inputDir}"
de: Die Pig-Parameter des Skripts, z. B. "-param", "INPUT=${inputDir}"
es: Los parámetros Pig de la secuencia de comandos. P. ej., "-param", "INPUT=${inputDir}"
fr: Paramètres Pig du script, par exemple "-param", "INPUT=${inputDir}"
ja: スクリプトの Pig パラメータです（例："-param"、"INPUT=${inputDir}"）。
ko: 스크립트의 Pig 매개변수입니다(예: "-param", "INPUT=${inputDir}").
zh_cn: 脚本的 Pig 参数。如 "-param", "INPUT=${inputDir}"

source: Script name or path to the %(type)s script. E.g. my_script.sql.
de: Skriptname oder Pfad zum %(type)s-Skript, z. B. my_script.sql.
es: Nombre de la secuencia de comandos o ruta a la secuencia de comandos %(type)s. P. ej., my_script.sql.
fr: Nom du script ou chemin du script %(type)s, par exemple mon_script.sql.
ja: %(type)s スクリプトのスクリプト名またはパスです（例：my_script.sql）。
ko: %(type)s 스크립트의 이름 또는 경로입니다(예: my_script.sql).
zh_cn: 脚本名称或 %(type)s 脚本路径。如 my_script.sql。

source: The %(type)s parameters of the script. E.g. N=5, INPUT=${inputDir}
de: Die %(type)s-Parameter des Skripts, z. B. "N=5", "INPUT=${inputDir}"
es: Los parámetros %(type)s de la secuencia de comandos. P. ej., N=5, INPUT=${inputDir}
fr: Paramètres %(type)s du script, par exemple N=5, INPUT=${inputDir}
ja: スクリプトの %(type)s パラメータです（例：N=5、INPUT=${inputDir}）。
ko: 스크립트의 %(type)s 매개변수입니다(예: N=5, INPUT=${inputDir}).
zh_cn: 脚本的 %(type)s 参数。如 N=5，INPUT=${inputDir}

source: List of absolute paths to delete, then create, before starting the application. This should be used exclusively for directory cleanup.
de: Liste von absoluten Pfaden, die vor dem Starten der Anwendung gelöscht und dann erstellt werden sollen. Dies sollte ausschließlich für die Verzeichnisbereinigung verwendet werden.
es: Lista de rutas absolutas para eliminar y, a continuación, crear, antes de arrancar la aplicación. Se debería utilizar exclusivamente para limpiar el directorio.
fr: Liste des chemins absolus à supprimer puis à créer avant le démarrage de l'application. A n'utiliser que pour le nettoyage des répertoires.
ja: アプリケーションを開始する前に削除して作成する絶対パスのリストです。これはディレクトリのクリーンアップのためにのみ使用してください。
ko: 애플리케이션을 시작하기 전에 삭제하고 나서 생성해야 할 절대 경로 목록입니다. 이는 디렉토리 정리 시에만 사용해야 합니다.
zh_cn: 启用应用程序之前要删除并创建的绝对路径列表。这仅适用于目录清理。

source: Refer to a Hive hive-config.xml file bundled in the workflow deployment directory. Pick a name different than hive-site.xml.
de: Sehen Sie nach einer Hive-Datei "hive-config.xml", die im Workflow-Bereitstellungsverzeichnis gebündelt ist. Verwenden Sie einen anderen Namen als "hive-site.xml".
es: Consulte un archivo hive-config.xml de Hive integrado en el directorio de implementación de workflow. Elija un nombre distinto a hive-site.xml.
fr: Référez-vous à un fichier hive-config.xml de Hive situé dans le répertoire de déploiement du workflow. Choisissez un nom différent de hive-site.xml.
ja: Workflow 配置ディレクトリにバンドルされている Hive hive-config.xml ファイルを参照してください。hive-site.xml とは異なる名前を選択します。
ko: workflow 배포 디렉토리에 포함된 Hive hive-config.xml 파일을 참조하십시오. hive-site.xml과 다른 이름을 선택합니다.
zh_cn: 请参考 Workflow 部署目录中包含的 Hive hive-config.xml 文件。选择不同于 hive-site.xml 的名称。

source: Command
de: Befehl
es: Comando
fr: Commande
ja: コマンド
ko: 명령
zh_cn: 命令

source: The full %(type)s command. Either put it here or split it by spaces and insert the parts as multiple parameters below.
de: Der vollständige %(type)s-Befehl. Geben Sie den Befehl hier ein, oder trennen Sie ihn mit Leerzeichen, und geben Sie die Teile unten als mehrere Parameter ein.
es: Comando %(type)s completo. Póngalo aquí o sepárelo con espacios e inserte las partes como varios parámetros a continuación.
fr: Commande %(type)s. Placez-la ici ou divisez-la avec des espaces et insérez chaque élément en tant que paramètres ci-dessous.
ja: 完全な %(type)s コマンドです。このコマンドをここに挿入するか、またはスペースで区切って下の複数のパラメータとしてパーツを挿入してください。
ko: 전체 %(type)s 명령입니다. 여기에 삽입하거나 명령을 공백으로 구분하여 여러 매개변수로 아래 삽입하십시오.
zh_cn: 完整 %(type)s 命令。将命令放在此处，或以空格对其进行拆分，然后将部分作为多参数插入下方。

source: If no command is specified, split the command by spaces and insert the %(type)s parameters here e.g. import, --connect, jdbc:hsqldb:file:db.hsqldb, ...
de: Wenn kein Befehl angegeben wird, trennen Sie den Befehl mit Leerzeichen, und fügen Sie die %(type)s-Parameter hier ein, z. B. import, --connect, jdbc:hsqldb:file:db.hsqldb, ...
es: Si no se ha especificado ningún comando, separe el comando con espacios e inserte los parámetros %(type)s aquí, p.ej. import, --connect, jdbc:hsqldb:file:db.hsqldb, ...
fr: Si aucune commande n'est indiquée, divisez la commande avec des espaces et insérez les paramètres %(type)s ici, par exemple import, --connect, jdbc:hsqldb:file:db.hsqldb, ...
ja: コマンドを指定しない場合は、コマンドをスペースで区切って %(type)s パラメータをここに挿入してください（例：import, --connect, jdbc:hsqldb:file:db.hsqldb, ...）。
ko: 지정된 명령이 없는 경우 여기서 명령을 공백으로 구분하고 %(type)s 매개변수를 삽입하십시오(예: import, --connect, jdbc:hsqldb:file:db.hsqldb...).
zh_cn: 如果未指定命令，可用空格拆分该命令并在此处插入 %(type)s 参数，如 import、--connect、jdbc:hsqldb:file:db.hsqldb 等

source: List of absolute paths to delete then to create before starting the application. This should be used exclusively for directory cleanup
de: Liste von absoluten Pfaden, die vor dem Starten der Anwendung gelöscht und dann erstellt werden sollen. Dies sollte ausschließlich für die Verzeichnisbereinigung verwendet werden.
es: Lista de rutas absolutas para eliminar y, a continuación, para crear antes de arrancar la aplicación. Se debería utilizar exclusivamente para limpiar el directorio
fr: Liste des chemins absolus à supprimer puis à créer avant le démarrage de l'application. A n'utiliser que pour le nettoyage des répertoires.
ja: アプリケーションを開始する前に削除して作成する絶対パスのリストです。これはディレクトリのクリーンアップのためにのみ使用してください
ko: 애플리케이션을 시작하기 전에 삭제하고 나서 생성해야 할 절대 경로 목록입니다. 이는 디렉토리 정리 시에만 사용해야 합니다.
zh_cn: 启用应用程序之前应删除并创建的绝对路径列表。这仅适用于目录清理

source: User
de: Benutzer
es: Usuario
fr: Utilisateur
ja: ユーザー
ko: 사용자
zh_cn: 用户

source: User executing the shell command.
de: Benutzer, der den Shell-Befehl ausführt.
es: Usuario ejecutando el comando shell.
fr: Utilisateur exécutant la commande de shell.
ja: shell コマンドを実行しているユーザーです。
ko: shell 명령을 실행하는 사용자입니다.
zh_cn: 用户正在执行 shell 命令。

source: Host
fr: Hôte
ja: ホスト
ko: 호스트
zh_cn: 主机

source: Where the shell will be executed.
de: Wo die Shell ausgeführt wird.
es: Dónde se va ejecutar el shell.
fr: Emplacement du shell à exécuter.
ja: shell が実行される場所です。
ko: shell이 실행될 장소입니다.
zh_cn: 将执行 shell 的位置。

source: %(type)s command
de: %(type)s-Befehl
es: comando %(type)s
fr: Commande %(type)s
ja: %(type)s コマンド
ko: %(type)s 명령
zh_cn: %(type)s 命令

source: The command that will be executed.
de: Der auszuführende Befehl.
es: El comando que se va a ejecutar.
fr: Commande qui sera exécutée.
ja: 実行するコマンドです。
ko: 실행될 명령입니다.
zh_cn: 将执行的命令。

source: The arguments of the %(type)s command.
de: Die Argumente des Befehls %(type)s.
es: Los argumentos del comando %(type)s.
fr: Arguments de la commande %(type)s.
ja: %(type)s コマンドの引数です。
ko: %(type)s 명령의 인수입니다.
zh_cn: %(type)s 命令的自变量。

source: Capture output of the stdout of the %(program)s command execution. The %(program)s command output must be in Java properties file format and it must not exceed 2KB. From within the workflow definition, the output of an %(program)s action node is accessible via the String action:output(String node, String key) function
de: Erfasst die stdout-Ausgabe für die Ausführung des Befehls %(program)s. Die Ausgabe des Befehls %(program)s muss im Java-Eigenschaftsdateiformat vorliegen und darf nicht größer als 2 KB sein. Innerhalb der Workflow-Definition ist die Ausgabe eines %(program)s-Aktionsknotens über die Funktion "String action:output(String node, String key)" zugänglich.
es: Capturar salida del stdout de la ejecución del comando %(program)s. La salida del comando %(program)s debe tener el formato de archivo de propiedades Java y no superar los 2 KB. Desde dentro de la definición de workflow, la salida de un nodo de acción %(program)s es accesible a través de la función String action:output(String node, String key)
fr: Sortie de capture stdout de l'exécution de la commande %(program)s. La sortie de la commande %(program)s doit figurer dans le format du fichier des propriétés Java mais ne doit pas dépasser 2 Ko. A partir de la définition du workflow, la sortie d'un noeud d'action %(program)s est accessible par le biais de la fonction String action:output(String node, String key).
ja: %(program)s コマンド実行の stdout の出力をキャプチャします。%(program)s コマンドの出力は、ファイルフォーマットが Java properties でなければならず、サイズが 2KB を超えてはなりません。%(program)s アクションノードの出力へは、Workflow 定義内から String action:output(String node, String key) 関数を使用してアクセスできます。
ko: %(program)s 명령 실행의 stdout 출력을 캡처합니다. %(program)s 명령 출력은 Java 속성 파일 형식이어야 하고 2KB를 초과할 수 없습니다. workflow 정의 내에서 %(program)s 동작 노드의 출력은 String action:output(String node, String key) 함수를 통해 액세스할 수 있습니다.
zh_cn: %(program)s 命令执行 StdOut 的捕获输出。%(program)s 命令输出必须为 Java 属性文件格式，且不得超过 2KB。在 workflow 定义中，可通过字符串 action:output（字符串节点，字符串密钥）功能访问 %(program)s 操作节点的输出

source: The path of the Shell command to execute.
de: Der Pfad des auszuführenden Shell-Befehls.
es: La ruta del comando Shell que se va a ejecutar.
fr: Chemin d'accès à la commande Shell à exécuter.
ja: 実行する Shell コマンドのパスです。
ko: 실행할 Shell 명령의 경로입니다.
zh_cn: 要执行的 Shell 命令的路径。

source: The arguments of Shell command can then be specified using one or more argument element.
de: Die Argumente des Shell-Befehls können anschließend mit einem oder mehreren Argumentelementen angegeben werden.
es: Los argumentos del comando shell se pueden especificar utilizando un elemento de argumento o más.
fr: Les arguments de la commande de shell peuvent alors être indiqués avec un ou plusieurs éléments d'argument.
ja: Shell コマンドの引数は、1 つまたは複数の引数要素を使用して指定できます。
ko: 그 다음 인수 요소를 하나 이상 사용하여 Shell 명령의 인수를 지정할 수 있습니다.
zh_cn: 使用一个或多个参数元素可指定 Shell 命令的参数。

source: The arguments of the %(type)s command. Put options first, then source paths, then destination path.
de: Die Argumente des Befehls %(type)s. Geben Sie zuerst die Optionen, dann die Quellpfade und dann den Zielpfad an.
es: Argumentos del comando %(type)s. Ponga primero las opciones, luego las rutas de origen y, por último, la ruta de destino.
fr: Arguments de la commande %(type)s. Placez les options en premier, puis les chemins sources et enfin le chemin de destination.
ja: %(type)s コマンドの引数です。オプション、ソースパス、宛先パスの順に挿入してください。
ko: %(type)s 명령의 인수입니다. 맨 앞에 옵션, 그 다음 소스 경로, 그 다음 대상 경로를 지정합니다.
zh_cn: %(type)s 命令的参数。先放置选项，然后是源路径，接下来是目标路径。

source: For the job configuration (e.g. mapred.job.queue.name=production
de: Für die Job-Konfiguration (z.B. mapred.job.queue.name=production)
es: Para la configuración del trabajo (p. ej., mapred.job.queue.name=production
fr: Pour la configuration du job (par exemple, mapred.job.queue.name=production
ja: ジョブ設定用（例：mapred.job.queue.name=production
ko: Job 구성용(예: mapred.job.queue.name=production
zh_cn: 对于作业配置（如 mapred.job.queue.name=production

source: Delete path
de: Pfad löschen
es: Eliminar ruta
fr: Supprimer le chemin d'accès
ja: パスを削除
ko: 경로 삭제
zh_cn: 删除路径

source: Delete the specified path, if it is a directory it deletes recursively all its content and then deletes the directory.
de: Angegebenen Pfad löschen; wenn es sich um ein Verzeichnis handelt, werden alle Inhalte rekursiv gelöscht, und anschließend wird das Verzeichnis gelöscht.
es: Eliminar la ruta especificada: si es un directorio, se elimina de forma recursiva todo su contenido y, a continuación, se elimina el directorio.
fr: Supprimer le chemin spécifié. S'il s'agit d'un répertoire, cette opération supprime le contenu du répertoire de manière récurrente, puis le répertoire lui-même.
ja: 指定されたパスを削除します。このパスがディレクトリである場合、その内容すべてが再帰的に削除され、その後、ディレクトリ自体が削除されます。
ko: 지정된 경로를 삭제하십시오. 지정된 경로가 디렉토리인 경우 경로의 콘텐츠가 재귀적으로 모두 삭제된 다음 디렉토리가 삭제됩니다.
zh_cn: 删除指定的路径，如果为目录，将递归地删除所有内容，然后删除目录。

source: Create directory
de: Verzeichnis erstellen
es: Crear directorio
fr: Créer un répertoire
ja: ディレクトリを作成
ko: 디렉토리 생성
zh_cn: 创建目录

source: Create the specified directory, it creates all missing directories in the path. If the directory already exist it does a no-op.
de: Angegebenes Verzeichnis erstellen; alle fehlenden Verzeichnisse in dem Pfad werden erstellt. Ist das Verzeichnis bereits vorhanden, wird ein NO-OP ausgeführt.
es: Crear el directorio especificado: se crean todos los directorios que faltan en la ruta. Si el directorio ya existe, lleva a cabo una no operación.
fr: Créer le répertoire spécifié. Cette opération crée tous les répertoires manquants dans le chemin. Si le répertoire existe déjà, aucune opération n'est effectuée.
ja: 指定されたディレクトリを作成します。パスで不足しているディレクトリもすべて作成されます。指定されたディレクトリがすでに存在する場合は何も行われません。
ko: 지정된 디렉토리를 생성하면 누락된 모든 디렉토리를 경로에 생성합니다. 디렉토리가 이미 존재하면 작업을 수행하지 않습니다.
zh_cn: 创建指定的目录，在路径中创建所有遗漏的目录。如果目录已存在，则无操作。

source: Move file
de: Datei verschieben
es: Mover archivo
fr: Déplacer un fichier
ja: ファイルを移動
ko: 파일 이동
zh_cn: 移动文件

source: Move a file or directory to another path.
de: Datei oder Verzeichnis in einen anderen Pfad verschieben.
es: Mueve un archivo o directorio a otra ruta.
fr: Déplacer un fichier ou un répertoire vers un autre chemin.
ja: ファイルまたはディレクトリを別のパスに移動します。
ko: 파일 또는 디렉토리를 다른 경로로 이동합니다.
zh_cn: 将文件或目录移至另一个路径。

source: Change permissions
de: Berechtigungen ändern
es: Cambiar permisos
fr: Modifier les autorisations
ja: パーミッションを変更
ko: 권한 변경
zh_cn: 更改权限

source: Change the permissions for the specified path. Permissions can be specified using the Unix Symbolic representation (e.g. -rwxrw-rw-) or an octal representation (755).
de: Berechtigungen für den angegebenen Pfad ändern. Berechtigungen können anhand einer symbolischen Unix-Darstellung (z. B. -rwxrw-rw-) oder einer Oktaldarstellung (755) angegeben werden.
es: Cambia los permisos para la ruta especificada. Los permisos pueden especificarse mediante la representación simbólica de Unix (p. ej., -rwxrw-rw-) o una representación octal (755).
fr: Modifier les autorisations pour le chemin spécifié. Les autorisations peuvent être spécifiées à l'aide de la représentation symbolique Unix (par exemple, -rwxrw-rw-) ou une représentation octale (755).
ja: 指定されたパスのパーミッションを変更します。パーミッションは、UNIX の記号表現（例：-rwxrw-rw-）または 8 進数表現（755）を使用して指定できます。
ko: 지정된 경로의 권한을 변경하십시오. 권한은 Unix Symbolic 표현(예: -rwxrw-rw-) 또는 8진수 표현(755)을 사용하여 지정할 수 있습니다.
zh_cn: 更改指定路径的权限。可使用 Unix 符号（例如 -rwxrw-rw-）或八进制数 (755) 指定权限。

source: Create or touch a file
de: Datei erstellen oder Änderungszeitstempel über Touch aktualisieren
es: Crear o tocar un archivo
fr: Créer un fichier ou y accéder via la commande touch
ja: ファイルを作成またはタッチ
ko: 파일 생성 또는 파일 날짜 변경
zh_cn: 创建或触按文件

source: Creates a zero length file in the specified path if none exists or touch it.
de: Erstellt im angegebenen Pfad eine Datei mit der Länge Null, wenn keine existiert oder der Änderungszeitstempel über Touch aktualisiert wird.
es: Crea un archivo de longitud cero en la ruta especificada si no existe ninguno o crea un archivo nuevo vacío a través de la utilidad touch.
fr: Crée un fichier de longueur zéro dans le chemin spécifié, s'il n'en existe aucun, ou y accède via la commande touch.
ja: ファイルが存在しない、またはファイルをタッチした場合、指定されたパスに長さ 0 のファイルを作成します。
ko: 파일이 존재하지 않으면 지정된 경로에 길이가 0인 파일을 생성하거나 파일의 날짜를 변경합니다.
zh_cn: 如果没有文件或未触按文件，在指定的路径中创建零长度文件。

source: TO addresses
de: TO-Adressen
es: Direcciones de envío
fr: Adresses des destinataires
ja: 送信先アドレス
ko: 받는 사람 주소
zh_cn: 接收地址

source: Comma-separated values.
de: Durch Kommas getrennte Werte.
es: Valores separados por comas.
fr: Valeurs séparées par des virgules.
ja: カンマ区切り値。
ko: 쉼표로 구분된 값입니다.
zh_cn: 用逗号分开的值。

source: CC addresses (optional)
de: CC-Adressen (optional)
es: Direcciones de copia (opcional)
fr: Adresses des destinataires en copie (facultatif)
ja: CC アドレス（オプション）
ko: 참조 주소(선택 사항)
zh_cn: 抄送地址（可选）

source: Subject
de: Betreff
es: Asunto
fr: Objet
ja: 件名
ko: 제목
zh_cn: 主题

source: Plain-text.
de: Nur-Text.
es: Texto sin formato.
fr: Texte en clair.
ja: プレーンテキストです。
ko: 일반 텍스트입니다.
zh_cn: 纯文本。

source: Body
de: Text
es: Cuerpo
fr: Corps
ja: 本文
ko: 본문
zh_cn: 主体

source: Sub-workflow
de: Unterworkflow
fr: Sous-workflow
ja: サブ Workflow
zh_cn: 子 Workflow

source: The sub-workflow application to include. You must own all the sub-workflows.
de: Zu berücksichtigende Unterworkflow-Anwendung. Sie müssen alle Unterworkflows besitzen.
es: La aplicación de subworkflow que se va a incluir. Debe ser propietario de todos los subworkflows.
fr: Application de sous-workflow à inclure. Vous devez posséder tous les sous-workflows.
ja: 含めるサブ Workflow アプリケーションです。すべてのサブ Workflow を所有している必要があります。
ko: 포함할 Sub workflow 애플리케이션입니다. 모든 Sub workflow를 소유해야 합니다.
zh_cn: 要包括的子 Workflow 应用程序。您必须拥有所有子 Workflow。

source: Propagate configuration
de: Konfiguration verteilen
es: Propagar configuración
fr: Propager la configuration
ja: 設定を伝達
ko: 구성 전파
zh_cn: 传送配置

source: If the workflow job configuration should be propagated to the child workflow.
de: Wenn die Jobkonfiguration des Workflows an den untergeordneten Workflow verteilt werden soll.
es: Si la configuración del job de workflow debe propagarse al workflow secundario.
fr: Si la configuration du job de workflow doit être propagée au workflow enfant.
ja: Workflow ジョブの設定を子 Workflow に伝達すべきかどうか。
ko: workflow 작업 구성을 Sub workflow로 전파해야 하는 경우입니다
zh_cn: 如果 workflow 作业配置应传送至子级 workflow。

source: Can be used to specify the job properties that are required to run the child workflow job.
de: Kann zur Angabe der Jobeigenschaften verwendet werden, die für die Ausführung des untergeordneten Workflowjobs erforderlich sind.
es: Puede usarse para especificar las propiedades del job necesarias para ejecutar el job del workflow secundario.
fr: Peut être utilisé pour spécifier les propriétés du job qui sont nécessaires à l'exécution du job du workflow enfant.
ja: 子 Workflow ジョブの実行に必要なジョブプロパティの指定に使用できます。
ko: 하위 workflow 작업을 실행하는 데 필요한 작업 속성을 지정하는 데 사용할 수 있습니다.
zh_cn: 可用来指定作业属性，以便用于运行子级 workflow 作业。

source: XML of the custom action
de: XML der benutzerdefinierten Aktion
es: XML de la acción personalizada
fr: XML de l'action personnalisée
ja: カスタムアクションの XML
ko: 사용자 지정 작업의 XML
zh_cn: 自定义操作的 XML

source: This will be inserted verbatim in the action %(action)s. E.g. all the XML content like %(xml_action)s will be inserted into the action and produce %(full_action)s
de: Dies wird exakt in die Aktion %(action)s eingefügt, z. B. werden alle XML-Inhalte wie %(xml_action)s in die Aktion eingefügt und erzeugen %(full_action)s.
es: Esto se insertará literalmente en la acción %(action)s. P. ej., todo el contenido XML, como %(xml_action)s, se insertará en la acción y producirá %(full_action)s
fr: Inséré verbatim dans l'action %(action)s : le contenu XML tel que %(xml_action)s sera inséré dans l'action et produira %(full_action)s
ja: これはすべてそのままアクション %(action)s に挿入されます。たとえば、%(xml_action)s のような XML コンテンツはすべて、アクションに挿入され、%(full_action)s が生成されます
ko: %(action)s 작업에 삽입되는 verbatim입니다. 예를 들어. %(xml_action)s와(과) 같은 모든 XML 콘텐츠가 작업에 삽입되면 %(full_action)s을(를) 생성합니다.
zh_cn: 这将逐字嵌入操作 %(action)s 中。例如，所有 XML 内容，如 %(xml_action)s，将嵌入操作中并产生 %(full_action)s

source: End should not have any children.
de: Das Ende darf keine untergeordneten Elemente aufweisen.
es: La finalización no debe contener elementos secundarios.
fr: La fin ne doit avoir aucun enfant.
ja: 終了に子を設定することはできません。
ko: 끝에 하위 항목을 포함할 수 없습니다.
zh_cn: 末端不应具有任何子项。

source: Kill should not have any children.
de: Beenden darf keine untergeordneten Elemente aufweisen.
es: La eliminación no debe contener elementos secundarios.
fr: L'opération Détruire ne doit avoir aucun enfant.
ja: 強制終了に子を設定することはできません。
ko: 중지는 하위 항목을 포함할 수 없습니다.
zh_cn: 停止位置不应具有任何子项。

source: Minutes
de: Minuten
es: Minutos
ja: 分
ko: 분
zh_cn: 分钟

source: Hours
de: Stunden
es: Horas
fr: Heures
ja: 時間
ko: 시간
zh_cn: 小时
