Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: This bundle has no defined coordinators.
de: Für dieses Bundle wurden keine Coordinators definiert.
es: Este bundle no tiene coordinators definidos.
fr: Ce bundle n'a pas de coordinator défini.
ja: この Bundle には、定義されている Coordinator がありません。
ko: 이 Bundle에 정의된 Coordinator가 없습니다.
zh_cn: 此 Bundle 未定义 Coordinator。

source: Add a coordinator
de: Coordinator hinzufügen
es: Añadir un coordinator
fr: Ajouter un coordinator
ja: Coordinator を追加
ko: Coordinator 추가
zh_cn: 添加 Coordinator

source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
ja: 開く
ko: 열기
zh_cn: 打开

source: Add a parameter
de: Parameter hinzufügen
es: Añadir un parámetro
fr: Ajouter un paramètre
ja: パラメーターを追加
ko: 매개변수 추가
zh_cn: 添加参数

source: Choose a coordinator
de: Coordinator auswählen
es: Elegir un coordinator
fr: Choisir un coordinator
ja: Coordinator を選択
ko: Coordinator 선택
zh_cn: 选择 Coordinator

source: Filter coordinators
de: Coordinators filtern
es: Filtrar coordinators
fr: Filtrer les coordinators
ja: Coordinator のフィルタ処理
ko: Coordinator 필터링
zh_cn: 筛选 Coordinator

source: There are no coordinators matching your search term.
de: Ihren Suchkriterien entsprechen keine Coordinators.
es: Ningún coordinator coincide con el término de búsqueda.
fr: Aucun coordinator ne correspond à votre terme de recherche.
ja: 検索条件に一致する Coordinator はありません。
ko: 검색어와 일치하는 Coordinator가 없습니다.
zh_cn: 没有符合您的搜索词的 coordinator。

source: Submission Parameters
de: Sendeparameter
es: Parámetros de envío
fr: Paramètres d'envoi
ja: サブミッションパラメーター
ko: 제출 매개변수
zh_cn: 提交参数

source: Add parameter
de: Parameter hinzufügen
es: Añadir parámetro
fr: Ajouter un paramètre
ja: パラメーターを追加
ko: 매개변수 추가
zh_cn: 添加参数

source: Now
de: Jetzt
es: Ahora
fr: Maintenant
ja: 今すぐ
ko: 지금
zh_cn: 现在

source: Bundle submitted.
de: Bundle gesendet.
es: Bundle enviado.
fr: Bundle envoyé.
ja: Bundle がサブミットされました。
ko: Bundle을 제출했습니다.
zh_cn: 已提交 Bundle。

source: Which workflow to schedule?
de: Welche Workflows sollen geplant werden?
es: ¿Qué workflow se debe programar?
fr: Quel workflow à planifier ?
ja: どの Workflow をスケジュールしますか？
ko: 예정된 Workflow는 무엇입니까?
zh_cn: 要计划哪个 Workflow？

source: Choose a workflow...
de: Workflow nicht auswählen...
es: Elegir un workflow...
fr: Choisir un workflow...
ja: Workflow を選択...
ko: Workflow 선택...
zh_cn: 选择 Workflow...

source: How often?
de: Wie oft?
es: ¿Con qué frecuencia?
fr: A quelle fréquence ?
ja: 頻度を指定してください
ko: 간격은 얼마입니까?
zh_cn: 频率？

source: Options
de: Optionen
es: Opciones
ja: オプション
ko: 옵션
zh_cn: 选项

source: Hide
de: Ausblenden
es: Ocultar
fr: Masquer
ja: 非表示
ko: 숨기기
zh_cn: 隐藏

source: Advanced syntax
de: Erweiterte Syntax
es: Sintaxis avanzada
fr: Syntaxe avancée
ja: 高度な構文
ko: 고급 구문
zh_cn: 高级语法

source: From
de: Von
es: de
fr: De
ja: 開始
ko: 원본
zh_cn: 自

source: To
de: Bis
es: a
fr: A
zh_cn: 至

source: This coordinator has no defined parameters.
de: Keine definierten Parameter für diesen Coordinator.
es: Este coordinator no tiene parámetros definidos.
fr: Ce coordinator n'a aucun paramètre défini.
ja: この Coordinator には、定義済みのパラメーターがありません。
ko: 이 Coordinator에 정의된 매개변수가 없습니다.
zh_cn: 此 Coordinator 未定义参数。

source: Parameter
es: Parámetro
fr: Paramètre
ja: パラメーター
ko: 매개변수
zh_cn: 参数

source: Input Path
de: Eingabepfad
es: Ruta de entrada
fr: Chemin d'entrée
ja: 入力パス
ko: 입력 경로
zh_cn: 输入路径

source: Output Path
de: Ausgabepfad
es: Ruta de salida
fr: Chemin de sortie
ja: 出力パス
ko: 출력 경로
zh_cn: 输出路径

source: Will convert to
de: Wird umgewandelt
es: Se convertirá en
fr: Convertira en
ja: 変換先
ko: 다음으로 변환
zh_cn: 将转换为

source: Same frequency
de: Gleiche Frequenz
es: Misma frecuencia
fr: Même fréquence
ja: 同じ頻度
ko: 동일한 빈도
zh_cn: 相同频率

source: Same start
de: Gleicher Start
es: Mismo inicio
fr: Même début
ja: 同じ開始
ko: 동일한 시작
zh_cn: 相同起始

source: Same timezone
de: Gleiche Zeitzone
es: Misma franja horaria
fr: Même fuseau horaire
ja: 同じタイムゾーン
ko: 동일한 시간대
zh_cn: 相同时区

source: Choose a workflow
de: Workflow auswählen
es: Elegir un workflow
fr: Choisir un workflow
ja: Workflow を選択
ko: Workflow 선택
zh_cn: 选择 Workflow

source: Filter workflows
de: Workflows filtern
es: Filtrar workflows
fr: Filtrer les workflows
ja: Workflow をフィルター処理
ko: Workflow 필터링
zh_cn: 筛选 Workflow

source: There are no workflows matching your search term.
de: Ihren Suchkriterien entsprechen keine Workflows.
es: Ningún workflow coincide con el término de búsqueda.
fr: Aucun workflow ne correspond à votre terme de recherche.
ja: 検索条件に一致する Workflow はありません。
ko: 검색어와 일치하는 Workflow가 없습니다.
zh_cn: 没有符合您的搜索词的 workflow。

source: Coordinator Settings
de: Coordinator-Einstellungen
es: Ajustes de coordinator
fr: Paramètres du coordinator
ja: Coordinator の設定
ko: Coordinator 설정
zh_cn: Coordinator 设置

source: FIFO (oldest first)
de: FIFO (Älteste zuerst)
es: LIFO (más antiguas primero)
fr: FIFO (le plus ancien d'abord)
ja: FIFO（最も古いものを先に実行）
ko: FIFO(가장 이전 것 먼저)
zh_cn: FIFO（先进先出）

source: This workflow was imported from an old Hue version, save it to create a copy in the new format or
de: Dieser Workflow wurde aus einer alten Version von Hue importiert. Speichern Sie ihn, um eine Kopie im neuen Format zu erstellen, oder
es: Este workflow se importó de una versión anterior de Hue. Guárdelo para crear una copia en el nuevo formato o
fr: Le workflow a été importé depuis une ancienne version de Hue, enregistrez-le pour en créer une copie dans le nouveau format ou
ja: この Workflow は、以前の Hue バージョンからインポートされ、新しい形式でコピーを作成するために保存されました。または
ko: 이 Workflow는 이전 Hue 버전에서 가져왔습니다. 저장한 후 새 형식으로 사본을 작성하거나
zh_cn: 已从旧 Hue 版本导入此 Workflow，将其保存，以新格式创建副本或

source: open it in the old editor.
de: öffnen Sie ihn im alten Editor.
es: ábralo en el editor antiguo.
fr: ouvrez-le dans l'ancien éditeur.
ja: 古いエディタで開いてください。
ko: 이전 편집기에서 여십시오.
zh_cn: 在旧编辑器中打开它。

source: Drop your action here
de: Fügen Sie Ihre Aktion hier ein.
es: Envíe su acción aquí
fr: Déposer votre action ici
ja: ここにアクションをドロップします
ko: 여기에 작업 두기
zh_cn: 将您的操作拖到此处

source: Move node
de: Knoten verschieben
es: Mover nodo
fr: Déplacer un nœud
ja: ノードを移動
ko: 노드 이동
zh_cn: 移动节点

source: Copy node
de: Knoten kopieren
es: Copiar nodo
fr: Copier un nœud
ja: ノードをコピー
ko: 노드 복사
zh_cn: 复制节点

source: Hive icon
de: Hive-Symbol
es: Icono de Hive
fr: Icône Hive
ja: Hive アイコン
ko: Hive 아이콘
zh_cn: Hive 图标

source: Impala icon
de: Impala-Symbol
es: Icono de Impala
fr: Icône Impala
ja: Impala アイコン
ko: Impala 아이콘
zh_cn: Impala 图标

source: Pig icon
de: Pig-Symbol
es: Icono de Pig
fr: Icône Pig
ja: Pig アイコン
ko: Pig 아이콘
zh_cn: Pig 图标

source: Sqoop icon
de: Sqoop-Symbol
es: Icono de Sqoop
fr: Icône Sqoop
ja: Sqoop アイコン
ko: Sqoop 아이콘
zh_cn: Sqoop 图标

source: Spark icon
de: Spark-Symbol
es: Icono de Spark
fr: Icône Spark
ja: Spark アイコン
ko: Spark 아이콘
zh_cn: Spark 图标

source: Click for more
de: Hier klicken für weitere Informationen
es: Haga clic para más
fr: Cliquer pour en savoir plus
ja: クリックして詳細を表示
ko: 자세한 내용을 보려면 클릭
zh_cn: 单击获取更多信息

source: Click for more info
de: Hier klicken für weitere Informationen
es: Haga clic para obtener más información
fr: Cliquez pour plus d'infos
ja: クリックして詳細を表示
ko: 자세한 내용을 보려면 클릭
zh_cn: 单击获取更多信息

source: If
de: Wenn
es: Si
fr: Si
ja: 条件
ko: 만약
zh_cn: 如果

source: Jump to another node
de: Zu einem anderen Knoten wechseln
es: Saltar a otro nodo
fr: Passer à un autre nœud
ja: 別のノードにジャンプ
ko: 다른 노드로 이동
zh_cn: 跳转到另一节点

source: It is where we finish if failure!
de: Beim Auftreten eines Fehlers wird an dieser Stelle beendet.
es: ¡Es donde terminamos si se produce un fallo!
fr: C'est ici que nous terminons en cas de panne !
ja: 失敗した場合はここで終了します
ko: 실패할 경우 완료한 위치입니다!
zh_cn: 这是失败时我们的完成位置！

source: Email on error
de: E-Mail zum Fehler
es: Enviar correo electrónico de error
fr: Courriel en erreur
ja: エラーに基づく電子メール
ko: 오류 발생 시 Email
zh_cn: 电子邮件错误

source: It is where we start!
de: An dieser Stelle wird begonnen.
es: ¡Es donde empezamos!
fr: C'est ici que nous commençons !
ja: ここから開始します
ko: 시작한 위치입니다!
zh_cn: 这是我们的起始位置！

source: It is where we successfully finish!
de: An dieser Stelle wird erfolgreich beendet.
es: ¡Es donde terminamos correctamente!
fr: C'est ici que nous terminons en cas de succès !
ja: ここで正常に終了しました
ko: 성공적으로 완료한 위치입니다!
zh_cn: 这是我们成功完成的位置！

source: Directory
de: Verzeichnis
es: Directorio
fr: Répertoire
ja: ディレクトリ
ko: 디렉토리
zh_cn: 目录

source: name, e.g. mapred.job.queue.name
de: Name, z.B. mapred.job.queue.name
es: nombre, p. ej., mapred.job.queue.name
fr: nom (exemple : mapred.job.queue.name)
ja: 名前（mapred.job.queue.name など）
ko: 이름(예: mapred.job.queue.name)
zh_cn: 名称，例如 mapred.job.queue.name

source: No properties defined.
de: Keine Eigenschaften definiert.
es: No se han definido propiedades.
fr: Aucune propriété définie.
ja: プロパティが定義されていません。
ko: 속성이 정의되지 않았습니다.
zh_cn: 未定义属性。

source: No archives defined.
de: Keine Archive definiert.
es: No se han definido archivos.
fr: Aucune archive définie.
ja: アーカイブが定義されていません。
ko: 아카이브가 정의되지 않았습니다.
zh_cn: 未定义存档。

source: Retry
de: Erneut versuchen
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 재시도
zh_cn: 重试

source: Max
es: Máx.
ja: 最大
ko: 최대
zh_cn: 最大

source: Interval
de: Intervall
es: Intervalo
fr: Intervalle
ja: 間隔
ko: 간격
zh_cn: 间隔

source: No arguments defined.
de: Keine Argumente definiert.
es: No se han definido argumentos.
fr: Aucun argument défini.
ja: 引数が定義されていません。
ko: 인수가 정의되지 않았습니다.
zh_cn: 未定义参数。

source: No available credentials.
de: Keine Zugangsdaten vorhanden.
es: No hay credenciales disponibles.
fr: Aucune information d'identification disponible.
ja: 使用可能な資格情報がありません。
ko: 사용 가능한 자격 증명이 없습니다.
zh_cn: 无可用凭据。

source: Requires hbase-site.xml in job path
de: Erfordert "hbase-site.xml" im Jobpfad
es: Requiere hbase-site.xml en la ruta al job
fr: Nécessite hbase-site.xml dans le chemin d'accès au job
ja: ジョブのパスには hbase-site.xml が必要です
ko: Job 경로에 hbase-site.xml 필요
zh_cn: 作业路径中需要 hbase-site.xml

source: Search your documents...
de: Dokumente durchsuchen...
es: Buscar documentos...
fr: Rechercher vos documents…
ja: ドキュメントを検索...
ko: 문서 검색...
zh_cn: 搜索文档...

source: View logs
de: Protokolle anzeigen
es: Ver registros
fr: Afficher les journaux
ja: ログを表示
ko: 로그 보기
zh_cn: 查看日志

source: View the workflow
de: Workflow anzeigen
es: Ver el workflow
fr: Afficher le workflow
ja: Workflow を表示
ko: Workflow 보기
zh_cn: 查看 Workflow

source: Oozie workflow icon
de: Oozie Workflow-Symbol
es: Icono del flujo de trabajo de Oozie
fr: Icône Workflow Oozie
ja: Oozie Workflow アイコン
ko: Oozie Workflow 아이콘
zh_cn: Oozie Workflow 图标

source: Transitions
de: Übergänge
es: Transiciones
ja: 移行
ko: 전환
zh_cn: 转换

source: Name, e.g. input
de: Name, z. B. input
es: Nombre, p. ej., entrada
fr: Nom, par ex. entrée
ja: 名前。入力など
ko: 이름(예: input)
zh_cn: 名称，例如，输入

source: to
de: bis
es: a
fr: vers
ja: 先
zh_cn: 至

source: Source path
de: Quellpfad
es: Ruta de origen
fr: Chemin d'accès de la source
ja: ソースパス
ko: 소스 경로
zh_cn: 来源路径

source: New destination path
de: Neuer Zielpfad
es: Nueva ruta de destino
fr: Nouveau chemin d'accès de la destination
ja: 新しい目的のパス
ko: 새 대상 경로
zh_cn: 新目标路径

source: Only for directories
de: Nur für Verzeichnisse
es: Solo para directorios
fr: Uniquement pour les répertoires
ja: ディレクトリのみ
ko: 디렉토리만
zh_cn: 仅限目录

source: Recursive to sub directories
de: Rekursiv für Unterverzeichnisse
es: Recursivo para subdirectorios
fr: De façon récursive vers les sous-répertoires
ja: サブディレクトリに再帰的
ko: 하위 디렉토리로 재귀
zh_cn: 递归到子目录

source: e.g. newgroup
de: z. B. newgroup
es: p. ej., gruponuevo
fr: ex. : nouveaugroupe
ja: Newgroup など
ko: 예: newgroup
zh_cn: 例如，新组

source: About
de: Info
es: Acerca de
fr: A propos
ja: バージョン情報
ko: 정보
zh_cn: 关于

source: Schedules
de: Zeitpläne
es: Programas
fr: Planifications
ko: 일정
zh_cn: 计划

source: Schedule submitted.
de: Zeitplan wurde übermittelt.
es: Programa enviado.
fr: Planification envoyée.
ko: 일정을 제출했습니다.
zh_cn: 已提交计划。

source: Workflow Editor
es: Editor de workflow
fr: Editeur de workflows
ko: Workflow 편집기
zh_cn: Workflow 编辑器

source: Submit %(job)s?
de: %(job)s senden?
es: ¿Enviar %(job)s?
fr: Envoyer %(job)s ?
ja: %(job)s をサブミットしますか？
ko: %(job)s을(를) 제출하시겠습니까?
zh_cn: 提交 %(job)s？

source: Do a dryrun before submitting the job
de: Vor dem Senden des Jobs Testlauf durchführen
es: Realizar un simulacro antes de enviar el job
fr: Faire un essai d'exécution avant d'envoyer le job
ja: ジョブのサブミット前にドライランを実行
ko: Job을 제출하기 전에 모의 테스트 진행
zh_cn: 提交作业前试运行

source: Send completion email to
de: Nach Fertigstellung E-Mail senden an
es: Enviar correo electrónico de finalización a
fr: Envoyer l'e-mail d'achèvement à
ja: 完了電子メールを送信：
ko: 완료 이메일을 보낼 대상:
zh_cn: 发送完成电子邮件至

source: Email not set in
de: Keine E-Mail-Adresse im Profil
es: Correo electrónico no establecido en
fr: E-mail non défini dans
ja: 電子メールが
ko: 이메일이 설정되지 않은 위치:
zh_cn: 电子邮件未在

source: profile.
de: festgelegt.
es: perfil.
fr: le profil.
ja: プロファイルに設定されていません。
ko: 프로파일.
zh_cn: 配置文件中设置。

source: Go upload additional files and libraries to the deployment directory
de: Weitere Dateien und Bibliotheken in das Bereitstellungsverzeichnis hochladen
es: Cargar archivos y bibliotecas adicionales en el directorio de implementación
fr: Chargez les fichiers et les bibliothèques supplémentaires vers le répertoire de déploiement
ja: 追加のファイルとライブラリを配置ディレクトリにアップロードしてください
ko: 배포 디렉토리에 추가 파일 및 라이브러리 업로드
zh_cn: 将其他文件和库上传到部署目录

source: DOCUMENTS
de: DOKUMENTE
es: DOCUMENTOS
ja: ドキュメント
ko: 문서
zh_cn: 文档

source: ACTIONS
de: AKTIONEN
es: ACCIONES
ja: アクション
ko: 작업
zh_cn: 操作

source: Documents
de: Dokumente
es: Documentos
ja: ドキュメント
ko: 문서
zh_cn: 文档

source: Saved Java program
de: Gespeichertes Java-Programm
es: Programa Java guardado
fr: Programme Java enregistré
ja: 保存済み Java プログラム
ko: 저장된 Java 프로그램
zh_cn: 已保存 Java 程序

source: Saved Spark program
de: Gespeichertes Spark-Programm
es: Programa Spark guardado
fr: Programme Spark enregistré
ja: 保存済み Spark プログラム
ko: 저장된 Spark 프로그램
zh_cn: 已保存 Spark 程序

source: Saved Pig script
de: Gespeichertes Pig-Skript
es: Secuencia de comandos de Pig guardada
fr: Script Pig enregistré
ja: 保存済み Pig スクリプト
ko: 저장된 Pig 스크립트
zh_cn: 已保存 Pig 脚本

source: Saved MapReduce job
de: Gespeicherter MapReduce-Job
es: Job de MapReduce guardado
fr: Job MapReduce enregistré
ja: 保存済み MapReduce ジョブ
ko: 저장된 MapReduce Job
zh_cn: 已保存 MapReduce 作业

source: Saved Sqoop command
de: Gespeicherter Sqoop-Befehl
es: Comando de Sqoop guardado
fr: Commande Sqoop enregistrée
ja: 保存済み Sqoop コマンド
ko: 저장된 Sqoop 명령
zh_cn: 已保存 Sqoop 命令

source: Saved DistCp command
de: Gespeicherter DistCp-Befehl
es: Comando de DistCp guardado
fr: Commande DistCp enregistrée
ja: 保存済み DistCp コマンド
ko: 저장된 DistCp 명령
zh_cn: 已保存 DistCp 命令

source: Saved Shell command
de: Gespeicherter Shell-Befehl
es: Comando de Shell guardado
fr: Commande Shell enregistrée
ja: 保存済み Shell コマンド
ko: 저장된 Shell 명령
zh_cn: 已保存 Shell 命令

source: Hive Script
de: Hive-Skript
es: Secuencia de comandos de Hive
fr: Script Hive
ja: Hive スクリプト
ko: Hive 스크립트
zh_cn: Hive 脚本

source: HiveServer2 Script
de: HiveServer2-Skript
es: Secuencia de comandos del servidor Hive 2
fr: Script HiveServer2
ja: HiveServer2 スクリプト
ko: HiveServer2 스크립트
zh_cn: HiveServer2 脚本

source: Impala Script
de: Impala-Skript
es: Secuencia de comandos de Impala
fr: Script Impala
ja: Impala スクリプト
ko: Impala 스크립트
zh_cn: Impala 脚本

source: Pig Script
de: Pig-Skript
es: Secuencia de comandos de Pig
fr: Script Pig
ja: Pig スクリプト
ko: Pig 스크립트
zh_cn: Pig 脚本

source: MapReduce job
es: Job de MapReduce
fr: Job MapReduce
ja: MapReduce ジョブ
zh_cn: MapReduce 作业

source: Sub workflow
de: Unterworkflow
fr: Sous-workflow
ja: サブ Workflow
ko: 하위 Workflow
zh_cn: 子 Workflow

source: Email
fr: Courriel
ja: 電子メール
zh_cn: 电子邮件

source: Streaming
de: Wird übertragen
es: Transmisión
ja: ストリーミング
ko: 스트리밍
zh_cn: 数据流

source: Generic
de: Allgemein
fr: Générique
ja: 汎用
zh_cn: 通用

source: Select some file systems operations after adding the action.
de: Wählen Sie nach dem Hinzufügen der Aktion einige Dateisystemvorgänge aus.
es: Seleccione algunas operaciones de sistemas de archivo tras añadir la acción.
fr: Sélectionnez quelques opérations de systèmes de fichiers après avoir ajouté l'action.
ja: アクションの追加後、ファイルシステム操作を選択します。
ko: 작업을 추가한 후 일부 파일 시스템 작업을 선택합니다.
zh_cn: 添加此操作后选择一些文件系统操作。

source: e.g. ${nameNode1}/path/to/input.txt
de: z. B. ${nameNode1}/path/to/input.txt
es: p. ej., ${nameNode1}/ruta/a/entrada.txt
fr: par ex. ${nameNode1}/path/to/input.txt
ja: ${nameNode1}/path/to/input.txt など
ko: 예: ${nameNode1}/path/to/input.txt
zh_cn: 例如，${nameNode1}/path/to/input.txt

source: e.g. ${nameNode2}/path/to/output.txt
de: z. B. ${nameNode2}/path/to/output.txt
es: p. ej., ${nameNode2}/ruta/a/salida.txt
fr: par ex. ${nameNode2}/path/to/output.txt
ja: ${nameNode2}/path/to/output.txt など
ko: 예: ${nameNode2}/path/to/output.txt
zh_cn: 例如，${nameNode2}/path/to/output.txt

source: Workflow Settings
de: Workflow-Einstellungen
es: Ajustes de workflow
fr: Paramètres de workflow
ja: Workflow 設定
ko: Workflow 설정
zh_cn: Workflow 设置

source: Name, e.g. market
de: Name, z. B. market
es: Nombre, p. ej., mercado
fr: Nom, par ex. marché
ja: 名前。market など
ko: 이름(예: market)
zh_cn: 名称，例如，市场

source: Value, e.g. US
de: Wert, z. B. US
es: Valor, p. ej., EE. UU.
fr: Valeur, par ex. Etats-Unis
ja: 値。US など
ko: 값(예: US)
zh_cn: 值，例如，US

source: Name, e.g. mapred.map.tasks
de: Name, z. B. mapred.map.tasks
es: Nombre, p. ej., mapred.map.tasks
fr: Nom, par ex. mapred.map.tasks
ja: 名前。mapred.map.tasks など
ko: 이름(예: mapred.map.tasks)
zh_cn: 名称，例如，mapred.map.tasks

source: Value, e.g. ${n}
de: Wert, z. B. ${n}
es: Valor, p. ej., ${n}
fr: Valeur, par ex. ${n}
ja: 値です。${n} など
ko: 값(예: ${n})
zh_cn: 值，例如，${n}

source: Toggle arrow showing
de: Pfeil wechseln zu Anzeige von
es: Mostrar/ocultar flechas
fr: Activer/désactiver l'affichage des flèches
ja: 矢印の表示を切り替え
ko: 표시되는 화살표 전환
zh_cn: 切换箭头显示

source: Path to job.xml
de: Pfad zu job.xml
es: Ruta a job.xml
fr: Chemin d'accès à job.xml
ja: job.xml へのパス
ko: job.xml에 대한 경로
zh_cn: 到 job.xml 的路径

source: Workflow submitted.
de: Workflow gesendet.
es: Flujo de trabajo enviado.
fr: Workflow envoyé.
ja: Workflow がサブミットされました。
ko: Workflow가 제출되었습니다.
zh_cn: 已提交 Workflow。

source: Could not find node of type
de: Knoten des Typs nicht gefunden
es: No se encontró ningún nodo del tipo
fr: Impossible de trouver un nœud de type
ja: タイプのノードが見つかりませんでした
ko: 유형의 노드를 찾을 수 없음
zh_cn: 无法找到类型的节点

source: links must be a list
de: Links müssen eine Liste sein
es: los enlaces deben aparecer en una lista
fr: Les liaisons doivent être une liste
ja: リンクはリストになっている必要があります
ko: 링크는 목록이어야 함
zh_cn: 链接必须是列表

source: Start should have two children: 'related' to end, 'to' to any node but an end.
de: Start darf keine zwei untergeordneten Elemente aufweisen: "related" zum Ende, "to" zu beliebigen Knoten, außer einem Ende.
es: El inicio debe contener dos elementos secundarios: 'relacionado' para la finalización y 'para' para cualquier nodo que no sea una finalización.
fr: Le début doit avoir deux enfants : "related" à la fin, "to" à n'importe quel nœud sauf une fin.
ja: 開始には、2 つの子を設定する必要があります。終了への 'related' と、終了以外の任意のノードへの 'to' です。
ko: 시작에는 두 개의 하위 항목(끝에 대한 'related'와 끝이 아닌 노드에 대한 'to')이 있어야 합니다.
zh_cn: 起点必须有两个子项：对应于终点的“相关项”，对应于除终点外所有其他节点的“目标项”。

source: End should have no children.
de: Das Ende darf keine untergeordneten Elemente aufweisen.
es: La finalización no debe contener elementos secundarios.
fr: La fin ne doit avoir aucun enfant.
ja: 終了に子を設定することはできません。
ko: 종료는 하위 항목을 포함할 수 없습니다.
zh_cn: 终点不应有子项。

source: Kill should have no children.
de: Beenden darf keine untergeordneten Elemente aufweisen.
es: La eliminación no debe contener elementos secundarios.
fr: L'opération Détruire ne doit avoir aucun enfant.
ja: 強制終了に子を設定することはできません。
ko: 중지는 하위 항목을 포함할 수 없습니다.
zh_cn: 停止不应有子项。

source: Join and Decision End should have one child: 'to' to any node.
de: "Join" und "Decision End" dürfen kein untergeordnetes Element aufweisen: "to" zu beliebigen Knoten.
es: La unión y la finalización de la decisión deben contener un elemento secundario: 'para' para cualquier nodo.
fr: Le raccord et la fin de décision doivent avoir un enfant : "to" à n'importe quel nœud.
ja: 参加および決定終了には、1 つの子を設定する必要があります。任意のノードへの 'to' です。
ko: 가입 및 결정 끝에는 하나의 하위 항목(노드에 대한 'to')이 있어야 합니다.
zh_cn: 联接和判定终点应有一个子项：对应于任何节点的“目标项”。

source: Fork and Decision should have at least two children: 'related' to their respective ends, 'start' to any node.
de: "Fork" und "Decision" müssen mindestens zwei untergeordnete Elemente aufweisen: "related" zu ihren jeweiligen Enden, "start" zu beliebigen Knoten.
es: La bifurcación y la decisión deben contener al menos dos elementos secundarios: 'relacionado' para sus respectivas finalizaciones e 'inicio' para cualquier nodo.
fr: L'embranchement et la décision doivent avoir au moins deux enfants : "related" à leurs fins respectives, "start" à n'importe quel nœud.
ja: 分岐および決定には、2 つの子を設定する必要があります。それぞれの終了への 'related' と、任意のノードへの 'start' です。
ko: 분기 및 결정에는 두 개 이상의 하위 항목(각 끝에 대한 'related'와 노드에 대한 'start')이 있어야 합니다.
zh_cn: 分叉和判定应至少有两个子项：对应于终点的“相关项”，对应于任何节点的“起点”。

source: Actions should have two children: 'error' to kill, 'ok' to any node.
de: Aktionen müssen zwei untergeordnete Elemente haben: "error" zum Löschen, "ok" für einen beliebigen Knoten.
es: Las acciones deben contener dos elementos secundarios: 'error' para la eliminación y 'ok' para cualquier nodo.
fr: Les actions doivent avoir deux enfants : 'error' pour détruire, 'ok' pour tout nœud.
ja: アクションには、強制終了に対する error と任意のノードに対する ok の 2 つの子が必要です。
ko: 작업에는 두 개의 하위 항목이 있어야 합니다(중지에 대해 'error', 노드에 대해 'ok').
zh_cn: 操作应该具有两个子项：终止“错误”、节点“正常”。

source: %(node_type)s should have %(count)d more %(link_type)s linknode_type
de: %(node_type)s muss %(count)d mehr %(link_type)s linknode_type aufweisen
es: %(node_type)s debe tener %(count)d %(link_type)s más linknode_type
fr: %(node_type)s doit avoir %(count)d %(link_type)s linknode_type de plus
ja: %(node_type)s には、あと %(count)d 個の %(link_type)s linknode_type を設定する必要があります
ko: %(node_type)s에 %(count)d개 이상의 %(link_type)s linknode_type이 있어야 함
zh_cn: %(node_type)s 应有 %(count)d 个以上的 %(link_type)s linknode_type

source: Error saving workflow
de: Fehler beim Speichern des Workflows
es: Error al guardar el workflow
fr: Erreur lors de l'enregistrement du workflow
ja: Workflow の保存中にエラーが発生しました
ko: Workflow 저장 중 오류 발생
zh_cn: 保存 Workflow 时出错

source: Must be POST request.
de: Muss POST-Anforderung sein.
es: Debe ser una solicitud POST.
fr: Doit être une requête POST.
ja: POST 要求でなければなりません。
ko: POST 요청이어야 합니다.
zh_cn: 必须是 POST 请求。

source: Must be GET request.
de: Muss GET-Anforderung sein.
es: Debe ser una solicitud GET.
fr: Doit être une requête GET.
ja: GET 要求でなければなりません。
ko: GET 요청이어야 합니다.
zh_cn: 必须是 GET 请求。

source: Use a POST request to manage an Oozie job.
de: POST-Anfrage zum Verwalten eines Oozie-Jobs verwenden.
es: Utilice una solicitud POST para gestionar el trabajo de Oozie.
fr: Utilisez une requête POST pour gérer un job Oozie.
ja: Oozie ジョブを管理するには、POST 要求が必要です。
ko: POST 요청을 사용하여 Oozie 작업을 관리합니다.
zh_cn: 使用 POST 请求以管理 Oozie 作业。

source: Use a POST request to manage the Oozie jobs.
de: Verwenden Sie eine POST-Anfrage zum Verwalten eines Oozie-Jobs.
es: Utilice una solicitud POST para gestionar los jobs de Oozie.
fr: Utilisez une requête POST pour gérer les jobs Oozie.
ja: Oozie ジョブを管理するには、POST 要求を使用してください。
ko: POST 요청을 사용하여 Oozie job을 관리합니다.
zh_cn: 使用 POST 请求以管理 Oozie 作业。

source: The Oozie server is not running
de: Der Oozie-Server wird nicht ausgeführt.
es: El servidor Oozie no se está ejecutando
fr: Le serveur Oozie n'est pas en cours d'exécution
ja: Oozie Server は動作していません
ko: Oozie Server가 실행 중이 아님
zh_cn: Oozie 服务器未运行

source: An error occurred with Oozie.
de: Es ist ein Fehler bei Oozie aufgetreten.
es: Se ha producido un error con Oozie.
fr: Une erreur s'est produite avec Oozie.
ja: Oozie に関するエラーが発生しました。
ko: Oozie에서 오류가 발생했습니다.
zh_cn: Oozie 发生错误。
