Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Error accessing Oozie action %s.
de: Fehler beim Zugriff auf die Oozie-Aktion %s.
es: Error al acceder a la acción de Oozie %s.
fr: Erreur lors de l'accès à l'action Oozie %s.
ja: Oozie アクション %s へのアクセス中にエラーが発生しました。
ko: Oozie 작업 %s에 액세스하는 중 오류가 발생했습니다.
zh_cn: 访问 Oozie 操作 %s 时出错。

source: Successfully updated Workflow definition
de: Workflow-Definition erfolgreich aktualisiert
es: La definición de workflow se actualizó correctamente
fr: Mise à jour réussie de la définition de workflow
ja: Workflow 定義を正常に更新しました
ko: Workflow 정의가 성공적으로 업데이트됨
zh_cn: 成功更新 Workflow 定义

source: Invalid submission form: %s
de: Ungültiges Sendeformular: %s
es: Formulario de envío no válido: %s
fr: Formulaire d'envoi non valable : %s
ja: 無効なサブミッションフォーム：%s
ko: 제출 양식이 올바르지 않음: %s
zh_cn: 提交格式无效：%s

source: Job
ja: ジョブ
zh_cn: 作业

source: Sync Workflow definition?
de: Workflow-Definition synchronisieren?
es: ¿Sincronizar definición de workflow?
fr: Synchroniser la définition du workflow ?
ja: Workflow 定義を同期しますか？
ko: Workflow 정의를 동기화하시겠습니까?
zh_cn: 同步 Workflow 定义？

source: Workflow re-running.
de: Workflow wird erneut ausgeführt.
es: Volviendo a ejecutar el workflow.
fr: Nouvelle exécution du workflow.
ja: Workflow を再実行中です。
ko: Workflow를 다시 실행 중입니다.
zh_cn: 重新运行 Workflow。

source: Invalid submission form: %s %s
de: Ungültiges Sendeformular: %s %s
es: Formulario de envío no válido: %s %s
fr: Formulaire d'envoi non valable : %s %s
ja: 次からの無効なサブミッションフォーム：%s %s
ko: 제출 양식이 올바르지 않음: %s %s
zh_cn: 提交格式无效：%s %s

source: Error re-running workflow %s.
de: Fehler beim erneuten Ausführen des Workflows %s.
es: Error al volver a ejecutar el workflow %s.
fr: Erreur lors de la nouvelle exécution du workflow %s.
ja: Workflow %s の再実行中にエラーが発生しました。
ko: Workflow %s을(를) 다시 실행하는 중 오류가 발생했습니다.
zh_cn: 重新运行 Workflow %s 时出错。

source: Coordinator re-running.
de: Coordinator wird erneut ausgeführt.
es: Volviendo a ejecutar el coordinator.
fr: Nouvelle exécution du coordinator.
ja: Coordinator を再実行中です。
ko: Coordinator를 다시 실행 중입니다.
zh_cn: 重新运行 Coordinator。

source: Error re-running coordinator %s.
de: Fehler beim erneuten Ausführen des Coordinators %s.
es: Error al volver a ejecutar el coordinator %s.
fr: Erreur lors de la nouvelle exécution du coordinator %s.
ja: Coordinator %s の再実行中にエラーが発生しました。
ko: Coordinator %s을(를) 다시 실행하는 중 오류가 발생했습니다.
zh_cn: 重新运行 Coordinator %s 时出错。

source: Bundle re-running.
de: Bundle wird erneut ausgeführt.
es: Volviendo a ejecutar el bundle.
fr: Nouvelle exécution du bundle.
ja: Bundle を再実行中です。
ko: Bundle을 다시 실행 중입니다.
zh_cn: 重新运行 Bundle。

source: Error re-running bundle %s.
de: Fehler beim erneuten Ausführen des Bundles %s.
es: Error al volver a ejecutar el bundle %s.
fr: Erreur lors de la nouvelle exécution du bundle %s
ja: Bundle %s の再実行中にエラーが発生しました。
ko: Bundle %s을(를) 다시 실행하는 중 오류가 발생했습니다.
zh_cn: 重新运行 Bundle %s 时出错。

source: Error submitting job %s
de: Fehler beim Senden des Jobs %s
es: Error al enviar el job %s
fr: Erreur lors de l'envoi du job %s
ja: ジョブ %s のサブミット中にエラーが発生しました
ko: Job %s 제출 중 오류 발생
zh_cn: 提交作业 %s 时出错

source: Oozie job submitted
de: Oozie-Job gesendet
es: Job de Oozie enviado
fr: Job Oozie envoyé
ja: Oozie ジョブがサブミットされました
ko: Oozie Job 제출됨
zh_cn: 已提交 Oozie 作业

source: Error accessing Oozie job %s.
de: Fehler beim Zugreifen auf den Oozie-Job %s.
es: Error al acceder al job de Oozie %s.
fr: Erreur lors de l'accès au job Oozie %s.
ja: Oozie ジョブ %s へのアクセス中にエラーが発生しました。
ko: Oozie Job %s에 액세스하는 중 오류가 발생했습니다.
zh_cn: 访问 Oozie 作业 %s 时出错。

source: Permission denied. %(username)s does not have the permissions to access job %(id)s.
de: Genehmigung verweigert. Als %(username)s verfügen Sie nicht über die Berechtigung, auf Job %(id)s zuzugreifen.
es: Permiso denegado. %(username)s no tiene permisos para acceder al job %(id)s
fr: Autorisation refusée. %(username)s n'a pas l'autorisation d'accéder au job %(id)s.
ja: パーミッションが拒否されました。%(username)s は、ジョブ %(id)s にアクセスするパーミッションを持っていません。
ko: 권한이 거부되었습니다. %(username)s(은)는 %(id)s Job에 액세스할 권한이 없습니다.
zh_cn: 权限被拒绝。%(username)s 不具备访问作业 %(id)s 的权限。

source: Permission denied. %(username)s does not have the permissions to modify job %(id)s.
de: Genehmigung verweigert. Als %(username)s verfügen Sie nicht über die Berechtigung, Job %(id)s zu ändern.
es: Permiso denegado. %(username)s no tiene permisos para modificar el job %(id)s.
fr: Autorisation refusée. %(username)s n'a pas l'autorisation de modifier le job %(id)s.
ja: パーミッションが拒否されました。%(username)s は、ジョブ %(id)s を変更するパーミッションを持っていません。
ko: 권한이 거부되었습니다. %(username)s(은)는 %(id)s Job에 액세스할 권한이 없습니다.
zh_cn: 权限被拒绝。%(username)s 不具备修改作业 %(id)s 的权限。

source: Archive should be a Zip.
de: Archiv muss eine Zip-Datei sein.
es: El archivo debe ser zip.
fr: L'archive doit être un fichier zip.
ja: アーカイブは Zip にする必要があります。
ko: 아카이브는 Zip이어야 합니다.
zh_cn: 存档应为 Zip 格式。

source: Workflow imported
de: Workflow importiert
es: Workflow importado
fr: Workflow importé
ja: Workflow がインポートされました
ko: 가져온 Workflow
zh_cn: 已导入 Workflow

source: Could not import workflow: %s
de: Workflow konnte nicht importiert werden: %s
es: No se ha podido importar el workflow: %s
fr: Impossible d'importer le workflow : %s
ja: Workflow %s をインポートできませんでした
ko: Workflow를 가져올 수 없음: %s
zh_cn: 无法导入 Workflow：%s

source: Could not import workflow.
de: Workflow konnte nicht importiert werden.
es: No se ha podido importar el workflow.
fr: Impossible d'importer le workflow.
ja: Workflow をインポートできませんでした。
ko: Workflow를 가져올 수 없습니다.
zh_cn: 无法导入 Workflow。

source: Errors on the form: %s
de: Fehler im Formular: %s
es: Errores en el formulario: %s
fr: Erreurs sur le formulaire : %s
ja: フォーム %s のエラー
ko: 양식: %s에서 오류 발생
zh_cn: 格式错误：%s

source: Could not import coordinator: %s
de: Coordinator konnte nicht kopiert werden: %s.
es: No se ha podido importar el coordinator: %s
fr: Impossible d'importer le coordinator : %s
ja: Coordinator %s をインポートできませんでした
ko: Coordinator를 가져올 수 없음: %s
zh_cn: 无法导入 Coordinator：%s

source: Could not import coordinator.
de: Coordinator konnte nicht kopiert werden.
es: No se ha podido importar el coordinator.
fr: Impossible d'importer le coordinator.
ja: Coordinator をインポートできませんでした。
ko: Coordinator를 가져올 수 없습니다.
zh_cn: 无法导入 Coordinator。

source: Coordinator imported
de: Coordinator importiert
es: Coordinator importado
fr: Coordinator importé
ja: Coordinator がインポートされました
ko: Coordinator 가져옴
zh_cn: 已导入 Coordinator

source: Errors on the form
de: Fehler im Formular
es: Errores en el formulario
fr: Erreurs sur le formulaire
ja: フォームのエラー
ko: 양식에서 오류 발생
zh_cn: 格式错误

source: A POST request is required.
de: Eine POST-Anforderung ist erforderlich.
es: Se necesita una solicitud POST.
fr: Requête POST requise.
ja: POST 要求が必要です。
ko: POST 요청이 필요합니다.
zh_cn: 需要 POST 请求。

source: Workflow(s) deleted.
de: Workflow(s) gelöscht.
es: Workflows eliminados.
fr: Workflow(s) supprimé(s).
ja: Workflow が削除されました。
ko: Workflow가 삭제되었습니다.
zh_cn: Workflow 已删除。

source: Workflow(s) trashed.
de: Workflow(s) in Papierkorb verschoben.
es: Workflows enviados a la papelera.
fr: Workflow(s) placé(s) dans la corbeille.
ja: Workflow がゴミ箱に移動されました。
ko: Workflow가 휴지통으로 이동되었습니다.
zh_cn: Workflow 已移至垃圾桶。

source: Workflow(s) restored.
de: Coordinator(s) wiederhergestellt.
es: Workflows restaurados.
fr: Workflow(s) restauré(s).
ja: Workflow が復元されました。
ko: Workflow가 복구되었습니다.
zh_cn: Workflow 已恢复。

source: Workflow submitted
de: Workflow gesendet
es: Workflow enviado
fr: Workflow envoyé
ja: Workflow がサブミットされました
ko: Workflow 제출함
zh_cn: 已提交 Workflow

source: Error submitting workflow %s
de: Fehler beim Senden des Workflows %s
es: Error al enviar el workflow %s
fr: Erreur lors de l'envoi du workflow %s
ja: Workflow %s のサブミット中にエラーが発生しました
ko: Workflow %s 제출 중 오류 발생
zh_cn: 提交 Workflow %s 时出错

source: You already have some coordinators for this workflow. Submit one or create a new one.
de: Sie verfügen bereits über einige Coordinators für diesen Workflow. Senden Sie einen oder erstellen Sie einen neuen.
es: Ya tiene algunos coordinators para este workflow. Envíe uno o cree uno nuevo.
fr: Vous avez déjà un ou plusieurs coordinators pour ce workflow. Envoyez-en un ou créez-en un nouveau.
ja: この Workflow に対して、すでに複数の Coordinator があります。サブミットするか、新たに作成します。
ko: 이 Workflow에 대한 Coordinator가 이미 존재합니다. 하나를 제출하거나 새로 생성하십시오.
zh_cn: 您已具有此 Workflow 的某些 Coordinator。提交一个或创建一个新的。

source: Coordinator(s) deleted.
de: Coordinator(s) gelöscht.
es: Coordinators eliminados.
fr: Coordinator(s) supprimé(s).
ja: Coordinator が削除されました。
ko: Coordinator를 삭제했습니다.
zh_cn: Coordinator 已删除。

source: Coordinator(s) trashed.
de: Coordinator(s) in Papierkorb verschoben.
es: Coordinators enviados a la papelera.
fr: Coordinator(s) placé(s) dans la corbeille.
ja: Coordinator がゴミ箱に移動されました。
ko: Coordinator를 휴지통으로 이동했습니다.
zh_cn: Coordinator 已移至垃圾桶。

source: Coordinator(s) restored.
de: Coordinator(s) wiederhergestellt.
es: Coordinators restaurados.
fr: Coordinator(s) restauré(s).
ja: Coordinator が復元されました。
ko: Coordinator를 복구했습니다.
zh_cn: Coordinator 已恢复。

source: Coordinator saved.
de: Coordinator gespeichert.
es: Coordinators guardados.
fr: Coordinator enregistré.
ja: Coordinator が保存されました。
ko: Coordinator가 저장되었습니다.
zh_cn: Coordinator 已保存。

source: Dataset created
de: Dataset erstellt
es: Conjunto de datos creado
fr: Dataset créé
ja: Dataset が作成されました
ko: Dataset 생성됨
zh_cn: 已创建数据集

source: Dataset modified
de: Dataset geändert
es: Conjunto de datos modificado
fr: Dataset modifié
ja: Dataset は変更されました
ko: Dataset 수정됨
zh_cn: 数据集已修改

source: Beware: dataset start date was after the coordinator start date.
de: Vorsicht: Startdatum des Datasets liegt vor dem Startdatum des Coordinators.
es: Cuidado: La fecha de inicio del conjunto de datos es posterior a la fecha de inicio del coordinator.
fr: Attention : la date de début du dataset était ultérieure à la date de début du coordinator.
ja: 注意：Dataset の開始日が Coordinator の開始日の後になっていました。
ko: 주의: Dataset 시작 날짜가 Coordinator 시작 날짜 이후입니다.
zh_cn: 小心：数据集开始日期晚于 Coordinator 开始日期。

source: Coordinator data created
de: Coordinator-Daten erstellt
es: Datos de coordinator creados
fr: Données du coordinator créées
ja: Coordinator データが作成されました
ko: Coordinator 데이터 생성됨
zh_cn: 已创建 Coordinator 数据

source: Coordinator submitted.
de: Coordinator gesendet.
es: Coordinator enviado.
fr: Coordinator envoyé.
ja: Coordinator がサブミットされました。
ko: Coordinator를 제출했습니다.
zh_cn: 已提交 Coordinator。

source: Error submitting coordinator %s
de: Fehler beim Senden des Coordinators %s
es: Error al enviar el coordinator %s
fr: Erreur lors de l'envoi du coordinator %s
ja: Coordinator %s のサブミット中にエラーが発生しました
ko: Coordinator %s 제출 중 오류 발생
zh_cn: 提交 Coordinator %s 时出错

source: Bundle(s) deleted.
de: Bundle(s) gelöscht.
es: Bundles eliminados.
fr: Bundle(s) supprimé(s).
ja: Bundle が削除されました。
ko: Bundle이 삭제되었습니다.
zh_cn: Bundle 已删除。

source: Bundle(s) restored.
de: Bundle(s) wiederhergestellt.
es: Bundles restaurados.
fr: Bundle(s) restauré(s).
ja: Bundle が復元されました。
ko: Bundle이 복구되었습니다.
zh_cn: Bundle 已恢复。

source: Bundle saved.
de: Bundle gespeichert.
es: Bundle guardado.
fr: Bundle enregistré.
ja: Bundle が保存されました。
ko: Bundle이 저장되었습니다.
zh_cn: 已保存 Bundle。

source: Coordinator added to the bundle!
de: Coordinator zu Bundle hinzugefügt!
es: Coordinator agregado al bundle.
fr: Coordinator ajouté au bundle !
ja: Coordinator が Bundle に追加されました。
ko: Coordinator가 Bundle에 추가되었습니다!
zh_cn: Coordinator 已添加至 Bundle！

source: Bundled coordinator updated!
de: Bundle-Coordinator aktualisiert!
es: Coordinator de bundle actualizado.
fr: Coordinator groupé mis à jour.
ja: バンドルされている Coordinator が更新されました。
ko: Bundled coordinator를 업데이트했습니다!
zh_cn: 已更新 Bundled Coordinator！

source: Error submitting bundle %s
de: Fehler beim Senden des Bundles %s
es: Error al enviar el bundle %s
fr: Erreur lors de l'envoi du bundle %s
ja: Bundle %s のサブミット中にエラーが発生しました
ko: Bundle %s 제출 중 오류 발생
zh_cn: 提交 Bundle %s 时出错

source: Document deleted.
de: Dokument gelöscht.
es: Documento eliminado.
fr: Document supprimé.
ja: ドキュメントが削除されました。
ko: 문서가 삭제되었습니다.
zh_cn: 文档已删除。

source: Workflows copied.
de: Workflows kopiert.
es: Workflows copiados.
fr: Workflows copiés.
ja: Workflow がコピーされました。
ko: Workflow가 복사되었습니다.
zh_cn: 已复制 Workflow。

source: Workflow copied.
de: Workflow kopiert.
es: Workflow copiado.
fr: Workflow copié.
ja: Workflow がコピーされました。
ko: Workflow가 복사되었습니다.
zh_cn: 已复制 Workflow。

source: Page saved !
de: Seite gespeichert!
es: ¡Página guardada!
fr: Page enregistrée !
ja: ページが保存されました。
ko: 페이지가 저장되었습니다!
zh_cn: 页面已保存！

source: Workflow submission failed
de: Senden des Workflows fehlgeschlagen
es: Error al enviar el workflow
fr: Echec de l'envoi du workflow
ja: Workflow のサブミッションに失敗しました
ko: Workflow 제출 실패
zh_cn: Workflow 提交失败

source: Error submitting workflow %s: %s
de: Fehler beim Senden des Workflows %s: %s
es: Error al enviar el workflow %s: %s
fr: Erreur lors de l'envoi du workflow %s : %s
ja: Workflow %s のサブミット中にエラーが発生しました：%s
ko: Workflow %s 제출 중 오류 발생: %s
zh_cn: 提交 Workflow %s 时出错：%s

source: You don't have access to the workflow or document of this coordinator.
de: Sie haben keinen Zugriff auf den Workflow oder das Dokument dieses Coordinators.
es: No tiene acceso al workflow o documento de este coordinator.
fr: Vous n'avez pas accès au workflow ou aux documents de ce coordinator.
ja: この Coordinator の Workflow またはドキュメントにアクセスする権限がありません。
ko: Coordinator의 Workflow 또는 문서에 액세스할 수 없습니다.
zh_cn: 您没有此 Coordinator 的 Workflow 或文档的访问权限。

source: You don't have access to the workflow of this coordinator.
de: Sie haben keinen Zugriff auf den Workflow dieses Coordinators.
es: No tiene acceso al workflow de este coordinator.
fr: Vous n'avez pas accès au workflow de ce coordinator.
ja: この Coordinator の Workflow にアクセスする権限がありません。
ko: 이 Coordinator의 Workflow에 액세스할 수 없습니다.
zh_cn: 您没有此 Coordinator 的 Workflow 的访问权限。

source: Coordinator copied.
de: Coordinator kopiert.
es: Coordinator copiado.
fr: Coordinator copié.
ja: Coordinator がコピーされました。
ko: Coordinator가 복사되었습니다.
zh_cn: Coordinator 已复制。

source: Saved!
de: Gespeichert!
es: Guardado.
fr: Enregistré !
ja: 保存されました。
ko: 저장됨!
zh_cn: 已保存！

source: Updated!
de: Aktualisiert!
es: Actualizado.
fr: Mis à jour !
ja: 更新されました。
ko: 업데이트됨!
zh_cn: 已更新！

source: Saved !
de: Gespeichert!
es: Guardado.
fr: Enregistré !
ja: 保存されました。
ko: 저장됨!
zh_cn: 已保存！

source: Bundle copied.
de: Bundle kopiert.
es: Bundle copiado.
fr: Bundle copié.
ja: Bundle がコピーされました。
ko: Bundle이 복사되었습니다.
zh_cn: 已复制 Bundle。

source: Hive XML
es: XML de Hive
fr: XML Hive

source: HiveServer2 URL
es: URL de HiveServer2
fr: URL HiveServer2

source: bcc
es: cco
ko: 숨은 참조

source: Ex: --executor-memory 20G --num-executors 50
de: z. B. --executor-memory 20G --num-executors 50
es: P. ej.: --executor-memory 20G --num-executors 50
ja: --executor-memory 20G --num-executors 50 など
ko: 예: --executor-memory 20G --num-executors 50

source: ie. 2
de: d. h. 2
es: es decir, 2
fr: c.-à-d. 2
ko: 예: 2

source: ie. 30
de: d. h. 30
es: es decir, 30
fr: c.-à-d. 30
ko: 예: 30

source: ie. 10
de: d. h. 10
es: es decir, 10
fr: c.-à-d. 10
ko: 예: 10

source: Coordinator Manager
es: Administrador de coordinator
fr: Gestionnaire de coordinators

source: Workflow Manager
es: Administrador de workflow
fr: Gestionnaire de workflows

source: Main class
de: Hauptklasse
fr: Classe principale
ko: 주 클래스

source: cc
ko: 참조

source: Bundles
ja: Bundle
ko: Bundle

source: Schedule of
ja: 次のスケジュール：

source: Choose a file
ja: ファイルを選択

source: Spark Master
fr: Maître Spark
