Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
zh_cn: 否

source: Yes
de: Ja
es: Sí
fr: Oui
ja: はい
ko: 예
zh_cn: 是

source: The selected jobs have been suspended correctly.
de: Die ausgewählten Jobs wurden korrekt unterbrochen.
es: Los jobs seleccionados se han suspendido correctamente.
fr: Les jobs sélectionnés ont été correctement suspendus.
ja: 選択したジョブが正常に中断されました。
ko: 선택한 job이 올바르게 중단되었습니다.
zh_cn: 已正确暂停所选作业。

source: Some of the selected jobs may not have been suspended correctly:
de: Einige der ausgewählten Jobs wurden möglicherweise nicht korrekt unterbrochen:
es: Es posible que algunos de los jobs seleccionados no se hayan suspendido correctamente:
fr: Certains jobs sélectionnés n'ont peut-être pas été suspendus correctement :
ja: いくつかの選択したジョブが正常に中断されなかった可能性があります：
ko: 선택한 job 중 일부가 올바르게 중단되지 않았습니다.
zh_cn: 可能没有正确暂停某些所选作业。

source: The selected jobs have been resumed correctly.
de: Die ausgewählten Jobs wurden korrekt fortgesetzt.
es: Los jobs seleccionados se han reanudado correctamente.
fr: Les jobs sélectionnés ont repris correctement.
ja: 選択したジョブが正常に再開されました。
ko: 선택한 job 중이 올바르게 다시 시작되었습니다.
zh_cn: 已正确恢复所选作业。

source: Some of the selected jobs may not have been resumed correctly:
de: Einige der ausgewählten Jobs wurden möglicherweise nicht korrekt fortgesetzt:
es: Es posible que algunos de los jobs seleccionados no se hayan reanudado correctamente:
fr: Certains jobs sélectionnés n'ont peut-être pas repris correctement :
ja: いくつかの選択したジョブが正常に再開されなかった可能性があります：
ko: 선택한 job 중 일부가 올바르게 다시 시작되지 않았습니다.
zh_cn: 可能没有正确恢复某些所选作业。

source: The selected jobs have been killed correctly.
de: Die ausgewählten Jobs wurden korrekt abgebrochen.
es: Los jobs seleccionados se han eliminado correctamente.
fr: Les jobs sélectionnés ont été détruits correctement.
ja: 選択したジョブが正常に強制終了されました。
ko: 선택한 job 중이 올바르게 중지되었습니다.
zh_cn: 已正确停止所选作业。

source: Some of the selected jobs may not have been killed correctly:
de: Einige der ausgewählten Jobs wurden möglicherweise nicht korrekt abgebrochen:
es: Es posible que algunos de los jobs seleccionados no se hayan eliminado correctamente:
fr: Certains jobs sélectionnés n'ont peut-être pas été détruits correctement :
ja: いくつかの選択したジョブが正常に強制終了されなかった可能性があります：
ko: 선택한 job 중 일부가 올바르게 중지되지 않았습니다.
zh_cn: 可能没有正确停止某些所选作业。

source: Bundle Dashboard
es: Panel del bundle
fr: Tableau de bord de bundle
ja: Bundle ダッシュボード
ko: Bundle 대시보드
zh_cn: Bundle 控制面板

source: Submitter
de: Sender
es: Remitente
fr: Envoyeur
ja: 送信者
ko: 제출자
zh_cn: 提交者

source: Status
es: Estado
fr: Statut
ja: ステータス
ko: 상태
zh_cn: 状态

source: Progress
de: Fortschritt
es: Progreso
fr: Progression
ja: 進行状況
ko: 진행률
zh_cn: 进度

source: Kick off time
de: Startzeit
es: Hora de inicio
fr: Heure du démarrage
ja: キックオフ時間
ko: 시작 시간
zh_cn: 启动时间

source: Manage
de: Verwalten
es: Gestionar
fr: Gérer
ja: 管理
ko: 관리
zh_cn: 管理

source: Kill %(bundle)s
de: %(bundle)s beenden
es: Eliminar %(bundle)s
fr: Détruire %(bundle)s
ja: %(bundle)s を強制終了
ko: %(bundle)s 중지
zh_cn: 停止 %(bundle)s

source: Are you sure you want to kill bundle %s?
de: Soll Bündel %s wirklich beendet werden?
es: ¿Está seguro de que desea eliminar el bundle %s?
fr: Voulez-vous vraiment détruire le bundle %s ?
ja: Bundle %s を強制終了してもよろしいですか?
ko: Bundle %s을(를) 중지하시겠습니까?
zh_cn: 是否确定要停止 bundle %s？

source: The bundle was killed!
de: Bündel wurde beendet!
es: Se ha eliminado el bundle.
fr: Le bundle a été détruit !
ja: Bundle が強制終了されました。
ko: Bundle이 중지되었습니다!
zh_cn: Bundle 已停止！

source: Are you sure you'd like to kill this job?
de: Soll dieser Job wirklich beendet werden?
es: ¿Está seguro de que desea eliminar este trabajo?
fr: Voulez-vous vraiment détruire ce job ?
ja: このジョブを強制終了してよろしいですか?
ko: 이 작업을 종료하시겠습니까?
zh_cn: 是否确定停止作业？

source: Kill
de: Beenden
es: Eliminar
fr: Détruire
ja: 強制終了
ko: 중지
zh_cn: 停止

source: Rerun
de: Erneut ausführen
es: Volver a ejecutar
fr: Réexécuter
ja: 再実行
ko: 다시 실행
zh_cn: 重新运行

source: Suspend the bundle after finishing the current running actions
de: Unterbrechen Sie das Bundle, wenn die derzeitig aktiven Aktionen beendet sind.
es: Suspender el bundle después de terminar las acciones actualmente en curso
fr: Suspendre le bundle une fois les actions en cours d'exécution terminées
ja: 現在実行中のアクションを完了したら、Bundle を一時停止
ko: 현재 실행 중인 작업을 완료한 후에 Bundle 중단
zh_cn: 在完成当前运行的操作后，暂停 bundle

source: Are you sure you'd like to suspend this job?
de: Soll dieser Job wirklich unterbrochen werden?
es: ¿Está seguro de que desea suspender este trabajo?
fr: Voulez-vous vraiment suspendre ce job ?
ja: このジョブを一時停止してもよろしいですか?
ko: 이 Job을 중단하시겠습니까?
zh_cn: 是否确定要暂停此作业？

source: Suspend
de: Unterbrechen
es: Suspender
fr: Suspendre
ja: 一時停止
ko: 중단
zh_cn: 暂停

source: Resume the bundle
de: Bundle fortsetzen
es: Reanudar el bundle
fr: Reprendre le bundle
ja: Bundle を再開
ko: Bundle 다시 시작
zh_cn: 恢复 Bundle

source: Are you sure you'd like to resume this job?
de: Soll dieser Job wirklich fortgesetzt werden?
es: ¿Está seguro de que desea reanudar este trabajo?
fr: Voulez-vous vraiment reprendre ce job ?
ja: このジョブを再開してもよろしいですか?
ko: 이 Job을 다시 시작하시겠습니까?
zh_cn: 是否确定要恢复此作业？

source: Resume
de: Fortsetzen
es: Reanudar
fr: Reprendre
ja: 再開
ko: 다시 시작
zh_cn: 恢复

source: Actions
de: Aktionen
es: Acciones
ja: アクション
ko: 작업
zh_cn: 操作

source: Details
es: Detalles
fr: Détails
ja: 詳細
ko: 세부 정보
zh_cn: 详细信息

source: Configuration
de: Konfiguration
es: Configuración
ja: 設定
ko: 구성
zh_cn: 配置

source: Log
de: Protokoll
es: Registro
fr: Journal
ja: ログ
ko: 로그
zh_cn: 日志

source: Definition
es: Definición
fr: Définition
ja: 定義
ko: 정의
zh_cn: 定义

source: Last action
de: Letzte Aktion
es: Última acción
fr: Dernière action
ja: 最後のアクション
ko: 마지막 작업
zh_cn: 最后一个操作

source: Next materialization
de: Nächste Materialisierung
es: Siguiente materialización
fr: Matérialisation suivante
ja: 次の実体化
ko: 다음 구체화
zh_cn: 下次具体化

source: There are no actions to be shown.
de: Es sind keine anzuzeigenden Aktionen vorhanden.
es: No hay acciones que mostrar.
fr: Il n'existe aucune action à afficher.
ja: 表示するアクションはありません。
ko: 표시할 작업이 없습니다.
zh_cn: 没有要显示的操作。

source: Frequency
de: Häufigkeit
es: Frecuencia
fr: Fréquence
ja: 頻度
ko: 주기
zh_cn: 频率

source: Time Unit
de: Zeiteinheit
es: Unidad de tiempo
fr: Unité de temps
ja: 時間単位
ko: 시간 단위
zh_cn: 时间单位

source: Time out
es: Tiempo de espera
fr: Temporisation
ja: タイムアウト
ko: 시간 초과
zh_cn: 超时

source: Start Time
de: Startzeit
es: Hora de inicio
fr: Heure de début
ja: 開始時間
ko: 시작 시간
zh_cn: 开始时间

source: End Time
de: Endzeit
es: Hora de finalización
fr: Heure de fin
ja: 終了時間
ko: 종료 시간
zh_cn: 结束时间

source: Pause Time
de: Pausenzeit
es: Tiempo de pausa
fr: Heure de l'interruption
ja: 一時停止時間
ko: 일시 중지 시간
zh_cn: 暂停时间

source: Created time
de: Erstellungszeit
es: Hora de creación
fr: Heure de création
ja: 作成時間
ko: 생성된 시간
zh_cn: 创建时间

source: Back
de: Zurück
es: Volver
fr: Précédent
ja: 戻る
ko: 뒤로
zh_cn: 返回

source: Problem:
es: Problema:
fr: Problème :
ja: 問題：
ko: 문제:
zh_cn: 问题：

source: Error:
de: Fehler:
fr: Erreur :
ja: エラー：
ko: 오류:
zh_cn: 错误：

source: Bundles Dashboard
de: Bundle-Dashboard
es: Panel de bundles
fr: Tableau de bord des bundles
ja: Bundles ダッシュボード
ko: Bundle 대시보드
zh_cn: Bundle 控制面板

source: Search partial name, submitter or complete Id
de: Namensteil, Sender oder vollständige ID suchen
es: Buscar nombre parcial, remitente o id completo
fr: Recherche du nom partiel, de l'expéditeur ou de l'identifiant complet
ja: 名前の一部、送信者、または完全な ID を検索
ko: 부분 이름, 제출자 또는 전체 ID 검색
zh_cn: 搜索部分名称、提交者或完整 ID

source: Resume selected
de: Auswahl fortsetzen
es: Reanudar seleccionados
fr: Reprendre la sélection
ja: 選択した項目を再開
ko: 선택한 항목 다시 시작
zh_cn: 恢复所选对象

source: Suspend selected
de: Auswahl unterbrechen
es: Suspender seleccionados
fr: Suspendre la sélection
ja: 選択した項目を中断
ko: 선택한 항목 중단
zh_cn: 暂停所选对象

source: Kill selected
de: Auswahl abbrechen
es: Eliminar seleccionados
fr: Détruire la sélection
ja: 選択した項目を強制終了
ko: 중지를 선택함
zh_cn: 停止所选对象

source: Show only
de: Nur Folgende anzeigen
es: Mostrar sólo
fr: Afficher uniquement
ja: 表示のみ
ko: 기간 설정:
zh_cn: 仅显示

source: days with status
de: Tage mit Status
es: días con estado
fr: jours avec le statut
ja: 日のみ表示（ステータス付き）
ko: 상태 설정
zh_cn: 天且具有下面状态

source: Succeeded
de: Erfolgreich
es: Satisfactorio
fr: Réussi
ja: 成功
ko: 성공
zh_cn: 成功

source: Running
de: Aktiv
es: En ejecución
fr: En cours d'exécution
ja: 実行中
ko: 실행 중
zh_cn: 正在运行

source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
zh_cn: 错误

source: Kickoff Time
de: Startzeit
es: Hora de inicio
fr: Heure du démarrage
ja: キックオフ時間
ko: 시작 시간
zh_cn: 启动时间

source: Created Time
de: Erstellungszeit
es: Hora de creación
fr: Heure de création
ja: 作成時間
ko: 생성된 시간
zh_cn: 创建时间

source: Previous
de: Zurück
es: Anterior
fr: Précédent
ja: 前
ko: 이전
zh_cn: 上一页

source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次ヘ
ko: 다음
zh_cn: 下一页

source: Completed
de: Abgeschlossen
es: Completados
fr: Terminé
ja: 完了
ko: 완료됨
zh_cn: 已完成

source: Showing 0 to 0 of
de: Anzeigen: 0 bis 0 von
es: Mostrando 0 a 0 de
fr: Affichage de 0 à 0 sur
ja: 次の件数の 0 から 0 までを表示
ko: 다음 항목에 대해 0 - 0 표시
zh_cn: 显示 0 到 0，共

source: entries
de: Einträgen
es: entradas
fr: entrées
ja: エントリ
ko: 항목
zh_cn: 条目

source: Showing
de: Anzeigen:
es: Mostrando
fr: Affichage de
ja: 表示中
ko: 표시 중
zh_cn: 正在显示

source: to
de: bis
es: a
fr: vers
ja: から
zh_cn: 至

source: of
de: von
es: de
fr: sur
zh_cn: 的

source: (filtered from
de: (gefiltert von
es: (se filtra a partir de
fr: (filtré à partir de
ko: (다음 항목에서 필터링
zh_cn: （已从

source: entries)
de: Einträgen)
es: las entradas)
fr: entrées)
ja: 件のエントリからフィルタ処理）
ko: 항목)
zh_cn: 条目中筛选）

source: No matching records
de: Keine übereinstimmenden Datensätze
es: No hay registros coincidentes
fr: Aucun enregistrement correspondant
ja: 一致するレコードがありません
ko: 일치하는 레코드가 없음
zh_cn: 没有匹配记录

source: Coordinator Dashboard
es: Panel de coordinator
fr: Tableau de bord de coordinator
ja: Coordinator ダッシュボード
ko: Coordinator 대시보드
zh_cn: Coordinator 控制面板

source: Next Materialized Time
de: Nächste materialisierte Zeit
es: Siguiente tiempo materializado
fr: Heure de la prochaine matérialisation
ja: 次回の実体化時間
ko: 다음 구체화된 시간
zh_cn: 下次具体化的时间

source: Datasets
de: Datensätze
es: Conjuntos de datos
ja: データセット
zh_cn: 数据集

source: No available datasets
de: Keine verfügbare Datasets
es: No hay datasets disponibles
fr: Aucun dataset disponible
ja: 使用可能な Dataset がありません
ko: 사용 가능한 dataset가 없음
zh_cn: 无可用数据集

source: Kill %(coordinator)s
de: %(coordinator)s beenden
es: Eliminar %(coordinator)s
fr: Détruire %(coordinator)s
ja: %(coordinator)s を強制終了
ko: %(coordinator)s 중지
zh_cn: 停止 %(coordinator)s

source: Are you sure you want to kill coordinator %s?
de: Soll Coordinator %s wirklich beendet werden?
es: ¿Está seguro de que desea eliminar el coordinator %s?
fr: Voulez-vous vraiment détruire le coordinator %s ?
ja: Coordinator %s を強制終了してもよろしいですか？
ko: Coordinator %s을(를) 중지하시겠습니까?
zh_cn: 是否确定要停止 Coordinator %s？

source: The coordinator was killed!
de: Der Coordinator wurde abgebrochen!
es: Coordinator eliminado.
fr: Le coordinator a été détruit.
ja: Coordinator が強制終了されました。
ko: Coordinator가 중지되었습니다!
zh_cn: Coordinator 已停止！

source: Are you sure you want to kill this job?
de: Soll dieser Job wirklich beendet werden?
es: ¿Está seguro de que desea eliminar este trabajo?
fr: Voulez-vous vraiment détruire ce job ?
ja: このジョブを強制終了してもよろしいですか？
ko: 이 Job을 중지하시겠습니까?
zh_cn: 是否确定要停止此作业？

source: Suspend the coordinator after finishing the current running actions
de: Unterbrechen Sie den Coordinator, wenn die derzeit aktiven Aktionen abgeschlossen sind.
es: Suspender el coordinator después de terminar las acciones actualmente en curso
fr: Suspendre le coordinator une fois les actions en cours d'exécution terminées
ja: 現在実行中のアクションを完了したら、Coordinator を一時停止
ko: 현재 실행 중인 작업을 완료한 후에 Coordinator 중단
zh_cn: 在完成当前运行的操作后，暂停 coordinator

source: Are you sure you want to suspend this job?
de: Soll dieser Job wirklich unterbrochen werden?
es: ¿Está seguro de que desea suspender este job?
fr: Voulez-vous vraiment suspendre ce job ?
ja: このジョブを一時停止してもよろしいですか？
ko: 이 Job을 중단하시겠습니까?
zh_cn: 是否确定要暂停此作业？

source: Resume the coordinator
de: Coordinator fortsetzen
es: Reanudar el coordinator
fr: Reprendre le coordinator
ja: Coordinator を再開
ko: Coordinator 다시 시작
zh_cn: 恢复 Coordinator

source: Are you sure you want to resume this job?
de: Soll dieser Job wirklich fortgesetzt werden?
es: ¿Está seguro de que desea reanudar este job?
fr: Voulez-vous vraiment reprendre ce job ?
ja: このジョブを再開してもよろしいですか？
ko: 이 Job을 다시 시작하시겠습니까?
zh_cn: 是否确定要恢复此作业？

source: Synchronize
de: Synchronisieren
es: Sincronizar
fr: Synchroniser
ja: 同期
ko: 동기화
zh_cn: 同步

source: Update Coordinator Job properties
de: Coordinator-Jobeigenschaften aktualisieren
es: Actualizar propiedades del job de coordinator
fr: Mettre à jour les propriétés du job de coordinator
ja: Coordinator ジョブプロパティを更新
ko: Coordinator Job 속성 업데이트
zh_cn: 更新 Coordinator 作业属性

source: Successfully updated Coordinator Job Properties
de: Coordinator-Jobeigenschaften erfolgreich aktualisiert
es: Las propiedades del job de coordinator se han actualizado correctamente
fr: Mise à jour réussie des propriétés du job de coordinator
ja: Coordinator ジョブプロパティを正常に更新しました
ko: Coordinator Job 속성 업데이트 성공
zh_cn: 已成功更新 Coordinator 作业属性

source: Update Coordinator Job Properties
de: Coordinator-Jobeigenschaften aktualisieren
es: Actualizar propiedades del job de coordinator
fr: Mettre à jour des propriétés du job de coordinator
ja: Coordinator ジョブプロパティを更新
ko: Coordinator Job 속성 업데이트
zh_cn: 更新 Coordinator 作业属性

source: Sync Workflow
de: Workflow synchronisieren
es: Sincronizar workflow
fr: Synchroniser le workflow
ja: 同期 Workflow
ko: Workflow 동기화
zh_cn: 同步 Workflow

source: Calendar
de: Kalender
es: Calendario
fr: Calendrier
ja: カレンダー
ko: 일정
zh_cn: 日历

source: Filter results
de: Filterergebnisse
es: Filtrar resultados
fr: Filtre les résultats
ja: フィルタの結果
ko: 결과 필터링
zh_cn: 筛选结果

source: Successfully ignored selected action(s)
de: Ausgewählte Aktion(en) erfolgreich ignoriert
es: La acción seleccionada se omitió correctamente
fr: Action(s) sélectionnée(s) ignorée(s) avec succès
ja: 選択されたアクションを正常に無視しました
ko: 선택한 작업 성공적으로 무시
zh_cn: 成功忽略所选操作

source: Are you sure you want to ignore the action(s)?
de: Sind Sie sicher, dass Sie diese Aktion(en) ignorieren möchten?
es: ¿Está seguro de que desea omitir esta(s) acción(es)?
fr: Voulez-vous vraiment ignorer les actions ?
ja: これらのアクションを無視してもよろしいですか？
ko: 작업을 무시하시겠습니까?
zh_cn: 是否确定要忽略操作？

source: Note: You can only ignore a FAILED, KILLED or TIMEDOUT action
de: Hinweis: Sie können nur die Aktionen FEHLGESCHLAGEN, BEENDET und TIMEOUT ignorieren.
es: Nota: Solo puede omitir acciones FALLIDAS, ELIMINADAS o con tiempo de espera AGOTADO
fr: Remarque : vous pouvez ignorer uniquement une action ECHEC, DESTRUCTION ou TEMPORISATION.
ja: 注意：FAILED、KILLED、または TIMEDOUT アクションのみを無視できます
ko: 참고: FAILED, KILLED 또는 TIMEDOUT 작업만 무시할 수 있음
zh_cn: 注意：您仅可忽略 FAILED、KILLED 或 TIMEDOUT 操作

source: Ignore
de: Ignorieren
es: Omitir
fr: Ignorer
ja: 無視
ko: 무시
zh_cn: 忽略

source: Day
de: Tag
es: Día
fr: Jour
ja: 日
ko: 일
zh_cn: 日

source: Warning message
de: Warnmeldung
es: Mensaje de advertencia
fr: Message d'avertissement
ja: 警告メッセージ
ko: 경고 메시지
zh_cn: 警告消息

source: Workflow not available or instantiated yet
de: Workflow nicht verfügbar oder noch nicht instanziiert
es: El workflow no está disponible o todavía no se ha generado una instancia del mismo
fr: Workflow pas encore disponible ou pas encore instancié
ja: Workflow が使用できないかまだインスタンス化されていません
ko: Workflow를 사용할 수 없거나 아직 인스턴스화되지 않음
zh_cn: Workflow 不可用或尚未实例化

source: Number
de: Anzahl
es: Número
fr: Numéro
ja: 数
ko: 숫자
zh_cn: 数量

source: Nominal Time
de: Nominale Zeit
es: Tiempo nominal
fr: Temps nominal
ja: 公称時間
ko: 명목 시간
zh_cn: 标定时间

source: Error Code
de: Fehlercode
es: Código de error
fr: Code d'erreur
ja: エラーコード
ko: 오류 코드
zh_cn: 错误代码

source: Error Message
de: Fehlermeldung
es: Mensaje de error
fr: Message d'erreur
ja: エラーメッセージ
ko: 오류 메시지
zh_cn: 错误消息

source: Missing Dependencies
de: Fehlende Abhängigkeiten
es: Dependencias no encontradas
fr: Dépendances manquantes
ja: 依存関係が見つかりません
ko: 누락된 종속성
zh_cn: 缺少相关项

source: Last Modified
de: Zuletzt geändert
es: Última modificación
fr: Dernière modification
ja: 前回の変更
ko: 최종 수정 날짜
zh_cn: 上次修改

source: External Id
de: Externe ID
es: ID externo
fr: ID externe
ja: 外部 ID
ko: 외부 ID
zh_cn: 外部 Id

source: Start time
de: Startzeit
es: Hora de inicio
fr: Heure de début
ja: 開始時間
ko: 시작 시간
zh_cn: 开始时间

source: End time
de: Endzeit
es: Hora de finalización
fr: Heure de fin
ja: 終了時間
ko: 종료 시간
zh_cn: 结束时间

source: Pause time
de: Pausenzeit
es: Tiempo de pausa
fr: Heure de l'interruption
ja: 一時停止時間
ko: 일시 중지 시간
zh_cn: 暂停时间

source: Last
de: Letzter
es: Último
fr: Dernier
ja: 末尾
ko: 마지막
zh_cn: 最后一个

source: hours and
de: Stunden und
es: horas y
fr: heures et
ja: 時間など、および
ko: 시간 및
zh_cn: 小时和

source: minutes
de: Minuten
es: minutos
ja: 分など
ko: 분
zh_cn: 分钟

source: Number of lines
de: Anzahl Zeilen
es: Número de líneas
fr: Nombre de lignes
ja: 行数
ko: 줄 수
zh_cn: 行数

source: String to search in logs
de: In Protokollen zu suchende Zeichenfolge
es: Cadena que buscar en registros
fr: Chaîne à rechercher dans les journaux
ja: ログで検索する文字列
ko: 로그에서 검색할 문자열
zh_cn: 在日志中搜索的字符串

source: Debug
de: Debuggen
es: Depurar
fr: Débogage
ja: デバッグ
ko: 디버그
zh_cn: 调试

source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
ko: 경고
zh_cn: 警告

source: Filter
es: Filtro
fr: Filtrer
ja: フィルター
ko: 필터
zh_cn: 筛选器

source: Time since Nominal Time in min
de: Zeit seit der nominalen Zeit in Minuten
es: Tiempo desde el tiempo nominal en minutos
fr: Temps écoulé depuis l'heure nominale, en minutes
ja: 公称時間以降の経過時間（分）
ko: 명목 시간 이후 시간(분)
zh_cn: 自标定时间的起的时间（分钟）

source: Expected Start
de: Erwarteter Start
es: Inicio esperado
fr: Début attendu
ja: 予想開始時間
ko: 예상 시작 시간
zh_cn: 预期开始时间

source: Actual Start
de: Tatsächlicher Start
es: Inicio real
fr: Début réel
ja: 実際の開始時間
ko: 실제 시작 시간
zh_cn: 实际开始时间

source: Expected End
de: Erwartetes Ende
es: Final esperado
fr: Fin attendue
ja: 予想終了時間
ko: 예상 종료 시간
zh_cn: 预期结束时间

source: Actual End
de: Tatsächliches Ende
es: Final real
fr: Fin réelle
ja: 実際の終了時間
ko: 실제 종료 시간
zh_cn: 实际结束时间

source: Expected Duration
de: Erwartete Dauer
es: Duración esperada
fr: Durée attendue
ja: 予想継続時間
ko: 예상 소요 시간
zh_cn: 预期持续时间

source: Actual Duration
de: Tatsächliche Dauer
es: Duración real
fr: Durée réelle
ja: 実際の継続時間
ko: 실제 소요 시간
zh_cn: 实际持续时间

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_cn: 取消

source: Update
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
ja: 更新
ko: 업데이트
zh_cn: 更新

source: click for the SLA dashboard
de: Für das SLA-Dashboard klicken
es: haga clic para la acceder al panel SLA
fr: cliquer pour obtenir le tableau de bord SLA
ja: クリックして SLA ダッシュボードを表示
ko: SLA 대시보드를 표시하려면 클릭
zh_cn: 单击获取 SLA 控制面板

source: No data available
de: Keine Daten verfügbar
es: No hay datos disponibles
fr: Aucune donnée disponible
ja: 利用可能なデータがありません
ko: 데이터를 이용할 수 없음
zh_cn: 没有可用数据

source: Coordinators Dashboard
de: Coordinator-Dashboard
es: Panel de coordinators
fr: Tableau de bord des coordinators
ja: Coordinator ダッシュボード
ko: Coordinator 대시보드
zh_cn: Coordinator 控制面板

source: Next Submission
de: Nächste Übermittlung
es: Siguiente envío
fr: Prochain envoi
ja: 次回のサブミッション
ko: 다음 제출
zh_cn: 下次提交

source: Completion
de: Fertigstellung
es: Finalización
fr: Fin
ja: 完了
ko: 완료
zh_cn: 完成

source: Duration
de: Dauer
es: Duración
fr: Durée
ja: 期間
ko: 소요 시간
zh_cn: 持续时间

source: Oozie Information
de: Oozie-Informationen
es: Información de Oozie
fr: Informations Oozie
ja: Oozie の情報
ko: Oozie 정보
zh_cn: Oozie 信息

source: Oozie status
es: Estado de Oozie
fr: Statut Oozie
ja: Oozie ステータス
ko: Oozie 상태
zh_cn: Oozie 状态

source: Instrumentation
de: Instrumentierung
es: Instrumentación
ja: インストルメンテーション
ko: 계측
zh_cn: 检测仪器

source: Metrics
de: Kennzahlen
es: Métricas
fr: Mesures
ja: 測定値
ko: 메트릭
zh_cn: 指标

source: Text Filter
es: Filtro de texto
fr: Filtre de texte
ja: テキストフィルタ
ko: 텍스트 필터
zh_cn: 文本筛选器

source: No metrics available for this section.
de: Keine Kennzahlen für diesen Abschnitt vorhanden.
es: No hay métricas disponibles para esta sección.
fr: Aucune mesure disponible pour cette section.
ja: このセクションの使用可能な測定値がありません。
ko: 이 섹션에 사용 가능한 메트릭이 없습니다.
zh_cn: 没有可用于此部分的指标。

source: Click to learn more
de: Klicken Sie hier für weitere Informationen
es: Haga clic para obtener más información
fr: Cliquez pour en savoir plus
ja: クリックして詳細を表示
ko: 자세한 내용을 보려면 클릭
zh_cn: 单击以了解更多信息

source: Oozie is not setup to create SLAs
de: Oozie ist nicht für die Erstellung von SLAs eingerichtet
es: Oozie no está configurado para crear SLA
fr: Oozie n'est pas configuré pour créer des SLA
ja: SLA を作成するように Oozie は設定されていません
ko: Oozie가 SLA를 생성하도록 설정되지 않음
zh_cn: Oozie 未设置用于创建 SLA

source: Search
de: Suche
es: Buscar
fr: Rechercher
ja: 検索
ko: 검색
zh_cn: 搜索

source: Name or Id
de: Name oder ID
es: Nombre o ID
fr: Nom ou ID
ja: 名前または ID
ko: 이름 또는 ID
zh_cn: 名称或 ID

source: Job Name or Id (required)
de: Jobname oder ID (erforderlich)
es: Nombre de job o ID (obligatorio)
fr: ID ou nom du job (requis)
ja: ジョブ名またはID（必須）
ko: Job 이름 또는 Id(필수)
zh_cn: 作业名称或 ID（必需）

source: Date in GMT
de: Datum in GMT
es: Fecha en GMT
fr: Date en GMT
ja: 日付（GMT）
ko: GMT 형식의 날짜
zh_cn: GMT 格式的日期

source: Date filter
de: Datumsfilter
es: Filtro de fecha
fr: Filtre de date
ja: 日付フィルター
ko: 날짜 필터
zh_cn: 日期筛选器

source: Use the form above to search for SLAs.
de: Verwenden Sie das Formular oben zum Suchen nach SLAs.
es: Use el formulario de arriba para buscar SLA.
fr: Utilisez le formulaire ci-dessus pour rechercher des SLA.
ja: 上のフォームを使用して SLA を検索します。
ko: SLA를 검색하려면 위의 양식을 사용합니다.
zh_cn: 使用以上表单搜索 SLA。

source: The server returned no results.
de: Vom Server wurden keine Ergebnisse ausgegeben.
es: El servidor no ha devuelto ningún resultado.
fr: Le serveur n'a renvoyé aucun résultat.
ja: サーバーから結果が返されませんでした。
ko: 서버에서 반환된 결과가 없습니다.
zh_cn: 服务器未返回结果。

source: List
de: Liste
es: Lista
fr: Liste
ja: リスト
ko: 목록
zh_cn: 列表

source: Chart
de: Diagramm
es: Gráfico
fr: Graphique
ja: チャート
ko: 차트
zh_cn: 图表

source: Job Status
es: Estado del job
fr: Statut du job
ja: ジョブのステータス
ko: Job 상태
zh_cn: 作业状态

source: click for more details
de: Klicken Sie hier für weitere Details
es: haga clic para obtener más información
fr: cliquez pour plus de détails
ja: クリックして詳細を表示
ko: 자세한 내용을 보려면 클릭
zh_cn: 单击获取更多详情

source: Workflow Dashboard
es: Panel de workflow
fr: Tableau de bord de workflow
ja: Workflow ダッシュボード
ko: Workflow 대시보드
zh_cn: Workflow 控制面板

source: Edit workflow
de: Workflow bearbeiten
es: Editar workflow
fr: Modifier un workflow
ja: Workflow を編集
ko: Workflow 편집
zh_cn: 编辑 Workflow

source: Kill %(workflow)s
de: %(workflow)s beenden
es: Eliminar %(workflow)s
fr: Détruire %(workflow)s
ja: %(workflow)s を強制終了
ko: %(workflow)s 중지
zh_cn: 停止 %(workflow)s

source: Are you sure you want to kill workflow %s?
de: Soll der Workflow %s wirklich beendet werden?
es: ¿Está seguro de que desea eliminar el workflow %s?
fr: Voulez-vous vraiment détruire le workflow %s ?
ja: Workflow %s を強制終了してもよろしいですか？
ko: Workflow %s을(를) 중지하시겠습니까?
zh_cn: 是否确定要停止 Workflow %s？

source: The workflow was killed.
de: Der Workflow wurde beendet.
es: El workflow ha sido eliminado.
fr: Le workflow a été détruit.
ja: Workflow が強制終了されました。
ko: Workflow가 중지되었습니다.
zh_cn: Workflow 已停止。

source: Suspend the workflow after finishing the current running actions
de: Workflow verschieben, wenn die derzeit aktiven Aktionen abgeschlossen sind
es: Suspender el workflow después de terminar las acciones actualmente en curso
fr: Suspendre le workflow une fois les actions en cours d'exécution terminées
ja: 現在実行中のアクションを完了したら、Workflow を一時停止
ko: 현재 실행 중인 작업을 완료한 후에 Workflow 중단
zh_cn: 在完成当前运行的操作后，暂停 workflow

source: Resume the workflow
de: Workflow fortsetzen
es: Reanudar el workflow
fr: Reprendre le workflow
ja: Workflow を再開
ko: Workflow 다시 시작
zh_cn: 恢复 Workflow
