Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Java program
de: Java-Programm
es: Programa Java
fr: Programme Java
ja: Java プログラム
ko: Java 프로그램
zh_cn: Java 程序

source: Select a saved Java program you want to schedule.
de: Wählen Sie ein gespeichertes Java-Programm aus, das Sie planen möchten.
es: Seleccione el programa de Java guardado que desee programar.
fr: Sélectionnez un programme Java enregistré que vous souhaitez planifier.
ja: スケジュールする保存済み Java プログラムを選択します。
ko: 일정을 예약할 저장된 Java 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 Java 程序。

source: Spark program
de: Spark-Programm
es: Programa Spark
fr: Programme Spark
ja: Spark プログラム
ko: Spark 프로그램
zh_cn: Spark 程序

source: Select a saved Spark program you want to schedule.
de: Wählen Sie ein gespeichertes Spark-Programm aus, das Sie planen möchten.
es: Seleccione el programa de Spark guardado que desee programar.
fr: Sélectionnez un programme Spark enregistré que vous souhaitez planifier.
ja: スケジュールする保存済み Spark プログラムを選択します。
ko: 일정을 예약할 저장된 Spark 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 Spark 程序。

source: Pig script
de: Pig-Skript
es: Secuencia de comandos de Pig
fr: Script Pig
ja: Pig スクリプト
ko: Pig 스크립트
zh_cn: Pig 脚本

source: Select a saved Sqoop program you want to schedule.
de: Wählen Sie ein gespeichertes Sqoop-Programm aus, das Sie planen möchten.
es: Seleccione un programa de Sqoop guardado que desee programar.
fr: Sélectionnez un programme Sqoop enregistré que vous souhaitez planifier.
ja: スケジュールする保存済み Sqoop プログラムを選択します。
ko: 일정을 예약할 저장된 Sqoop 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 Sqoop 程序。

source: DistCp program
de: DistCp-Programm
es: Programa DistCp
fr: Programme DistCp
ja: DistCp プログラム
ko: DistCp 프로그램
zh_cn: DistCp 程序

source: Select a saved DistCp program you want to schedule.
de: Wählen Sie ein gespeichertes DistCp-Programm aus, das Sie planen möchten.
es: Seleccione un programa de DistCp guardado que desee programar.
fr: Sélectionnez un programme DistCp enregistré que vous souhaitez planifier.
ja: スケジュールする保存済み DistCp プログラムを選択します。
ko: 일정을 예약할 저장된 DistCp 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 DistCp 程序。

source: Shell program
de: Shell-Programm
es: Programa Shell
fr: Programme Shell
ja: Shell プログラム
ko: Shell 프로그램
zh_cn: Shell 程序

source: Select a saved Shell program you want to schedule.
de: Wählen Sie ein gespeichertes Shell-Programm aus, das Sie planen möchten.
es: Seleccione un programa de Shell guardado que desee programar.
fr: Sélectionnez un programme Shell enregistré que vous souhaitez planifier.
ja: スケジュールする保存済み Shell プログラムを選択します。
ko: 일정을 예약할 저장된 Shell 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 Shell 程序。

source: MapReduce program
de: MapReduce-Programm
es: Programa MapReduce
fr: Programme MapReduce
ja: MapReduce プログラム
ko: MapReduce 프로그램
zh_cn: MapReduce 程序

source: Select a saved MapReduce program you want to schedule.
de: Wählen Sie ein gespeichertes MapReduce-Programm aus, das Sie planen möchten.
es: Seleccione un programa de MapReduce guardado que desee programar.
fr: Sélectionnez un programme MapReduce que vous souhaitez planifier.
ja: スケジュールする保存済み MapReduce プログラムを選択します。
ko: 일정을 예약할 저장된 MapReduce 프로그램을 선택합니다.
zh_cn: 选择您想要计划的已保存 MapReduce 程序。

source: %s for %s
de: %s für %s
es: %s para %s
fr: %s pour %s
ja: %s（%s）
ko: %s(%s)
zh_cn: %s 的 %s

source: Cannot return workflow since document attribute is None.
de: Zurückkehren zum Workflow nicht möglich, da das Dokumentenattribut "Kein" lautet.
es: El workflow no se puede devolver porque el atributo del documento es Ninguno.
fr: Impossible de renvoyer le workflow car l'attribut du document est Aucun.
ja: ドキュメント属性が None であるため、Workflow を返すことができません。
ko: 문서 특성이 없음이므로 Workflow를 반환할 수 없습니다.
zh_cn: 由于文档属性为无，无法返回 Workflow。

source: The frequency of the workflow parameter "%s" cannot be guessed from the frequency of the coordinator. It so needs to be specified manually.
de: Die Häufigkeit des Workflow-Parameters "%s" kann nicht aus der Häufigkeit des Coordinators bestimmt werden. Geben Sie sie manuell an.
es: La frecuencia del parámetro del workflow "%s" no se puede suponer a partir de la frecuencia del coordinator. Por lo tanto, se debe especificar manualmente.
fr: Il n'est pas possible de déterminer le paramètre "%s" de fréquence du workflow à partir de la fréquence du coordinator. Vous devez le précisez manuellement.
ja: Workflow パラメーター %s の頻度は、Coordinator の頻度から推測することができません。したがって、手動で指定する必要があります。
ko: Workflow 매개변수 "%s"의 사용 빈도는 Coordinator의 빈도로부터 추측할 수 없습니다. 따라서 수동으로 지정해야 합니다.
zh_cn: 无法从 Coordinator 的频率猜测 Workflow 参数 "%s" 的频率。它还需要手动指定。

source: Task of
de: Task von
es: Tarea de
fr: Tâche de
ko: 작업:
zh_cn: 任务属于

source: Snippet type %s is not supported in batch execution.
de: Snippet-Typ %s wird bei der Batch-Ausführung nicht unterstützt.
es: El tipo de fragmento de código %s no es compatible con la ejecución por lotes.
fr: Le type d'extrait %s n'est pas pris en charge dans une exécution par lot.
ja: スニペットタイプ %s は一括実行ではサポートされません
ko: 스니펫 유형 %s이(가) 배치 실행에 지원되지 않습니다.
zh_cn: 批处理执行不支持代码段类型 %s。

source: Could not set field %(field)s: %(exception)s
de: Das Feld %(field)s: %(exception)s konnte nicht festgelegt werden.
es: No se ha podido establecer el campo %(field)s: %(exception)s
fr: Impossible de définir le champ %(field)s : %(exception)s
ja: フィールド %(field)s：%(exception)s を 設定できませんでした。
ko: 필드 %(field)s을(를) 설정할 수 없음: %(exception)s
zh_cn: 无法设置字段 %(field)s：%(exception)s

source: invalid frequency: %s
de: Ungültige Frequenz: %s
es: Frecuencia no válida: %s
fr: fréquence non valide : %s
ja: 無効な頻度：%s
ko: 올바르지 않은 주기: %s
zh_cn: 无效的频率：%s

source: Tag with namespace %(namespace)s is not valid. Please use one of the following namespaces: %(namespaces)s
de: Tag mit Namespace %(namespace)s ist nicht gültig. Verwenden Sie einen der folgenden Namespaces: %(namespaces)s
es: La etiqueta con namespace %(namespace)s no es válida. Utilice uno de los siguientes namespaces: %(namespaces)s
fr: La balise avec l'espace de noms %(namespace)s n'est pas valide. Veuillez utiliser l'un des espaces de noms suivants : %(namespaces)s
ja: 名前空間 %(namespace)s のタグが有効ではありません。次の名前空間のいずれかを使用してください：%(namespaces)s
ko: Namespace %(namespace)s을(를) 포함하는 태그가 올바르지 않습니다. 다음 namespace 중 하나를 사용하십시오. %(namespaces)s
zh_cn: 带命名空间 %(namespace)s 的标记无效。请使用以下任一命名空间：%(namespaces)s

source: Could not find any nodes in Bundle definition. Maybe it's malformed?
de: Keine Knoten in Bündeldefinition gefunden. Vielleicht hat sie die falsche Form?
es: No se ha podido encontrar ningún nodo en la definición de bundle. Es posible que tenga un formato incorrecto.
fr: Impossible de trouver des noeuds dans la définition de bundle. Peut-être est-elle mal formée ?
ja: Bundle 定義でノードが見つかりませんでした。形式に不備がある可能性があります。
ko: Bundle 정의에서 노드를 찾을 수 없습니다. 잘못 구성되었을 수 있습니다.
zh_cn: 在 Bundle 定义中找不到任何节点。是否有格式错误？

source: Could not find any nodes in Coordinator definition. Maybe it's malformed?
de: Keine Knoten in Coordinator-Definition gefunden. Vielleicht hat sie die falsche Form?
es: No se ha podido encontrar ningún nodo en la definición de coordinator. Es posible que tenga un formato incorrecto.
fr: Impossible de trouver des noeuds dans la définition de coordinator. Peut-être est-elle mal formée ?
ja: Coordinator 定義でノードが見つかりませんでした。形式に不備がある可能性があります。
ko: Coordinator 정의에서 노드를 찾을 수 없습니다. 잘못 구성되었을 수 있습니다.
zh_cn: 在 Coordinator 定义中找不到任何节点。是否有格式错误？

source: Node with name %s for workflow %s does not exist.
de: Knoten mit Namen %s für Workflow %s ist nicht vorhanden.
es: El nodo con el nombre %s para el workflow %s no existe.
fr: Le nœud nommé %s pour le workflow %s n'existe pas.
ja: %s という名前のノード（Workflow %s）は存在しません。
ko: Workflow %s에 %s 이름을 가진 노드가 존재하지 않습니다.
zh_cn: Workflow %s 不存在名为 %s 的节点。

source: Node %s has a link that is missing 'to' attribute.
de: Knoten %s weist einen Link mit fehlendem Attribut 'to' auf.
es: El nodo %s contiene un enlace sin atributo 'to'.
fr: Le noeud %s a un lien dont l'attribut "to" est manquant.
ja: ノード %s には、'to' 属性が欠落しているリンクがあります。
ko: 노드 %s에 'to' 속성이 누락된 링크가 있습니다.
zh_cn: 节点 %s 具有缺少“目标”属性的链接。

source: Node %s has not been defined.
de: Knoten %s wurde nicht definiert.
es: El nodo %s no se ha definido.
fr: Le noeud %s n'a pas été défini.
ja: ノード %s が定義されていません。
ko: 노드 %s이(가) 정의되지 않았습니다.
zh_cn: 未定义节点 %s。

source: Node %s has a link that is missing 'start' attribute.
de: Knoten %s weist einen Link auf, dessen Attribut 'start' fehlt.
es: El nodo %s contiene un enlace sin atributo 'start'.
fr: Le noeud %s a un lien dont l'attribut "start" est manquant.
ja: ノード %s には、'start' 属性が欠落しているリンクがあります。
ko: 노드 %s에 'start' 속성이 누락된 링크가 있습니다.
zh_cn: 节点 %s 具有缺少“起点”属性的链接。

source: Node %s has not been defined
de: Knoten %s wurde nicht definiert
es: El nodo %s no se ha definido
fr: Le nœud %s n'a pas été défini
ja: ノード %s が定義されていません
ko: 노드 %s이(가) 정의되지 않았습니다.
zh_cn: 未定义节点 %s

source: Workflow start has not been created.
de: Workflow-Start wurde nicht erstellt.
es: No se ha creado el inicio del workflow.
fr: Le début du workflow n'a pas été créé.
ja: Workflow の開始が作成されていません。
ko: Workflow 시작이 생성되지 않았습니다.
zh_cn: 未创建 Workflow 起点。

source: Workflow end has not been created.
de: Workflow-Ende wurde nicht erstellt.
es: No se ha creado la finalización del workflow.
fr: La fin du workflow n'a pas été créée.
ja: Workflow の終了が作成されていません。
ko: Workflow 끝이 생성되지 않았습니다.
zh_cn: 未创建 Workflow 终点。

source: Cannot import workflows that have decision DAG leaf nodes with multiple children or no children.
de: Workflows, die über Entscheidungs-DAG-Blattknoten mit mehreren untergeordneten Elementen oder ohne Elemente verfügen, können nicht importiert werden.
es: No se pueden importar workflows que tengan nodos de hoja DAG de decisión con varios secundarios o sin secundarios.
fr: Impossible d'importer les workflows dont les noeuds feuilles DAG de décision ont plusieurs enfants ou aucun.
ja: 複数の子を持つ、または子を 1 つも持たない決定 DAG リーフノードを持つ Workflow はインポートできません。
ko: 여러 하위가 포함되었거나 포함된 하위가 없는 결정 DAG 리프 노드를 가진 workflow는 가져올 수 없습니다.
zh_cn: 无法导入具有决策 DAG 叶节点（带多个子级或无子级）的 workflow。

source: Cannot import workflows that have decisions paths with multiple terminal nodes that converge on a single terminal node.
de: Workflows, die über Entscheidungspfade mit mehreren Terminal-Knoten verfügen, die in einem einzelnen Terminal-Knoten zusammenlaufen, können nicht importiert werden.
es: No se pueden importar workflows que tengan rutas de decisión con varios nodos terminales que convergen en un único nodo terminal.
fr: Impossible d'importer les workflows dont les chemins de décision comportent plusieurs noeuds terminaux qui convergent vers un seul noeud terminal.
ja: 1 つのターミナルノードに収束する複数のターミナルノードを持つ決定パスを持つ Workflow はインポートできません。
ko: 단말 노드 하나에서 결합되는 단말 노드가 여러 개 포함된 결정 경로를 가진 Workflow는 가져올 수 없습니다.
zh_cn: 无法导入具有决策路径（带多个终端节点）的 workflow，这些节点可汇聚到单个终端节点中。

source: Cannot import workflows that have decisions paths that never end.
de: Workflows mit unendlichen Entscheidungspfaden können nicht importiert werden.
es: No se pueden importar workflows que tengan rutas de decisión que nunca finalizan.
fr: Impossible d'importer des workflows dont les chemins de décision sont sans fin.
ja: 終了しない決定パスを持つ Workflow をインポートすることはできません。
ko: 끝나지 않는 결정 경로를 가진 Workflow는 가져올 수 없습니다.
zh_cn: 无法导入具有无终点的决策路径的 workflow。

source: Different ends found in fork.
de: Unterschiedliche Endungen in Fork gefunden.
es: Se han encontrado finalizaciones diferentes en la bifurcación.
fr: Différentes extrémités ont été identifiées au niveau de la fourche.
ja: フォークで異なる終端が見つかりました。
ko: 분기에서 다른 끝을 찾았습니다.
zh_cn: 在分岔处找到不同的终端。

source: No hadoop file system to operate on.
de: Kein zu verwendendes Hadoop-Dateisystem.
es: No hay ningún sistema de archivos Hadoop en el que operar.
fr: Aucun système de fichiers Hadoop à utiliser.
ja: 操作する Hadoop ファイルシステムがありません。
ko: 작업을 수행할 hadoop 파일 시스템이 없습니다.
zh_cn: 没有要在其上操作的 hadoop 文件系统。

source: Could not find workflow name when resolving subworkflow.
de: Workflowname bei der Auflösung des Unterworkflows nicht gefunden.
es: No se ha podido encontrar el nombre de workflow al resolver el subworkflow.
fr: Nom de workflow introuvable lors de la résolution du sous-workflow.
ja: Subworkflow の解決時、Workflow 名を見つけることができませんでした。
ko: Subworkflow를 확인할 때 workflow 이름을 찾을 수 없습니다.
zh_cn: 解析子工作流时找不到工作流名称。

source: Could not find workflow with name %s extracted from subworkflow path %s
de: Aus dem Unterworkflowpfad %s extrahierter Workflow mit Namen %s nicht gefunden.
es: No se ha podido encontrar el workflow %s extraído de la ruta del subworkflow %s.
fr: Impossible de trouver de workflow nommé %s extrait du chemin d'accès de sous-workflow %s
ja: 名前 %s の Workflow（Subworkflow パス %s から抽出）を見つけることができませんでした
ko: subworkflow 경로 %s에서 추출한 이름이 %s인 workflow를 찾을 수 없음
zh_cn: 找不到名称为 %s 且从子 Workflow 路径中提取的 Workflow %s

source: Could not find workflow at path %s: %s
de: Workflow bei Pfad %s nicht gefunden: %s
es: No se ha podido encontrar el workflow en la ruta %s: %s
fr: Impossible de trouver le workflow au chemin d'accès %s : %s
ja: パス %s で Workflow が見つかりませんでした：%s
ko: 경로 %s에서 workflow를 찾을 수 없음: %s
zh_cn: 在路径 %s 中找不到 Workflow：%s

source: Could not find any nodes in Workflow definition. Maybe it's malformed?
de: Keine Knoten in Workflowdefinition gefunden. Vielleicht hat sie die falsche Form?
es: No se ha podido encontrar ningún nodo en la definición de workflow. Es posible que tenga un formato incorrecto.
fr: Impossible de trouver des noeuds dans la définition de workflow. Peut-être est-elle mal formée ?
ja: Workflow 定義でノードが見つかりませんでした。形式に不備がある可能性があります。
ko: Workflow 정의에서 노드를 찾을 수 없습니다. 잘못 구성되었을 수 있습니다.
zh_cn: 在 Workflow 定义中找不到任何节点。是否有格式错误？

source: Installing workflow %s
de: Workflow %s wird installiert
es: Instalando workflow %s
fr: Installation du workflow %s
ja: Workflow %s をインストール中
ko: Workflow %s 설치 중
zh_cn: 正在安装 Workflow %s

source: Installing coordinator %s
de: Coordinator %s wird installiert
es: Instalando coordinator %s
fr: Installation du coordinator %s
ja: Coordinator %s をインストール中
ko: Coordinator %s 설치 중
zh_cn: 正在安装 Coordinator %s

source: Installing bundle %s
de: Bundle %s wird installiert
es: Instalando bundle %s
fr: Installation du bundle %s
ja: Bundle %s をインストール中
ko: Bundle %s 설치 중
zh_cn: 正在安装 Bundle %s

source: MapReduce Sleep Job
es: Job MapReduce Sleep
fr: Job MapReduce Sleep
zh_cn: MapReduce Sleep 作业

source: Sleep: Example MapReduce job
de: Sleep: Beispiel für MapReduce-Job
es: Sleep: ejemplo de job MapReduce
fr: Sleep : exemple de job MapReduce
ko: Sleep: MapReduce Job 예
zh_cn: Sleep：MapReduce 作业示例

source: Java TeraGen Job
es: Job TeraGen de Java
fr: Job Java TeraGen
zh_cn: Java TeraGen 作业

source: TeraGen: Generates N rows of random data to a directory.
de: TeraGen: Generiert N Zeilen mit zufälligen Daten in einem Verzeichnis.
es: TeraGen: genera N filas de datos aleatorios en un directorio.
fr: TeraGen : génère un nombre X de lignes de données aléatoires dans un répertoire.
ko: TeraGen: 무작위 데이터의 N개 행을 디렉토리에 생성합니다.
zh_cn: TeraGen：生成 N 行随机数据并存放在某个目录中。

source: Spark File Copy Job
es: Job de copia de archivo Spark
fr: Job Spark de copie de fichiers
zh_cn: Spark File Copy 作业

source: File Copy: Example Spark job
de: File Copy: Beispiel für Spark-Job
es: Copiar archivos: ejemplo de job Spark
fr: Copie de fichiers : exemple de job Spark
ko: File Copy: Spark Job 예
zh_cn: File Copy：Spark 作业示例

source: PySpark Pi Estimator Job
es: Job PySpark Pi Estimator
fr: Job PySpark Pi Estimator
zh_cn: PySpark Pi Estimator 作业

source: Pi Estimator: Example PySpark job
de: Pi Estimator: Beispiel für PySpark-Job
es: Pi Estimator: ejemplo de job PySpark
fr: Pi Estimator : exemple de job PySpark
ko: Pi Estimator: PySpark Job 예
zh_cn: Pi Estimator：PySpark 作业示例

source: Creating sample directory '%s' in HDFS
de: Beispiel "%s" in HDFS wird erstellt
es: Creando directorio de muestra '%s' en HDFS
fr: Création d'un exemple de répertoire "%s" dans HDFS
ja: HDFS でのサンプルディレクトリ '%s' の作成
ko: HDFS에 샘플 디렉토리 '%s' 생성 중
zh_cn: 在 HDFS 中创建示例目录“%s”

source: Copying examples %(local_dir)s to %(remote_data_dir)s
de: Kopieren von Beispielen %(local_dir)s nach %(remote_data_dir)s
es: Copiando ejemplos de %(local_dir)s a %(remote_data_dir)s
fr: Copie des exemples de %(local_dir)s vers %(remote_data_dir)s
ja: 例を %(local_dir)s から %(remote_data_dir)s にコピーしています
ko: 예제 %(local_dir)s을(를) %(remote_data_dir)s(으)로 복사
zh_cn: 复制示例 %(local_dir)s 至 %(remote_data_dir)s

source: Copying data %(local_dir)s to %(remote_data_dir)s
de: Kopieren von Daten %(local_dir)s nach %(remote_data_dir)s
es: Copiando datos de %(local_dir)s a %(remote_data_dir)s
fr: Copie des données de %(local_dir)s vers %(remote_data_dir)s
ja: データを %(local_dir)s から %(remote_data_dir)s にコピーしています
ko: 데이터 %(local_dir)s을(를) %(remote_data_dir)s(으)로 복사
zh_cn: 复制示例 %(local_dir)s 至 %(remote_data_dir)s

source: Installing examples...
de: Beispiele installieren...
es: Instalando ejemplos...
fr: Installation d'exemples…
ja: 例をインストール中...
ko: 예제 설치 중...
zh_cn: 正在安装示例...

source: Cannot backwards migrate this change.
de: Diese Änderung kann nicht rückwärts migriert werden.
es: No se puede deshacer la migración del cambio.
fr: Impossible d'effectuer une migration arrière de cette modification.
ja: この変更を後方移行できません。
ko: 이 변경을 역으로 마이그레이션할 수 없습니다.
zh_cn: 无法向后迁移此更改。

source: Switch to the editor
de: Zum Editor wechseln
es: Cambiar al editor
fr: Basculer vers l'éditeur
ja: エディターに切り替え
ko: 편집기로 전환
zh_cn: 切换到编辑器

source: Oozie dashboard icon
de: Oozie Dashboard-Symbol
es: Icono del panel de Oozie
fr: Icône Tableau de bord Oozie
ja: Oozie ダッシュボードアイコン
ko: Oozie 대시보드 아이콘
zh_cn: Oozie 控制面板图标

source: Oozie Dashboard
es: Interfaz de Oozie
fr: Tableau de bord Oozie
ja: Oozie ダッシュボード
ko: Oozie 대시보드
zh_cn: Oozie 控制面板

source: Switch to the dashboard
de: Zum Dashboard wechseln
es: Cambiar al panel
fr: Basculer vers le tableau de bord
ja: ダッシュボードに切り替え
ko: 대시보드로 전환
zh_cn: 切换到控制面板

source: Oozie Editor
es: Editor de Oozie
fr: Editeur Oozie
ko: Oozie 편집기
zh_cn: Oozie 编辑器

source: Workflows
ja: Workflow
ko: Workflow
zh_cn: Workflow

source: Coordinators
ja: Coordinator
ko: Coordinator
zh_cn: Coordinator

source: This is the old editor, please migrate your jobs to the
de: Dies ist der alte Editor, migrieren Sie Ihre Jobs zum
es: Este es el editor antiguo. Por favor, migre sus jobs al
fr: Il s'agit de l'ancien éditeur. Migrez vos jobs vers le
ja: これは古いエディタです。ジョブを
ko: 이전 편집기입니다. job을 다음으로 마이그레이션하십시오.
zh_cn: 这是旧编辑器，请将您作业迁移到

source: new editor.
de: neuen Editor.
es: editor nuevo.
fr: nouvel éditeur.
ja: 新しいエディタに移行してください。
ko: 새 편집기입니다.
zh_cn: 新编辑器。

source: Value
de: Wert
es: Valor
fr: Valeur
ja: 値
ko: 값
zh_cn: 值

source: Enable
de: Aktivieren
es: Activar
fr: Activer
ja: 有効化
ko: 설정
zh_cn: 启用

source: Nominal time
de: Nominale Zeit
es: Tiempo nominal
fr: Temps nominal
ja: 公称時間
ko: 명목 시간
zh_cn: 标定时间

source: Should start
de: Sollte beginnen
es: Debería iniciarse
fr: Doit débuter
ja: 開始する必要があります
ko: 시작 시간
zh_cn: 开始时间

source: Should end
de: Sollte enden
es: Debería finalizar
fr: Doit se terminer
ja: 終了する必要があります
ko: 끝 시간
zh_cn: 结束时间

source: Max duration
de: Maximale Dauer
es: Duración máx.
fr: Durée max.
ja: 最長継続期間
ko: 최대 소요 시간
zh_cn: 最大持续时间

source: Alert events
de: Benachrichtigungsereignisse
es: Eventos de alerta
fr: Evénements d'alerte
ja: アラートイベント
ko: 경고 이벤트
zh_cn: 警报事件

source: Alert contact
de: Kontakt benachrichtigen
es: Contacto de alerta
fr: Contact d'alerte
ja: アラート連絡先
ko: 경고 문의
zh_cn: 警报触点

source: Notification message
de: Benachrichtigungsmeldung
es: Mensaje de notificación
fr: Message de notification
ja: 通知メッセージ
ko: 알림 메시지
zh_cn: 通知消息

source: My Job has encountered an SLA event!
de: Mein Job hat ein SLA-Ereignis erkannt.
es: Mi job ha encontrado un evento de SLA.
fr: Mon job a rencontré un événement SLA.
ja: 自分のジョブで SLA イベントが発生しました。
ko: 내 Job에 SLA 이벤트가 발생했습니다!
zh_cn: 我的作业遇到了 SLA 事件！

source: Upstream apps
de: Upstream-Anwendungen
es: Aplicaciones ascendentes
fr: Applications en amont
ja: アップストリームアプリ
ko: 업스트림 앱
zh_cn: 上游应用程序

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
zh_cn: 关闭

source: Choose a
de: Wählen Sie eine(n)
es: Elegir una
fr: Sélectionner un
ja: 選択
ko: 선택
zh_cn: 选择一个

source: folder
de: Ordner
es: carpeta
fr: dossier
ja: フォルダ
ko: 폴더
zh_cn: 文件夹

source: file
de: Datei
es: archivo
fr: fichier
ja: ファイル
ko: 파일
zh_cn: 文件

source: The end cannot be before the starting moment
de: Das Ende kann nicht vor dem Start liegen.
es: La finalización no puede ser anterior al momento de inicio
fr: La fin ne peut pas être antérieure au début
ja: 終了を開始時の前にすることはできません。
ko: 끝은 시작보다 나중이어야 함
zh_cn: 结束时间不能早于开始时间

source: -all-
de: -alle-
es: -todo-
fr: -tout-
ja: -すべて-
ko: -모두-
zh_cn: -全部-

source: minute
es: minuto
ja: 分
ko: 분
zh_cn: 分钟

source: hour
de: Stunde
es: hora
fr: heure
ja: 時
ko: 시간
zh_cn: 小时

source: day
de: Tag
es: día
fr: jour
ja: 日
ko: 일
zh_cn: 日

source: week
de: Woche
es: semana
fr: semaine
ja: 週
ko: 주
zh_cn: 周

source: month
de: Monat
es: mes
fr: mois
ja: 月
ko: 월
zh_cn: 月

source: year
de: Jahr
es: año
fr: année
ja: 年
ko: 년
zh_cn: 年

source: Every
de: Alle
es: Cada
fr: Chaque
ja: 毎
ko: 다음 마다
zh_cn: 每

source: at
de: bei
es: a
fr: à
ja: で
ko: 다음에서
zh_cn: 在

source: minutes past the hour
de: Minuten nach der Stunde
es: minutos después de la hora
fr: minutes après l'heure
ja: 分過ぎ（毎時）
ko: 분(1시간 이후)
zh_cn: 超过小时的分钟数

source: on
de: am
es: en
fr: sur
ja: に
ko: 다음에서
zh_cn: 在

source: of
de: von
es: de
fr: sur
zh_cn: 的

source: on the
de: am
es: en el
fr: sur le
ja: に
ko: 다음에서
zh_cn: 在

source: The tag %s is not supported !
de: Das Tag %s wird nicht unterstützt!
es: ¡No se admite la etiqueta %s!
fr: La balise %s n'est pas prise en charge.
ja: タグ %s はサポートされていません。
ko: %s 태그는 지원되지 않습니다!
zh_cn: 不支持标记 %s！

source: Bad number of elements
de: Fehlerhafte Anzahl von Elementen
es: Número de elementos incorrecto
fr: Mauvais nombre d'éléments
ja: 要素の無効な番号
ko: 인수 개수가 잘못됨
zh_cn: 元素数量错误

source: The jquery_element should be set into jqCron settings
de: jquery_element muss in jqCron-Einstellungen festgelegt werden
es: El elemento jquery_element debe establecerse en los ajustes jqCron
fr: jquery_element doit être défini dans les paramètres jqCron
ja: jquery_element を jqCron の設定で設定する必要があります
ko: jquery_element를 jqCron 설정으로 전송해야 함
zh_cn: jquery 元素应设置到 jqCron 设置中

source: Unrecognized expression
de: Nicht erkannter Ausdruck
es: Expresión no reconocida
fr: Expression non reconnue
ja: 認識されない式
ko: 인식할 수 없는 식
zh_cn: 未识别的表达式

source: sunday
de: Sonntag
es: domingo
fr: dimanche
ja: 日曜日
ko: 일요일
zh_cn: 星期日

source: monday
de: Montag
es: lunes
fr: lundi
ja: 月曜日
ko: 월요일
zh_cn: 星期一

source: tuesday
de: Dienstag
es: martes
fr: mardi
ja: 火曜日
ko: 화요일
zh_cn: 星期二

source: wednesday
de: Mittwoch
es: miércoles
fr: mercredi
ja: 水曜日
ko: 수요일
zh_cn: 星期三

source: thursday
de: Donnerstag
es: jueves
fr: jeudi
ja: 木曜日
ko: 목요일
zh_cn: 星期四

source: friday
de: Freitag
es: viernes
fr: vendredi
ja: 金曜日
ko: 금요일
zh_cn: 星期五

source: saturday
de: Samstag
es: sábado
fr: samedi
ja: 土曜日
ko: 토요일
zh_cn: 星期六

source: january
de: Januar
es: enero
fr: janvier
ja: 1 月
ko: 1월
zh_cn: 一月

source: february
de: Februar
es: febrero
fr: février
ja: 2 月
ko: 2월
zh_cn: 二月

source: march
de: März
es: marzo
fr: mars
ja: 3 月
ko: 3월
zh_cn: 三月

source: april
es: abril
fr: avril
ja: 4 月
ko: 4월
zh_cn: 四月

source: may
de: Mai
es: mayo
fr: mai
ja: 5 月
ko: 5월
zh_cn: 五月

source: june
de: Juni
es: junio
fr: juin
ja: 6 月
ko: 6월
zh_cn: 六月

source: july
de: Juli
es: julio
fr: juillet
ja: 7 月
ko: 7월
zh_cn: 七月

source: august
es: agosto
fr: août
ja: 8 月
ko: 8월
zh_cn: 八月

source: september
es: septiembre
fr: septembre
ja: 9 月
ko: 9월
zh_cn: 九月

source: october
de: Oktober
es: octubre
fr: octobre
ja: 10 月
ko: 10월
zh_cn: 十月

source: november
es: noviembre
fr: novembre
ja: 11 月
ko: 11월
zh_cn: 十一月

source: december
de: Dezember
es: diciembre
fr: décembre
ja: 12 月
ko: 12월
zh_cn: 十二月

source: Do you really want to kill the selected jobs?
de: Möchten Sie die ausgewählten Jobs wirklich abbrechen?
es: ¿Seguro que desea eliminar los jobs seleccionados?
fr: Voulez-vous vraiment détruire les jobs sélectionnés ?
ja: 選択したジョブを強制終了しもよろしいですか？
ko: 선택한 job을 중지하시겠습니까?
zh_cn: 是否确定要停止所选作业？
