Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Edit Workflow
de: Workflow bearbeiten
es: Editar workflow
fr: Modifier un workflow
ja: Workflow を編集
ko: Workflow 편집
zh_cn: 编辑 Workflow

source: Unsaved
de: Ungespeichert
es: Sin guardar
fr: Non enregistré
ja: 未保存
ko: 미저장
zh_cn: 未保存

source: Editor
fr: Editeur
ja: エディター
ko: 편집기
zh_cn: 编辑器

source: Go upload additional files and libraries to the deployment directory on HDFS
de: Weitere Dateien und Bibliotheken in das Bereitstellungsverzeichnis in HDFS hochladen
es: Cargar archivos y bibliotecas adicionales al directorio de implementación en HDFS
fr: Téléchargez les fichiers et les bibliothèques supplémentaires vers le répertoire de déploiement sur HDFS
ja: 追加のファイルとライブラリを HDFS の配置ディレクトリにアップロードしてください
ko: HDFS의 배포 디렉토리에 추가 파일 및 라이브러리 업로드
zh_cn: 将其他文件和库上传到 HDFS 上的部署目录

source: Click to import an Oozie workflow action or Job Designer action
de: Klicken, um eine Oozie-Workflow-Aktion oder eine Job Designer-Aktion zu importieren.
es: Haga clic para importar una acción de workflow de Oozie o una acción de Job Designer
fr: Cliquer pour importer une action de workflow Oozie ou une action Job Designer
ja: クリックすると、Oozie の Workflow アクションまたは Job Designer アクションがインポートされます
ko: Oozie Workflow 작업 또는 Job Designer 작업을 가져오려면 클릭
zh_cn: 单击以导入 Oozie Workflow 操作或作业设计器操作

source: Import action
de: Aktion importieren
es: Importar acción
fr: Importer une action
ja: アクションをインポート
ko: 가져오기 작업
zh_cn: 导入操作

source: Edit kill node
de: Beendigungsknoten bearbeiten
es: Editar el nodo de fin de flujo de trabajo
fr: Modifier le noeud de fin de flux de travail
ja: 強制終了ノードを編集
ko: 중지 노드 편집
zh_cn: 编辑停止节点

source: Kill node
de: Beendigungsknoten
es: Eliminar nodo
fr: Détruire un nœud
ja: 強制終了ノード
ko: 중지 노드
zh_cn: 停止节点

source: Submit this workflow
de: Diesen Workflow übermitteln
es: Enviar este workflow
fr: Envoyer ce workflow
ja: この Workflow をサブミット
ko: 이 Workflow 제출
zh_cn: 提交此 workflow

source: Schedule this workflow
de: Diesen Workflow planen
es: Programar este workflow
fr: Planifier ce workflow
ja: この Workflow をスケジュール
ko: 이 Workflow 예약
zh_cn: 计划此 workflow

source: Copy this workflow
de: Diesen Workflow kopieren
es: Copiar este workflow
fr: Copier ce workflow
ja: この Workflow をコピー
ko: 이 Workflow 복사
zh_cn: 复制此 Workflow

source: Export this workflow
de: Diesen Workflow exportieren
es: Exportar este workflow
fr: Exporter ce workflow
ja: この Workflow をエクスポート
ko: 이 Workflow 내보내기
zh_cn: 导出此 workflow

source: Export
de: Exportieren
es: Exportar
fr: Exporter
ja: エクスポート
ko: 내보내기
zh_cn: 导出

source: If the "to" field has content, then the workflow editor assumes that the defined email action is to be placed before the kill action.
de: Wenn das Feld "An" Inhalte aufweist, geht der Workflow-Editor davon aus, dass die festgelegte E-Mail-Aktion vor der Beendigungsaktion positioniert werden soll.
es: Si el campo "para" tiene contenido, el editor del workflow entiende que la acción de correo electrónico definida debe tener lugar antes de la acción de eliminación.
fr: Si le champ "to" comporte une valeur, l'éditeur de workflow suppose que l'action d'e-mail définie doit être placée avant l'action de destruction.
ja: "to" フィールドに中身がある場合、Workflow Editor は、強制終了アクションの前に、定義済みの電子メールアクションが配置されるものと想定します。
ko: "받는 사람" 필드에 내용이 있으면 Workflow 편집기는 중지 작업 전에 정의된 Email 작업이 지정될 것이라고 가정합니다.
zh_cn: 如果“至”字段中有内容，则 Workflow 编辑器会假定先替换定义的电子邮件操作，然后再停止操作。

source: Action enabled:
de: Aktion aktiviert:
es: Acción activada:
fr: Action activée :
ja: アクションが有効です：
ko: 작업 설정됨:
zh_cn: 操作已启用：

source: Job Designer
fr: Concepteur de jobs
zh_cn: 作业设计器

source: Import Action from Job Designer
de: Aktion aus Job Designer importieren
es: Importar acción de Job Designer
fr: Importer une action depuis le concepteur de jobs
ja: Job Designer からアクションをインポート
ko: Job Designer에서 작업 가져오기
zh_cn: 从作业设计器导入操作

source: Click on a row to import the design as an action in the workflow. The action will be added to the beginning of the flow.
de: Klicken Sie zum Importieren des Designs als Aktion im Workflow auf eine Zeile. Diese Aktion wird am Anfang des Workflows eingefügt.
es: Haga clic en una fila para importar el diseño como una acción del workflow. La acción se agregará al principio del workflow.
fr: Cliquez sur une ligne pour importer la conception comme une action dans le workflow. L'action sera ajoutée au début du flux.
ja: 行をクリックすると、設計がアクションとして Workflow にインポートされます。このアクションはフローの先頭に追加されます。
ko: Workflow에서 디자인을 작업으로 가져오려면 행을 클릭하십시오. 이 작업은 흐름 시작 위치에 추가됩니다.
zh_cn: 单击行以导入设计作为 Workflow 中的操作。该操作将被添加到流程的开头。

source: Click to import action to workflow
de: Klicken, um die Aktion in den Workflow zu importieren
es: Haga clic para importar la acción en el workflow
fr: Cliquer pour importer une action vers le workflow
ja: クリックすると、アクションが Workflow にインポートされます
ko: Workflow로 작업을 가져오려면 클릭
zh_cn: 单击以将操作导入 Workflow

source: Import Action from Oozie
de: Aktion aus Oozie importieren
es: Importar acción de Oozie
fr: Importer une action depuis Oozie
ja: Oozie からアクションをインポート
ko: Oozie에서 작업 가져오기
zh_cn: 从 Oozie 导入操作

source: Import Action from Workflow:
de: Aktion aus Workflow importieren:
es: Importar acción de workflow:
fr: Importer une action depuis le workflow :
ja: Workflow からアクションをインポート：
ko: Workflow에서 작업 가져오기
zh_cn: 从 Workflow 导入操作：

source: Click on a row to import the action.
de: Klicken Sie auf eine Zeile, um die Aktion zu importieren.
es: Haga clic en una fila para importar la acción.
fr: Cliquez sur une ligne pour importer l'action.
ja: 行をクリックすると、アクションがインポートされます。
ko: 작업을 가져오려면 행을 클릭하십시오.
zh_cn: 单击行以导入操作。

source: Drag and drop this action on the workflow
de: Diese Aktion per Drag-and-drop in den Workflow ziehen
es: Arrastrar y enviar esta acción al workflow
fr: Glissez-déposez cette action sur le workflow
ja: このアクションを Workflow にドラッグアンドドロップ
ko: Workflow에서 이 작업 끌어서 놓기
zh_cn: 在 Workflow 上拖放此操作

source: No actions: drag some from the panel above
de: Keine Aktionen: aus dem Fenster oben ziehen
es: Sin acciones: arrastre una del panel anterior
fr: Aucune action : faites glisser des actions depuis le volet ci-dessus
ja: アクションなし：上のパネルからいくつかをドラッグ
ko: 작업 없음: 위 패널에서 일부 작업 끌어오기
zh_cn: 无操作：从上方面板中拖动一些操作

source: The workflow has some unsaved changes
de: Der Workflow enthält nicht gespeicherte Änderungen.
es: El workflow tiene cambios sin guardar.
fr: Ce workflow contient des modifications non enregistrées
ja: この Workflow には未保存の変更があります。
ko: Workflow에 저장되지 않은 변경 사항이 있습니다.
zh_cn: Workflow 存在某些未保存的更改

source: Please save or undo your changes before submitting it.
de: Speichern Sie Ihre Änderungen oder machen Sie sie vor dem Senden rückgängig.
es: Guarde o deshaga los cambios antes de enviarlo.
fr: Enregistrez ou annulez vos modifications avant de l'envoyer.
ja: 変更を保存するか元に戻してからサブミットしてください。
ko: 제출하기 전에 변경 내용을 저장하거나 실행 취소하십시오.
zh_cn: 提交之前，请保存或撤销您的更改。

source: Save and submit
de: Speichern und senden
es: Guardar y enviar
fr: Enregistrer et envoyer
ja: 保存してサブミット
ko: 저장 후 제출
zh_cn: 保存并提交

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
zh_cn: 编辑

source: Convert to Decision
de: In Entscheidung umwandeln
es: Convertir en decisión
fr: Convertir en décision
ja: 決定に変換
ko: 결정으로 변환
zh_cn: 转换为决策

source: Received invalid response from server
de: Ungültige Antwort vom Server erhalten
es: Se ha recibido una respuesta no válida del servidor
fr: La réponse reçue du serveur est incorrecte
ja: サーバーから無効な応答を受信しました
ko: 서버에서 올바르지 않은 응답이 수신됨
zh_cn: 从服务器接收到无效响应

source: Could not save workflow
de: Workflow konnte nicht gespeichert werden
es: No se ha podido guardar el workflow
fr: Impossible d'enregistrer le workflow
ja: Workflow を保存できませんでした
ko: Workflow를 저장할 수 없음
zh_cn: 无法保存 Workflow

source: Workflow saved
de: Workflow gespeichert
es: Workflow guardado
fr: Workflow enregistré
ja: Workflow が保存されました
ko: Workflow가 저장됨
zh_cn: Workflow 已保存

source: Workflow is in read only mode.
de: Workflow ist schreibgeschützt.
es: El workflow está en modo de solo lectura.
fr: Le workflow est en lecture seule.
ja: Workflow は読み取り専用モードです。
ko: Workflow는 읽기 전용 모드입니다.
zh_cn: Workflow 处于只读模式。

source: Error loading workflow
de: Fehler beim Laden des Workflows
es: Error al cargar el workflow
fr: Erreur lors du chargement du workflow
ja: Workflow のロード中にエラーが発生しました
ko: Workflow 로드 중 오류 발생
zh_cn: 加载 Workflow 时出错

source: Confirm Delete
de: Löschen bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression
ja: 削除を確認
ko: 삭제 확인
zh_cn: 确认删除

source: Are you sure you want to delete
de: Möchten Sie Folgendes wirklich löschen?
es: ¿Está seguro de que desea eliminar?
fr: Voulez-vous vraiment supprimer
ja: 削除してよろしいですか
ko: 삭제하시겠습니까?
zh_cn: 是否确定要删除

source: Action imported at the top of the workflow.
de: Aktion am Anfang des Workflows importiert.
es: Acción importada desde la parte superior del workflow.
fr: Action importée en haut du workflow.
ja: アクションが Workflow の最上部にインポートされました。
ko: Workflow 맨 위에서 작업을 가져왔습니다.
zh_cn: Workflow 顶部的已导入操作。

source: You have unsaved changes in this workflow.
de: In diesem Workflow befinden sich nicht gespeicherte Änderungen.
es: Hay cambios sin guardar en este workflow.
fr: Ce workflow contient des modifications non enregistrées.
ja: この Workflow には未保存の変更があります。
ko: 이 Workflow에 저장되지 않은 변경 내용이 있습니다.
zh_cn: 您尚未保存此 Workflow 中的更改。

source: There was a problem copying this workflow.
de: Beim Kopieren dieses Workflows ist ein Problem aufgetreten.
es: Se ha producido un problema al copiar este workflow.
fr: Un problème est survenu lors de la copie de ce workflow.
ja: この Workflow のコピー中に問題が発生しました。
ko: 이 Workflow를 복사하는 중에 문제가 발생했습니다.
zh_cn: 复制该 Workflow 时出现问题。

source: There was a problem submitting this workflow.
de: Beim Senden dieses Workflows ist ein Problem aufgetreten.
es: Se ha producido un problema al enviar este workflow.
fr: Un problème est survenu lors de l'envoi de ce workflow.
ja: この Workflow のサブミット中に問題が発生しました。
ko: 이 Workflow를 제출하는 중에 문제가 발생했습니다.
zh_cn: 提交该 Workflow 时出现问题。

source: Import Coordinator
de: Coordinator importieren
es: Importar coordinator
fr: Importer un coordinator
ja: Coordinator をインポート
ko: Coordinator 가져오기
zh_cn: 导入 Coordinator

source: You can import an external Oozie coordinator by providing the coordinator definition file.
de: Sie können einen externen Oozie-Coordinator importieren, indem Sie die Coordinator-Definitionsdatei angeben.
es: Puede importar un coordinator de Oozie externo proporcionando el archivo de definición del coordinator.
fr: Vous pouvez importer un coordinator Oozie externe en fournissant le fichier de définition du coordinator.
ja: Coordinator 定義ファイルを提供することで、外部 Oozie Coordinator をインポートできます。
ko: Coordinator 정의 파일을 제공하여 외부 Oozie Coordinator를 가져올 수 있습니다.
zh_cn: 您可通过提供 Coordinator 定义文件导入外部 Oozie Coordinator。

source: Supported coordinator versions are 0.2. Other versions might work depending on their complexity.
de: Unterstützte Coordinator-Versionen sind 0.2. Andere Versionen können je nach Komplexität funktionieren.
es: Las versiones de coordinator compatibles son 0.2. Es posible que otras versiones funcionen en función de su complejidad.
fr: Les versions du coordinator prises en charge sont les versions 0.2. Les autres versions peuvent fonctionner selon leur complexité.
ja: サポートされている Coordinator のバージョンは 0.2 です。それ以外のバージョンは、その複雑さに応じて動作することがあります。
ko: 지원되는 Coordinator 버전은 0.2입니다. 다른 버전은 복잡도에 따라 운영될 수 있습니다.
zh_cn: 受支持的 Coordinator 版本是 0.2。其他版本是否受支持视其复杂性而定。

source: Import
de: Importieren
es: Importar
fr: Importer
ja: インポート
ko: 가져오기
zh_cn: 导入

source: Import Workflow
de: Workflow importieren
es: Importar workflow
fr: Importer un workflow
ja: Workflow をインポート
ko: Workflow 가져오기
zh_cn: 导入 Workflow

source: You can import an external Oozie workflow by providing the workflow definition file.
de: Sie können einen externen Oozie-Workflow importieren, indem Sie die Workflow-Definitionsdatei angeben.
es: Puede importar un workflow de Oozie externo proporcionando el archivo de definición del workflow.
fr: Vous pouvez importer un workflow Oozie externe en fournissant le fichier de définition du workflow.
ja: Workflow 定義ファイルを提供することで、外部 Oozie Workflow をインポートできます。
ko: Workflow 정의 파일을 제공하여 외부 Oozie Workflow를 가져올 수 있습니다.
zh_cn: 您可通过提供 Workflow 定义文件，导入外部 Oozie Workflow。

source: Supported workflow versions are 0.4. Other versions might work depending on their complexity.
de: Unterstützte Workflow-Versionen sind 0.4. Andere Versionen können je nach Komplexität funktionieren.
es: Las versiones de workflow compatibles son 0.4. Es posible que otras versiones funcionen según su complejidad.
fr: Les versions du workflow prises en charge sont les versions 0.4. Les autres versions peuvent fonctionner selon leur complexité.
ja: サポートされている Workflow のバージョンは 0.4 です。それ以外のバージョンは、その複雑さに応じて動作することがあります。
ko: 지원되는 Workflow 버전은 0.4입니다. 다른 버전은 복잡도에 따라 운영될 수 있습니다.
zh_cn: 受支持的 Workflow 版本是 0.4。其他版本是否受支持视其复杂性而定。

source: Bundle Manager
de: Bündelmanager
fr: Gestionnaire de bundles
zh_cn: Bundle 管理器

source: Search for name, description, etc...
de: Nach Namen, Beschreibung, usw. suchen
es: Buscar nombre, descripción, etc.
fr: Rechercher un nom, une description, etc…
ja: 名前、説明などを検索...
ko: 이름, 설명 등을 검색합니다.
zh_cn: 搜索名称、描述等...

source: Move to trash
de: In Papierkorb verschieben
es: Mover a papelera
fr: Déplacer vers la corbeille
ja: ゴミ箱に移動
ko: 휴지통으로 이동
zh_cn: 移至垃圾桶

source: Delete forever
de: Dauerhaft löschen
es: Eliminar permanentemente
fr: Supprimer définitivement
ja: 完全に削除
ko: 영구적으로 삭제
zh_cn: 永久删除

source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 생성
zh_cn: 创建

source: View trash
de: Papierkorb anzeigen
es: Ver papelera
fr: Afficher la corbeille
ja: ゴミ箱を表示
ko: 휴지통 보기
zh_cn: 查看垃圾桶

source: Kick off
de: Start
es: Iniciar
fr: Démarrage
ja: キックオフ
ko: 시작
zh_cn: 启动

source: Move the selected bundle(s) to trash?
de: Den/die ausgewählte(n) Bündel in Papierkorb verschieben?
es: ¿Mover los bundles seleccionados a la papelera?
fr: Déplacer le(s) bundle(s) sélectionné(s) vers la corbeille ?
ja: 選択した Bundle をゴミ箱に移動しますか？
ko: 선택한 Bundle을 휴지통으로 이동하겠습니까?
zh_cn: 将所选 bundle 移至垃圾桶？

source: Delete the selected bundle(s)?
de: Ausgewählte(s) Bundle(s) löschen?
es: ¿Eliminar los bundles seleccionados?
fr: Supprimer le ou les bundles sélectionnés ?
ja: 選択した Bundle を削除しますか？
ko: 선택한 bundle을 삭제하시겠습니까?
zh_cn: 删除所选 bundle？

source: Showing _START_ to _END_ of _TOTAL_ entries
de: _START_ bis _END_ von _TOTAL_ Einträge werden angezeigt
es: Mostrando de _START_ a _END_ entradas de _TOTAL_
fr: Affichage des entrées _START_ to _END_ of _TOTAL_
ja: _TOTAL_ 件のエントリの _START_ から _END_ までを表示
ko: _START_ to _END_ of _TOTAL_ 항목 표시
zh_cn: 显示 _START_ - _END_，共 _TOTAL_ 个条目

source: Showing 0 to 0 of 0 entries
de: 0 bis 0 von 0 Einträgen werden angezeigt
es: Mostrando de 0 a 0 entradas de 0
fr: Affichage des entrées 0 à 0 sur 0
ja: 0 件のエントリの 0 から 0 までを表示
ko: 0~0개(전체 0개 중) 항목 표시
zh_cn: 显示 0－0，共 0 个条目

source: (filtered from _MAX_ total entries)
de: (gefiltert von _MAX_ gesamten Einträgen)
es: (filtrado de _MAX_ entradas totales)
fr: (filtrées à partir des entrées totales _MAX_)
ja: （合計 _MAX_ 件のエントリからフィルタ処理）
ko: (총 _MAX_ 항목에서 필터링됨)
zh_cn: （已从 _MAX_ 个总条目中过滤）

source: First
de: Erster
es: Primero
fr: Premier
ja: 先頭
ko: 처음
zh_cn: 第一个

source: Move the selected coordinator(s) to trash?
de: Den/die ausgewählte(n) Coordinator(s) in Papierkorb verschieben?
es: ¿Mover el coordinator seleccionado a la papelera?
fr: Déplacer le(s) coordinator(s) sélectionné(s) vers la corbeille ?
ja: 選択した Coordinator をゴミ箱に移動しますか？
ko: 선택한 Coordinator를 휴지통으로 이동하시겠습니까?
zh_cn: 将所选 coordinator 移至垃圾桶？

source: Delete the selected coordinator(s)?
de: Den/die ausgewählten Coordinator(s) löschen?
es: ¿Eliminar los coordinators seleccionados?
fr: Supprimer le ou les coordinators sélectionnés ?
ja: 選択した Coordinator を削除しますか？
ko: 선택한 Coordinator를 삭제하시겠습니까?
zh_cn: 删除所选 Coordinator？

source: Submission History
de: Übermittlungsverlauf
es: Historial de envíos
fr: Historique d'envoi
ja: サブミット履歴
ko: 제출 기록
zh_cn: 提交历史记录

source: Search for username, name, etc...
de: Nach Benutzernamen, Namen usw. suchen
es: Buscar nombre de usuario, nombre, etc.
fr: Rechercher nom d'utilisateur, nom, etc.
ja: ユーザー名、名前などを検索
ko: 사용자 이름, 이름 등을 검색합니다.
zh_cn: 搜索用户名、名称等...

source: Submission Date
de: Sendedatum
es: Datos de envío
fr: Date d'envoi
ja: サブミッション日
ko: 제출 날짜
zh_cn: 提交日期

source: Submission Id
de: Sendungs-ID
es: ID de envío
fr: Id d'envoi
ja: サブミッション ID
ko: 제출 ID
zh_cn: 提交 ID

source: History Record
de: Verlaufsaufzeichnung
es: Registro de historial
fr: Enregistrement de l'historique
ja: 履歴レコード
ko: 기록 레코드
zh_cn: 历史记录

source: Trashed Bundles
de: Bündel im Papierkorb
es: Bundles eliminados
fr: Bundles placés dans la corbeille
ja: ゴミ箱に移動済みの Bundle
ko: 휴지통으로 보낸 Bundle
zh_cn: 已移至垃圾桶的 Bundle

source: Bundle Trash
de: Bündel-Papierkorb
es: Papelera de bundle
fr: Corbeille du bundle
ja: Bundle ゴミ箱
ko: Bundle 휴지통
zh_cn: Bundle 垃圾桶

source: Retore the selected bundles
de: Ausgewählte Bundles wiederherstellen?
es: Restaurar los bundles seleccionados
fr: Restaurer les bundles sélectionnés
ja: 選択した Bundle を復元
ko: 선택한 Bundle 복구
zh_cn: 恢复所选 Bundle

source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
ja: 復元
ko: 복구
zh_cn: 还原

source: Delete the selected bundles
de: Ausgewählte Bundles löschen
es: Eliminar los bundles seleccionados
fr: Supprimer les bundles sélectionnés
ja: 選択した Bundle を削除
ko: 선택한 Bundle 삭제
zh_cn: 删除所选 bundle

source: Delete all the bundles
de: Alle Bundles löschen
es: Eliminar todos los bundles
fr: Supprimer tous les bundles
ja: すべての Bundle を削除
ko: 모든 Bundle 삭제
zh_cn: 删除所有 bundle

source: Empty trash
de: Papierkorb leeren
es: Vaciar papelera
fr: Vider la corbeille
ja: ゴミ箱を空にする
ko: 휴지통 비우기
zh_cn: 清空垃圾桶

source: Got to bundle manager
de: Zum Bündelmanager gehen
es: Acceder al administrador del bundle
fr: Accéder au gestionnaire de bundles
ja: Bundle Manager に移動
ko: Bundle Manager로 이동함
zh_cn: 查看 bundle 管理器

source: Delete all bundle(s)?
de: Alle Bundles löschen?
es: ¿Eliminar todos los bundles?
fr: Supprimer tous les bundles ?
ja: すべての Bundle を削除しますか？
ko: 모든 Bundle을 삭제하시겠습니까?
zh_cn: 删除所有 bundle？

source: Restore the selected bundle(s)?
de: Ausgewählte(s) Bundle(s) wiederherstellen?
es: ¿Restaurar los bundles seleccionados?
fr: Restaurer le ou les bundles sélectionnés ?
ja: 選択した Bundle を復元しますか？
ko: 선택한 Bundle을 복구하시겠습니까?
zh_cn: 恢复所选 Bundle？

source: Trashed Coordinators
de: Coordinators im Papierkorb
es: Coordinators eliminados
fr: Coordinators placés dans la corbeille
ja: ゴミ箱に移動済みの Coordinator
ko: 휴지통으로 보낸 Coordinator
zh_cn: 已移至垃圾桶的 Coordinator

source: Coordinator Trash
de: Coordinator-Papierkorb
es: Papelera de coordinator
fr: Corbeille du coordinator
ja: Coordinator ゴミ箱
ko: Coordinator 휴지통
zh_cn: Coordinator 垃圾桶

source: Restore the selected coordinators
de: Ausgewählte Coordinators wiederherstellen
es: Restaurar los coordinators seleccionados
fr: Restaurer les coordinators sélectionnés
ja: 選択した Coordinator を復元
ko: 선택한 Coordinator 복구
zh_cn: 恢复所选 Coordinator

source: Delete the selected coordinators
de: Den/die ausgewählten Coordinator(s) löschen?
es: Eliminar los coordinators seleccionados
fr: Supprimer les coordinators sélectionnés
ja: 選択した Coordinator を削除
ko: 선택한 Coordinator 삭제
zh_cn: 删除所选 Coordinator

source: Got to coordinator manager
de: Zum Coordinator-Manager gehen
es: Acceder al administrador del coordinator
fr: Accéder au gestionnaire de coordinators
ja: Coordinator Manager に移動
ko: Coordinator Manager로 이동
zh_cn: 查看 Coordinator Manager

source: Delete all coordinator(s)?
de: Alle Coordinator(s) löschen?
es: ¿Eliminar todos los coordinators?
fr: Supprimer tous les coordinators ?
ja: すべての Coordinator を削除しますか？
ko: 모든 Coordinator를 삭제하시겠습니까?
zh_cn: 删除所有 coordinator？

source: Restore the selected coordinator(s)?
de: Ausgewählte Coordinator(s) wiederherstellen?
es: ¿Restaurar los coordinators seleccionados?
fr: Restaurer le ou les coordinators sélectionnés ?
ja: 選択した Coordinator を復元しますか？
ko: 선택한 Coordinator를 복구하시겠습니까?
zh_cn: 恢复所选 Coordinator？

source: Trashed Workflows
de: Workflows im Papierkorb
es: Workflows eliminados
fr: Workflows placés dans la corbeille
ja: ゴミ箱に移動済みの Workflow
ko: 휴지통으로 보낸 Workflow
zh_cn: 已移至垃圾桶的 Workflow

source: Workflow Trash
de: Workflow-Papierkorb
es: Papelera del workflow
fr: Corbeille des workflows
ja: Workflow ゴミ箱
ko: Workflow 휴지통
zh_cn: Workflow 垃圾桶

source: Restore the selected workflows
de: Ausgewählte Workflows wiederherstellen
es: Restaurar los workflows seleccionados
fr: Restaurer les workflows sélectionnés
ja: 選択した Workflow を復元
ko: 선택한 Workflow 복구
zh_cn: 恢复所选 Workflow

source: Delete the selected workflows
de: Ausgewählte Workflows löschen
es: Eliminar los workflows seleccionados
fr: Supprimer les workflows sélectionnés
ja: 選択した Workflow を削除
ko: 선택한 Workflow 삭제
zh_cn: 删除所选 Workflow

source: Delete all the workflows
de: Alle Workflows löschen
es: Eliminar todos los workflows
fr: Supprimer tous les workflows
ja: すべての Workflow を削除
ko: 모든 Workflow 삭제
zh_cn: 删除所有 Workflow

source: Go to workflow manager
de: Zum Workflow-Manager
es: Ir al administrador de workflow
fr: Accéder au gestionnaire de workflows
ja: Workflow Manager に移動
ko: Workflow Manager로 이동
zh_cn: 转到 Workflow Manager

source: Steps
de: Schritte
es: Pasos
fr: Etapes
ja: ステップ
ko: 단계
zh_cn: 步骤

source: Delete the selected workflow(s)?
de: Ausgewählte Workflows löschen?
es: ¿Eliminar los workflows seleccionados?
fr: Supprimer les workflows sélectionnés ?
ja: 選択した Workflow を削除しますか？
ko: 선택한 Workflow를 삭제하시겠습니까?
zh_cn: 删除所选 Workflow？

source: Delete all trashed workflow(s)?
de: Alle Workflow(s) im Papierkorb löschen?
es: ¿Eliminar todos los workflows de la papelera?
fr: Supprimer tous les workflows placés dans la corbeille ?
ja: ゴミ箱に移動したすべての Workflow を削除しますか？
ko: 휴지통으로 보낸 Workflow를 삭제하시겠습니까?
zh_cn: 删除垃圾桶中的所有 Workflow？

source: Restore the selected workflow(s)?
de: Ausgewählte Workflows wiederherstellen?
es: ¿Restaurar los workflows seleccionados?
fr: Restaurer le ou les workflows sélectionnés ?
ja: 選択した Workflow を復元しますか？
ko: 선택한 Workflow를 복구하시겠습니까?
zh_cn: 恢复所选 Workflow？

source: Trash
de: Papierkorb
es: Papelera
fr: Corbeille
ja: ゴミ箱
ko: 휴지통
zh_cn: 垃圾桶

source: Move the selected workflow(s) to trash?
de: Ausgewählte Workflows in Papierkorb verschieben?
es: ¿Mover los workflows seleccionados a la papelera?
fr: Déplacer le ou les workflows sélectionnés vers la Corbeille ?
ja: 選択した Workflow をゴミ箱に移動しますか？
ko: 선택한 Workflow를 휴지통으로 이동하겠습니까?
zh_cn: 将所选 Workflow 移至垃圾桶？

source: Submit this job?
de: Diesen Job senden?
es: ¿Enviar este job?
fr: Envoyer ce job ?
ja: このジョブをサブミットしますか？
ko: 이 Job을 제출하시겠습니까?
zh_cn: 提交此作业？

source: Do a dryrun before submitting the job?
de: Vor dem Senden des Jobs Testlauf durchführen?
es: ¿Realizar un simulacro antes de enviar el job?
fr: Faire un essai d'exécution avant d'envoyer le job ?
ja: ジョブのサブミット前にドライランを実行しますか？
ko: Job을 제출하기 전에 모의 테스트를 하시겠습니까?
zh_cn: 是否要在提交作业前试运行？

source: Submission was not successful
de: Übertragungsfehler
es: El envío no se realizó correctamente.
fr: Echec de l'envoi
ko: 제출하지 못했습니다.
zh_cn: 未成功提交

source: View workflow action
de: Workflow-Aktion anzeigen
es: Ver acción de workflow
fr: Afficher l'action de workflow
ja: 新しい Workflow アクション
ko: Workflow 작업 보기
zh_cn: 查看 Workflow 操作

source: Bundle Editor
es: Editor del bundle
fr: Editeur de bundles
ja: Bundle エディター
ko: Bundle 편집기
zh_cn: Bundle 编辑器

source: Saving...
de: Es wird gespeichert...
es: Guardando...
fr: Enregistrement en cours...
ja: 保存中...
ko: 저장하는 중...
zh_cn: 正在保存...

source: New
de: Neu
es: Nuevo
fr: Nouveau
ja: 新規
ko: 새로 만들기
zh_cn: 新建

source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
ja: 設定
ko: 설정
zh_cn: 设置

source: Share
de: Freigeben
es: Compartir
fr: Partager
ja: 共有
ko: 공유
zh_cn: 共享

source: Which schedules to bundle?
de: Welche Planungen sollten zum Bundle hinzugefügt werden?
es: ¿Qué programaciones se deben empaquetar?
fr: Quels planificateurs à grouper ?
ja: どのスケジュールを Bundle しますか？
ko: bundle 일정은 어떻게 됩니까?
zh_cn: 要包含哪些计划？
