Repository: cloudera/hue
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Rerun the same workflow
de: Workflow wiederholen
es: Volver a ejecutar el mismo workflow
fr: Réexécuter le même workflow
ja: 同じ Workflow を再実行
ko: 동일한 Workflow 다시 실행
zh_cn: 重新运行相同的 Workflow

source: Parent
de: Übergeordnetes Element
es: Principal
ja: 親
ko: 상위
zh_cn: 父级

source: Graph
de: Diagramm
es: Gráfico
fr: Graphique
ja: グラフ
ko: 그래프
zh_cn: 图

source: Logs
de: Protokolle
es: Registros
fr: Journaux
ja: ログ
ko: 로그
zh_cn: 日志

source: Transition
de: Übergang
es: Transición
ja: 移行
ko: 전환
zh_cn: 转变

source: Data
de: Daten
es: Datos
fr: Données
ja: データ
ko: 데이터
zh_cn: 数据

source: Group
de: Gruppe
es: Grupo
fr: Groupe
ja: グループ
ko: 그룹
zh_cn: 组

source: Application Path
de: Anwendungspfad
es: Ruta de la aplicación
fr: Chemin d'accès à l'application
ja: アプリケーションパス
ko: 애플리케이션 경로
zh_cn: 应用程序路径

source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
ja: 実行
ko: 실행
zh_cn: 运行

source: Workflow Action
de: Workflow-Aktion
es: Acción de workflow
fr: Action de workflow
ja: Workflow アクション
ko: Workflow 작업
zh_cn: Workflow 操作

source: View the logs
de: Protokolle anzeigen
es: Ver los registros
fr: Afficher les journaux
ja: ログを表示
ko: 로그 보기
zh_cn: 查看日志

source: Action
de: Aktion
es: Acción
ja: アクション
ko: 작업
zh_cn: 操作

source: Child Jobs
de: Untergeordnete Jobs
es: Trabajos secundarios
fr: Jobs enfants
ja: 子ジョブ
ko: 하위 Job
zh_cn: 子作业

source: Property
de: Eigenschaft
es: Propiedad
fr: Propriété
ja: プロパティ
ko: 속성
zh_cn: 属性

source: External Status
de: Externer Status
es: Estado externo
fr: Statut externe
ja: 外部ステータス
ko: 외부 상태
zh_cn: 外部状态

source: No child jobs
de: Keine untergeordneten Jobs
es: Sin trabajos secundarios
fr: Aucun job enfant
ja: 子ジョブがありません
ko: 하위 Job 없음
zh_cn: 没有子作业

source: Ids
ja: ID
ko: Id
zh_cn: ID

source: Workflows Dashboard
de: Workflow-Dashboard
es: Panel de workflows
fr: Tableau de bord des workflows
ja: Workflow ダッシュボード
ko: Workflow 대시보드
zh_cn: Workflow 控制面板

source: submitted
de: gesendet
es: enviado
fr: envoyé
ja: サブミット済み
ko: 제출됨
zh_cn: 已提交

source: Manually
de: Manuell
es: Manualmente
fr: Manuellement
ja: 手動
ko: 수동
zh_cn: 手动

source: Submission
de: Übermittlung
es: Envío
fr: Envoi
ja: サブミッション
ko: 제출
zh_cn: 提交

source: Submitted Manually
de: Manuell gesendet
es: Enviado manualmente
fr: Envoyé manuellement
ja: 手動でサブミットされました
ko: 수동으로 제출됨
zh_cn: 手动提交

source: Select coordinators to rerun
de: Coordinators zum erneuten Ausführen auswählen
es: Seleccionar los coordinators que se van a volver a ejecutar
fr: Sélectionner les coordinators à réexécuter
ja: 再実行する Coordinator を選択
ko: 다시 실행할 Coordinator 선택
zh_cn: 选择要重新运行的 Coordinator

source: Submit
de: Übermitteln
es: Enviar
fr: Envoyer
ja: サブミット
ko: 제출
zh_cn: 提交

source: Select all
de: Alle auswählen
es: Seleccionar todo
fr: Sélectionner tout
ja: すべて選択
ko: 모두 선택
zh_cn: 全选

source: No successful actions found.
de: Keine erfolgreichen Aktionen gefunden.
es: No se han encontrado acciones satisfactorias.
fr: Aucune action réussie trouvée.
ja: 成功したアクションが見つかりません。
ko: 완료된 동작이 없습니다.
zh_cn: 未找到成功操作。

source: Select actions to rerun
de: Zu wiederholende Aktionen auswählen
es: Seleccione las acciones que se deben volver a ejecutar
fr: Sélectionner les actions à réexécuter
ja: 再実行するアクションを選択
ko: 다시 실행할 작업 선택
zh_cn: 选择要重新运行的操作

source: All or skip successful
de: Alle oder erfolgreiche ignorieren
es: Todo u omitir correctamente
fr: Réussite de l'opération Tous ou Ignorer
ja: すべて、または成功したものをスキップ
ko: 모두 또는 건너뛰기 성공
zh_cn: 全部或跳过成功

source: Only failed
de: Nur Fehlgeschlagene
es: Solo con error
fr: Ayant échoué uniquement
ja: 失敗したアクションのみ
ko: 실패한 작업만
zh_cn: 仅失败

source: Done
de: Fertig
es: Finalizado
fr: Terminé
ja: 完了
ko: 완료
zh_cn: 已完成

source: Action type
de: Aktionstyp
es: Tipo de acción
fr: Type d'action
ja: アクションのタイプ
ko: 작업 유형
zh_cn: 操作类型

source: Advanced
de: Erweitert
es: Avanzada
fr: Avancé
ja: 詳細
ko: 고급
zh_cn: 高级

source: Credentials
de: Zugangsdaten
es: Credenciales
fr: Informations de connexion
ja: 資格情報
ko: 자격 증명
zh_cn: 凭据

source: Requires hbase-site.xml in job-xml field
de: Erfordert "hbase-site.xml" im Feld "job-xml"
es: Requiere hbase-site.xml en el campo job-xml
fr: Nécessite hbase-site.xml dans le champ job-xml
ja: job-xml フィールドに hbase-site.xml が必要です
ko: job-xml 필드에 hbase-site.xml 필요
zh_cn: job-xml 字段中需要 hbase-site.xml

source: Error link to
de: Fehler beim Verknüpfen mit
es: Enlace de error a
fr: Erreur de lien vers
ja: エラーリンクの参照先
ko: 오류 링크
zh_cn: 链接到以下项出错

source: All the paths are relative to the deployment directory. They can be absolute but this is not recommended.
de: Alle Pfade beziehen sich auf das Bereitstellungsverzeichnis. Sie können absolut sein, aber dies wird nicht empfohlen.
es: Todas las rutas hacia el directorio de implementación son relativas. Pueden ser absolutas pero no es lo recomendable.
fr: Tous les chemins d'accès sont relatifs par rapport au répertoire de déploiement. Ils peuvent être absolus mais cela n'est pas recommandé.
ja: すべてのパスは、展開ディレクトリへの相対パスです。絶対パスにすることもできますが、お勧めしません。
ko: 모든 경로는 배포 디렉토리를 기준으로 한 상대 경로입니다. 절대 경로를 사용할 수도 있지만 이는 권장하지 않습니다.
zh_cn: 所有路径均与部署目录相对。它们可以是绝对路径，但是不建议如此。

source: All the paths need to be absolute.
de: Alle Pfade müssen absolut sein.
es: Todas las rutas deben ser absolutas.
fr: Tous les chemins d'accès doivent être absolus.
ja: すべてのパスは、絶対パスである必要があります。
ko: 모든 경로는 절대 경로여야 합니다.
zh_cn: 所有路径都要是绝对路径。

source: You can parameterize values using case sensitive
de: Sie können Werte nach Groß-/Kleinschreibung unterschieden parametrisieren.
es: Puede parametrizar los valores mediante mayúsculas y minúsculas
fr: Vous pouvez paramétrer des valeurs en utilisant des éléments sensibles à la casse
ja: 大文字と小文字を識別する機能により、値をパラメーター化できます
ko: 대소문자를 구분하여 값을 매개변수화할 수 있음
zh_cn: 您可使用区分大小写功能对值进行参数化

source: The SSH server requires passwordless login
de: Für den SSH-Server ist eine Anmeldung ohne Kennwort erforderlich.
es: El servidor SSH necesita un inicio de sesión sin contraseña
fr: Le serveur SSH requiert une connexion sans mot de passe
ja: SSH サーバーが、パスワードを使用しないログインを要求しています。
ko: SSH 서버에는 암호 없이 로그인해야 함
zh_cn: SSH 服务器需要无密码登录

source: The delegation token needs to be propagated from the launcher job to the MR job
de: Das Delegations-Token muss von dem Launcher-Job zum MR-Job weitergeleitet werden.
es: El token de delegación debe propagarse del selector de trabajos al trabajo de MR
fr: Le jeton de délégation doit être propagé depuis le job du programme de lancement vers le job MR
ja: 委任トークンをランチャジョブから MR ジョブに伝達する必要があります
ko: 위임 토큰은 시작 Job에서 MR Job으로 전파해야 함
zh_cn: 委派令牌需要从启动器作业传播到 MR 作业

source: Requires some SMTP server configuration to be present (in oozie-site.xml)
de: Eine SMTP-Serverkonfiguration muss vorhanden sein (in oozie-site.xml)
es: Es necesario que haya alguna configuración del servidor SMTP (en oozie-site.xml).
fr: Nécessite la présence d'une configuration de serveur SMTP (dans le fichier oozie-site.xml)
ja: （oozie-site.xml に）何らかの SMTP サーバー設定が必要です
ko: SMTP 서버 구성이 존재해야 함(oozie-site.xml 형식)
zh_cn: 需要呈现某些 SMTP 服务器配置（格式为 oozie-site.xml）

source: Add delete
de: Löschen hinzufügen
es: Agregar eliminar
fr: Ajouter une suppression
ja: delete の追加
ko: 삭제 추가
zh_cn: 添加删除

source: Add mkdir
de: mkdir hinzufügen
es: Agregar mkdir
fr: Ajouter une commande mkdir
ja: mkdir の追加
ko: mkdir 추가
zh_cn: 添加 mkdir

source: Add param
de: Parameter hinzufügen
es: Agregar parámetro
fr: Ajouter un paramètre
ja: param を追加
ko: 매개변수 추가
zh_cn: 添加参数

source: Add argument
de: Argument hinzufügen
es: Agregar argumento
fr: Ajouter un argument
ja: 引数を追加
ko: 인수 추가
zh_cn: 添加自变量

source: Add env-var
de: Umgebungsvariable hinzufügen
es: Agregar variable de entorno
fr: Ajouter une variable d'envir.
ja: env-var を追加
ko: env-var 추가
zh_cn: 添加 env-var

source: Add arg
de: Argument hinzufügen
es: Agregar argumento
fr: Ajouter un argument
ja: arg を追加
ko: 인수 추가
zh_cn: 添加自变量

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
zh_cn: 删除

source: Add path
de: Pfad hinzufügen
es: Agregar ruta
fr: Ajouter un chemin d'accès
ja: パスを追加
ko: 경로 추가
zh_cn: 添加路径

source: Add archive
de: Archiv hinzufügen
es: Agregar almacenamiento
fr: Ajouter une archive
ja: アーカイブを追加
ko: 아카이브 추가
zh_cn: 添加存档

source: Job properties
de: Jobeigenschaften
es: Propiedades del job
fr: Propriétés du job
ja: ジョブのプロパティ
ko: Job 속성
zh_cn: 作业属性

source: Property name
de: Name der Eigenschaft
es: Nombre de propiedad
fr: Nom de la propriété
ja: プロパティ名
ko: 속성 이름
zh_cn: 属性名称

source: Add property
de: Eigenschaft hinzufügen
es: Agregar propiedad
fr: Ajouter une propriété
ja: プロパティを追加
ko: 속성 추가
zh_cn: 添加属性

source: Source
de: Quelle
es: Origen
ja: ソース
ko: 소스
zh_cn: 源

source: Destination
de: Ziel
es: Destino
ja: 宛先
ko: 대상
zh_cn: 目标

source: Add move
de: move hinzufügen
es: Agregar move
fr: Ajouter une commande move
ja: 移動を追加
ko: 이동 추가
zh_cn: 添加 move

source: Path
de: Pfad
es: Ruta
fr: Chemin d'accès
ja: パス
ko: 경로
zh_cn: 路径

source: Permissions
de: Berechtigungen
es: Permisos
fr: Autorisations
ja: パーミッション
ko: 권한
zh_cn: 权限

source: Recursive
de: Rekursiv
es: Recursivo
fr: Récursif
ja: 再帰的
ko: 재귀
zh_cn: 递归

source: Add chmod
de: chmod hinzufügen
es: Agregar chmod
fr: Ajouter une commande chmod
ja: chmod を追加
ko: chmod 추가
zh_cn: 添加 chmod

source: Params
de: Parameter
es: Parámetros
fr: Paramètres
ja: パラメータ
ko: 매개변수
zh_cn: 参数

source: label
de: Kennzeichnung
es: etiqueta
fr: étiquette
ja: ラベル
ko: 레이블
zh_cn: 标签

source: Prepare
de: Vorbereiten
es: Preparar
fr: Préparer
ja: 準備
ko: 준비
zh_cn: 准备

source: Convert this fork into a decision?
de: Diese Fork in eine Entscheidung umwandeln?
es: ¿Convertir esta bifurcación en una decisión?
fr: Convertir cet embranchement en décision ?
ja: このフォークを決定に変換しますか?
ko: 이 Fork를 결정 사항으로 변환하시겠습니까?
zh_cn: 将此分叉转换为判定？

source: Examples of predicates:
de: Beispiele für Prädikate:
es: Ejemplos de predicados:
fr: Exemples de prédicats :
ja: 述語の例：
ko: 조건자의 예:
zh_cn: 属性词示例：

source: More on predicates
de: Infos zu Prädikaten
es: Más en predicados
fr: Plus d'informations sur les prédicats
ja: 述語の詳細
ko: 조건자에 대한 자세한 설명
zh_cn: 更多属性词信息

source: Predicate
de: Prädikat
es: Predicado
fr: Prédicat
ja: 述語
ko: 조건자
zh_cn: 属性词

source: go to
de: Gehe zu
es: ir a
fr: aller à
ja: 移動先
ko: 다음으로 이동
zh_cn: 转至

source: default
de: Standard
es: predeterminado
fr: par défaut
ja: デフォルト値
ko: 기본값
zh_cn: 默认

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
ja: 追加
ko: 추가
zh_cn: 添加

source: When
de: Wann
es: Cuando
fr: Quand
ja: 時期
ko: 시간
zh_cn: 何时

source: Check syntax ?
de: Syntax prüfen?
es: ¿Comprobar sintaxis?
fr: Vérifier la syntaxe ?
ja: 構文をチェックしますか？
ko: 구문을 확인하시겠습니까?
zh_cn: 检查语法？

source: advanced
de: Erweitert
es: avanzada
fr: avancé
ja: 詳細
ko: 고급
zh_cn: 高级

source: The time frequency at which interval a workflow should be submitted by the coordinator. For example, once a day, every Monday at midnight, every week days, every three days...
de: Die Häufigkeit (Intervall), mit der ein Workflow durch den Coordinator weitergeleitet werden soll, beispielsweise einmal am Tag, jeden Montag zu Mitternacht, jeden Wochentag, alle drei Tage...
es: La frecuencia de intervalo de tiempo a la que el coordinator debe enviar un workflow. Por ejemplo, una vez al día, todos los lunes a medianoche, todos los días de la semana, cada tres días...
fr: Fréquence à laquelle un workflow doit être envoyé par le coordinator. Exemple : une fois par jour, tous les lundis à minuit, tous les jours en semaine, tous les trois jours…
ja: Coordinator によって Workflow がサブミットされる時間頻度の間隔です。たとえば、1 日 1 回、毎週月曜深夜、平日毎日、3 日ごとなどです...
ko: Coordinator가 Workflow를 제출해야 하는 빈도입니다(예: 하루에 한 번, 월요일 자정마다, 주중 매일, 3일 간격 등).
zh_cn: Coordinator 应提交 Workflow 的间隔时间频率。例如，每天一次、每个星期一的午夜、每个工作日、每三天...

source: Create Bundle
de: Bündel erstellen
es: Crear bundle
fr: Créer un bundle
ja: Bundle を作成
ko: Bundle 생성
zh_cn: 创建 Bundle

source: Properties
de: Eigenschaften
es: Propiedades
fr: Propriétés
ja: プロパティ
ko: 속성
zh_cn: 属性

source: Edit properties
de: Eigenschaften bearbeiten
es: Editar propiedades
fr: Modifier les propriétés
ja: プロパティを編集
ko: 속성 편집
zh_cn: 编辑属性

source: Bundle data
de: Daten bündeln
es: Datos del bundle
fr: Données de bundle
ja: Bundle データ
ko: Bundle 데이터
zh_cn: Bundle 数据

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_cn: 保存

source: Add coordinator to the Bundle
de: Coordinator dem Bundle hinzufügen
es: Añadir coordinator al bundle
fr: Ajouter un coordinator au bundle
ja: Bundle に Coordinator を追加
ko: Bundle에 Coordinator 추가
zh_cn: 将 Coordinator 添加到 Bundle

source: Create Coordinator
de: Coordinator erstellen
es: Crear coordinator
fr: Créer un coordinator
ja: Coordinator を作成
ko: Coordinator 생성
zh_cn: 创建 Coordinator

source: Coordinator Editor
es: Editor de Coordinator
fr: Editeur de coordinator
ko: Coordinator 편집기
zh_cn: Coordinator 编辑器

source: Step 1: Details
de: Schritt 1: Details
es: Paso 1: detalles
fr: Etape 1 : Détails
ja: 手順 1：詳細
ko: 1단계: 세부 정보
zh_cn: 第 1 步：详情

source: Step 2: Frequency
de: Schritt 3: Frequenz
es: Paso 2: frecuencia
fr: Etape 2 : Fréquence
ja: 手順 2：頻度
ko: 2단계: 빈도
zh_cn: 第 2 步：频率

source: Step 3: Inputs
de: Schritt 4: Eingaben
es: Paso 3: entradas
fr: Etape 3 : Entrées
ja: 手順 3：入力
ko: 3단계: 입력
zh_cn: 第 3 步：输入

source: Step 4: Outputs
de: Schritt 1: Ausgaben
es: Paso 4: salidas
fr: Etape 4 : Sorties
ja: 手順 4：出力
ko: 4단계: 출력
zh_cn: 第 4 步：输出

source: Step 5: Advanced settings
de: Schritt 5: Erweiterte Einstellungen
es: Paso 5: configuración avanzada
fr: Etape 5 : Paramètres avancés
ja: 手順 5：詳細設定
ko: 5단계: 고급 설정
zh_cn: 第 5 步：高级设置

source: Schedule
de: Planung
es: Programa
fr: Planifier
ja: スケジュール
ko: 예약
zh_cn: 计划

source: UTC time only. (e.g. if you want 10pm PST (UTC+8) set it 8 hours later to 6am the next day.
de: Nur UTC-Zeit. (z. B. wenn Sie 22.00 Uhr PST (UTC+8) um acht Stunden auf 6:00 am nächsten Tag verstellen möchten.
es: Solo hora UTC, (p. ej., si desea establecer las 22:00 en la hora estándar del Pacífico (UTC +8), configúrelo 8 horas después de las 6:00 del día siguiente.
fr: Heure UTC uniquement. Par exemple, si vous voulez indiquer 22:00 heure d'hiver du Pacifique (UTC+8), ajouter 8 heures après 6:00, le jour suivant.
ja: UTC 時間のみ。例えば、PST（UTC+8）の午後 10 時に設定する場合は、8 時間後、つまり、次の日の午前 6 時に 設定します。
ko: UTC 시간만 해당됩니다. 예를 들어 PST(UTC+8) 오후 10시인 경우 8시간을 더하여 다음 날 오전 6시로 설정합니다.
zh_cn: 仅限 UTC 时间。（例如，如果您需要 10pm PST (UTC+8)，则将其设置为比次日 6 am 晚 8 个小时。

source: This field is required.
de: Dieses Feld ist erforderlich.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.
ja: このフィールドは必須です。
ko: 이 필드는 필수 항목입니다.
zh_cn: 此字段为必填字段。

source: Dataset
es: Conjunto de datos
zh_cn: 数据集

source: You can parameterize the values using
de: Sie können die Werte parametrisieren mithilfe von
es: Puede parametrizar los valores, mediante
fr: Vous pouvez paramétrer les valeurs en utilisant
ja: 次を使用してこれらの値をパラメーター化できます
ko: 다음을 사용하여 값을 매개변수화할 수 있음
zh_cn: 您可以参数化该值，使用

source: Create Workflow
de: Workflow erstellen
es: Crear workflow
fr: Créer un workflow
ja: Workflow を作成
ko: Workflow 생성
zh_cn: 创建 Workflow

source: New workflow
de: Neuer Workflow
es: Nuevo workflow
fr: Nouveau workflow
ja: 新しい Workflow
ko: 새 workflow
zh_cn: 新建 Workflow

source: Instance
de: Instanz
es: Instancia
ja: インスタンス
ko: 인스턴스
zh_cn: 实例

source: Default
de: Standard
es: Predeterminado
fr: Par défaut
ja: デフォルト値
ko: 기본값
zh_cn: 默认

source: Single
de: Einzeln
es: Único
fr: Unique
ja: 単一
ko: 단일
zh_cn: 单个

source: Range
de: Bereich
es: Intervalo
fr: Plage
ja: 範囲
ko: 범위
zh_cn: 范围

source: (advanced)
de: (erweitert)
es: (avanzadas)
fr: (avancé)
ja: （詳細）
ko: (고급)
zh_cn: （高级）

source: Edit Bundle
de: Bundle bearbeiten
es: Editar bundle
fr: Modifier le bundle
ja: Bundle を編集
ko: Bundle 편집
zh_cn: 编辑 bundle

source: Show selected
de: Ausgewählte anzeigen
es: Mostrar seleccionados
fr: Afficher la sélection
ja: 選択された対象を表示
ko: 선택 항목 표시
zh_cn: 显示所选项

source: History
de: Verlauf
es: Historial
fr: Historique
ja: 履歴
ko: 기록
zh_cn: 历史记录

source: Show history
de: Verlauf anzeigen
es: Mostrar historial
fr: Afficher l'historique
ja: 履歴を表示
ko: 기록 표시
zh_cn: 显示历史记录

source: Submit this bundle
de: Dieses Bundle senden
es: Enviar este bundle
fr: Envoyer ce bundle
ja: この Bundle をサブミット
ko: 이 Bundle 제출
zh_cn: 提交此 bundle

source: Copy this bundle
de: Dieses Bundle kopieren
es: Copiar este bundle
fr: Copier ce bundle
ja: この Bundle をコピー
ko: 이 Bundle 복사
zh_cn: 复制此 bundle

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
ko: 복사
zh_cn: 复制

source: Bundle Editor :
es: Editor del bundle:
fr: Editeur de bundles :
ja: Bundle エディタ：
ko: Bundle 편집기 :
zh_cn: Bundle 编辑器：

source: Step 1: General
de: Schritt 1: Allgemein
es: Paso 1: general
fr: Etape 1 : Général
ja: 手順 1：概要
ko: 1단계: 일반
zh_cn: 第 1 步：综述

source: Step 2: Advanced settings
de: Schritt 2: Erweiterte Einstellungen
es: Paso 2: configuración avanzada
fr: Etape 2 : Paramètres avancés
ja: 手順 2：詳細設定
ko: 2단계: 고급 설정
zh_cn: 第 2 步：高级设置

source: Advanced settings
de: Erweiterte Einstellungen
es: Configuración avanzada
fr: Paramètres avancés
ja: 詳細設定
ko: 고급 설정
zh_cn: 高级设置

source: Save bundle
de: Bundle speichern
es: Guardar bundle
fr: Enregistrer le bundle
ja: Bundle を保存
ko: Bundle 저장
zh_cn: 保存 bundle

source: Click to view the coordinator
de: Klicken Sie zum Anzeigen des Coordinator
es: Haga clic para ver el coordinator
fr: Cliquez pour afficher le coordinator
ja: クリックすると、Coordinator が表示されます
ko: Coordinator를 보려면 클릭
zh_cn: 单击以查看 Coordinator

source: There are currently no coordinator in this bundle.
de: Dieses Bündel enthält derzeit keinen Coordinator.
es: Actualmente no hay ningún coordinator en este bundle.
fr: Ce bundle ne contient actuellement aucun coordinator.
ja: この Bundle には現在、Coordinator がありません。
ko: 현재 이 Bundle에 Coordinator가 없습니다.
zh_cn: 此 bundle 中当前没有 coordinator。

source: Do you want to add a coordinator ?
de: Möchten Sie einen Coordinator hinzufügen?
es: ¿Desea añadir un coordinator?
fr: Voulez-vous ajouter un coordinator ?
ja: Coordinator を追加してもよろしいですか？
ko: Coordinator를 추가하시겠습니까?
zh_cn: 是否想要添加 Coordinator？

source: Date
de: Datum
es: Fecha
ja: 日付
ko: 날짜
zh_cn: 日期

source: N/A
de: k. A.
es: N/D
ko: 해당 없음
zh_cn: 无

source: Edit bundled coordinator
de: Gebündelten Coordinator bearbeiten
es: Editar coordinator integrado
fr: Modifier le coordinator placé dans le bundle
ja: バンドルされている Coordinator を編集
ko: Bundle로 생성된 Coordinator 편집
zh_cn: 编辑已批处理的 coordinator

source: Edit Coordinator
de: Coordinator bearbeiten
es: Editar coordinator
fr: Modifier le coordinator
ja: Coordinator を編集
ko: Coordinator 편집기
zh_cn: 编辑 Coordinator

source: Create new
de: Neu erstellen
es: Crear nuevo
fr: Créer un nouveau
ja: 新規作成
ko: 새로 생성
zh_cn: 新建

source: Show existing
de: Vorhandene anzeigen
es: Mostrar existentes
fr: Afficher les existants
ja: 既存のものを表示
ko: 기존 항목 표시
zh_cn: 显示现有项

source: Submit this coordinator
de: Diesen Coordinator übermitteln
es: Enviar este coordinator
fr: Envoyer ce coordinator
ja: この Coordinator をサブミット
ko: 이 Coordinator 제출
zh_cn: 提交此 coordinator

source: Copy this coordinator
de: Diesen Coordinator kopieren
es: Copiar este coordinator
fr: Copier ce coordinator
ja: この Coordinator をコピー
ko: 이 Coordinator 복사
zh_cn: 复制此 coordinator

source: Coordinator Editor :
es: Editor de coordinator:
fr: Editeur de coordinator :
ko: Coordinator 편집기:
zh_cn: Coordinator 编辑器：

source: Inputs
de: Eingaben
es: Entradas
fr: Entrées
ja: 入力
ko: 입력
zh_cn: 输入

source: The inputs and outputs of the workflow must be mapped to some data.
de: Die Eingaben und Ausgaben des Workflows müssen Daten zugeordnet werden.
es: Las entradas y salidas del workflow deben ser mapped a determinados datos.
fr: Les entrées et les sorties du workflow doivent être mappées à certaines données.
ja: Workflow の入出力をいくつかのデータにマッピングする必要があります。
ko: Workflow의 입력 및 출력은 데이터에 매핑되어야 합니다.
zh_cn: Workflow 的输入和输出必须映射到某些数据。

source: The data is represented by some datasets that can be created
de: Die Daten werden von einigen Datasets dargestellt, die erstellt werden können.
es: Los datos se representan mediante algunos conjuntos de datos que pueden crearse
fr: Les données sont représentées par des datasets que vous pouvez créer
ja: データは、作成できる Dataset によって表現されます
ko: 데이터는 생성 가능한 Dataset로 표시됨
zh_cn: 可创建由某些数据集表示的数据

source: here
de: hier
es: aquí
fr: ici
ja: ここ
ko: 여기
zh_cn: 此处

source: This type of coordinator does not require any dataset.
de: Für diese Art von Coordinator ist kein Datensatz notwendig.
es: Este tipo de coordinator no necesita ningún dataset.
fr: Le type de coordinator ne nécessite aucun dataset.
ja: このタイプの Coordinator は、データセットを必要としません。
ko: 이 유형의 Coordinator에는 Dataset가 필요하지 않습니다.
zh_cn: 此类 coordinator 不需要任何 dataset。

source: There are currently no defined inputs.
de: Derzeit sind keine definierten Eingaben vorhanden.
es: Actualmente no hay ninguna entrada definida.
fr: Il n'existe actuellement aucune entrée définie.
ja: 現在、定義されている入力はありません。
ko: 현재 정의된 입력이 없습니다.
zh_cn: 当前没有已定义的输入。

source: Outputs
de: Ausgaben
es: Resultados
fr: Sorties
ja: 出力
ko: 출력
zh_cn: 输出

source: There are currently no defined outputs.
de: Derzeit sind keine definierten Ausgaben vorhanden.
es: Actualmente no hay ninguna salida definida.
fr: Il n'existe actuellement aucune sortie définie.
ja: 現在、定義されている出力はありません。
ko: 현재 정의된 출력이 없습니다.
zh_cn: 当前没有已定义的输出。

source: Save coordinator
de: Coordinator speichern
es: Guardar coordinator
fr: Enregistrer le coordinator
ja: Coordinator を保存
ko: Coordinator 저장
zh_cn: 保存 Coordinator

source: Create a new dataset
de: Neues Dataset erstellen
es: Crear un nuevo dataset
fr: Créer un dataset
ja: 新しい Dataset を作成
ko: 새 Dataset 생성
zh_cn: 创建新数据集

source: Save your modifications before creating a new dataset.
de: Speichern Sie vor dem Erstellen eines Dataset Ihre Änderungen.
es: Guarde sus modificaciones antes de crear un dataset nuevo.
fr: Enregistrez vos modifications avant de créer un dataset.
ja: 変更を保存してから、新しい Dataset を作成してください。
ko: 새 Dataset를 생성하기 전에 수정 사항을 저장합니다.
zh_cn: 在创建新数据集之前，保存您的修改。

source: Create dataset
de: Dataset erstellen
es: Crear conjunto de datos
fr: Créer un dataset
ja: Dataset を作成
ko: Dataset 생성
zh_cn: 创建数据集

source: Edit dataset
de: Dataset bearbeiten
es: Editar dataset
fr: Modifier un dataset
ja: Dataset を編集
ko: Dataset 편집
zh_cn: 编辑数据集

source: Save your modifications before editing a dataset.
de: Speichern Sie vor dem Bearbeiten eines Dataset Ihre Änderungen.
es: Guarde sus modificaciones antes de editar un dataset.
fr: Enregistrez vos modifications avant de modifier un dataset.
ja: 変更を保存してから、Dataset を編集してください。
ko: Dataset를 편집하기 전에 수정 사항을 저장합니다.
zh_cn: 在编辑数据集之前，保存您的修改。

source: Update dataset
de: Dataset aktualisieren
es: Actualizar conjunto de datos
fr: Mettre à jour un dataset
ja: Dataset を更新
ko: Dataset 업데이트
zh_cn: 更新数据集

source: Existing datasets
de: Bestehende Datasets
es: Conjunto de datos existentes
fr: Datasets existants
ja: 既存の Dataset
ko: 기존 Dataset
zh_cn: 现有数据集

source: Click to view the dataset
de: Zum Anzeigen des Dataset hier klicken
es: Haga clic para ver el dataset
fr: Cliquer pour afficher le dataset
ja: クリックすると、Dataset が表示されます
ko: Dataset를 보려면 클릭
zh_cn: 单击以查看数据集

source: There are currently no datasets.
de: Derzeit sind keine Datasets vorhanden.
es: Actualmente no hay ningún dataset.
fr: Il n'existe actuellement aucun dataset.
ja: 現在、Dataset はありません。
ko: 현재 Dataset가 없습니다.
zh_cn: 当前没有数据集。

source: Do you want to create a new dataset ?
de: Möchten Sie ein neues Dataset erstellen?
es: ¿Desea crear un nuevo conjunto de datos?
fr: Voulez-vous créer un nouveau dataset ?
ja: 新しい Dataset を作成しますか？
ko: 새 Dataset를 생성하시겠습니까?
zh_cn: 是否想要创建新数据集？

source: UTC time only.
de: Nur UTC-Zeit.
es: Solo hora UTC.
fr: Heure UTC uniquement.
ja: UTC 時間のみ。
ko: UTC 시간 전용.
zh_cn: 仅限 UTC 时间。

source: Recommended to be before the coordinator start date.
de: Dies sollte vor dem Coordinator-Startdatum sein.
es: Se recomienda que tenga lugar antes de la fecha de inicio del coordinator.
fr: Il est recommandé que cette date soit antérieure à la date de début du coordinator.
ja: Coordinator の開始日よりも前にすることをお勧めします。
ko: Coordinator 시작 날짜 전이 좋습니다.
zh_cn: 建议早于 Coordinator 开始日期。
