Repository: cloudera/hue
Catalog: apps/useradmin/src/useradmin/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, pt

source: The old password does not match the current password.
pt: A palavra-passe antiga não corresponde à palavra-passe actual.

source: Step 2: Names and Groups
pt: Passo 2: nomes e grupos

source: Step 2: Names
pt: Passo 2: nomes
