Repository: cloudera/hue
Catalog: apps/useradmin/src/useradmin/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, pt

source: You must be a superuser to add another group.
de: Sie müssen ein Superuser sein, um eine Gruppe hinzufügen zu können.
es: Debe ser un superusuario para agregar otro grupo.
fr: Vous devez être un superutilisateur pour pouvoir ajouter un autre groupe.
ja: 別のグループを追加するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para adicionar outro grupo.

source: LDAP Exception: %s
de: LDAP-Ausnahme: %s
es: Excepción LDAP: %s
fr: Exception LDAP : %s
ja: LDAP 例外：%s
pt: Excepção LDAP: %s

source: Exception creating home directory for LDAP user %s in group %s.
de: Ausnahmefehler beim Erstellen des Home-Verzeichnisses für LDAP-Benutzer %s in Gruppe %s.
es: Se ha producido una excepción al crear el directorio de inicio del usuario LDAP %s en el grupo %s.
fr: Exception lors de la création du répertoire d'accueil de l'utilisateur LDAP %s dans le groupe %s.
ja: グループ %s で LDAP ユーザー %s のホームディレクトリを作成しているときに、例外が発生しました。

source: Could not get LDAP details for groups in pattern %s
de: LDAP-Details für Gruppen in Muster %s konnten nicht abgerufen werden
es: No se pueden obtener los detalles de LDAP de los grupos en el patrón %s
fr: Impossible d'obtenir les détails LDAP pour les groupes dans le modèle %s
ja: パターン %s のグループの LDAP 詳細を取得できませんでした
pt: Não foi possível obter detalhes de LDAP para grupos no padrão %s

source: You must be a superuser to sync the LDAP users/groups.
de: Sie müssen ein Superuser sein, um die LDAP-Benutzer/-Gruppen synchronisieren zu können.
es: Para sincronizar los usuarios/grupos LDAP, debe ser un superusuario.
fr: Vous devez être un superutilisateur pour pouvoir synchroniser les utilisateurs/groupes LDAP.
ja: LDAP ユーザー／グループの同期化ではスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para sincronizar os utilizadores/grupos de LDAP.

source: The import may not be complete, sync again.
de: Der Import ist möglicherweise nicht vollständig. Wiederholen Sie die Synchronisierung.
es: No se puede completar la importación. Vuelva a sincronizar.
fr: L'importation est peut-être incomplète. Synchronisez à nouveau.
ja: インポートが完全ではない可能性があります。同期を再度実行してください。
pt: A importação pode não estar completa. Sincronize novamente.

source: Synced user %s from Unix
de: Benutzer %s von Unix synchronisiert
es: Usuario %s sincronizado desde Unix
fr: Utilisateur %s synchronisé depuis Unix
ja: UNIX からユーザー %s を同期しました
pt: Utilizador %s sincronizado do Unix

source: No active superuser configured.
de: Es wurde kein aktiver Superuser konfiguriert.
es: Ningún superusuario activo configurado.
fr: Aucun super-utilisateur actif configuré.
ja: アクティブなスーパーユーザーが未設定です。
pt: Nenhum superutilizador activo configurado.

source: You cannot remove the last active superuser from the configuration.
de: Der letzte aktive Superuser kann nicht aus der Konfiguration entfernt werden.
es: No puede quitar el último superusuario activo de la configuración.
fr: Vous ne pouvez pas supprimer le dernier superutilisateur actif de la configuration.
ja: 最後のアクティブなスーパーユーザーを設定から削除することはできません。
pt: Não pode remover o último superutilizador activo da configuração.

source: There was a naming conflict while importing user %(username)s
de: Beim Importieren von Benutzer %(username)s ist ein Namenskonflikt aufgetreten.
es: Se ha producido un conflicto de nombre al importar el usuario %(username)s
fr: Un conflit de dénomination est survenu lors de l'importation de l'utilisateur %(username)s
ja: ユーザー %(username)s のインポート中に名前の競合が発生しました
pt: Ocorreu um conflito de nomes ao importar o utilizador %(username)s

source: There was a naming conflict while importing group %(groupname)s in pattern %(groupname_pattern)s
de: Beim Importieren der Gruppe %(groupname)s in das Muster %(groupname_pattern)s ist ein Namenskonflikt aufgetreten.
es: Se ha producido un conflicto de nombre al importar el grupo %(groupname)s en el patrón %(groupname_pattern)s
fr: Un conflit de dénomination est survenu lors de l'importation du groupe %(groupname)s dans le modèle %(groupname_pattern)s
ja: パターン %(groupname_pattern)s のグループ %(groupname)s のインポート中に名前の競合が発生しました
pt: Ocorreu um conflito de nomes ao importar o grupo %(groupname)s no padrão %(groupname_pattern)s

source: Import users from the group.
de: Benutzer aus der Gruppe importieren.
es: Importar usuarios del grupo.
fr: Importez des utilisateurs depuis le groupe.
ja: グループからユーザーをインポートします。
pt: Importar utilizadores do grupo.

source: Import users from the group, but also do so recursively.
de: Benutzer aus der Gruppe importieren, aber auch rekursiv.
es: Importar usuarios del grupo, pero también recursivamente.
fr: Importez des utilisateurs depuis le groupe, mais faites-le de manière récursive.
ja: ユーザーをグループからインポートしますが、この操作を再帰的にも実行します。
pt: Importar utilizadores do grupo, mas efectuar também a acção recursivamente.

source: Sync users in the group.
de: Benutzer in der Gruppe synchronisieren.
es: Sincronizar usuarios del grupo.
fr: Synchronisez des utilisateurs dans le groupe.
ja: グループ内のユーザーを同期します。
pt: Sincronizar utilizadores no grupo.

source: Server to connect to.
de: Der Server, zu dem eine Verbindung hergestellt werden soll.
es: Servidor al que conectarse.
fr: Serveur avec lequel établir une connexion.
ja: 接続先のサーバーです。
pt: Servidor ao qual ligar.

source: A group name must be provided.
de: Es muss ein Gruppenname angegeben werden.
es: Se debe proporcionar un nombre de grupo.
fr: Vous devez indiquer un nom de groupe.
ja: グループ名を指定する必要があります。
pt: É necessário fornecer um nome de grupo.

source: Sync groups of the users.
de: Synchronisieren Sie Benutzergruppen.
es: Sincronizar grupos de usuarios.
fr: Synchronisez les groupes des utilisateurs.
ja: ユーザーのグループを同期します。
pt: Sincronizar grupos dos utilizadores.

source: A username must be provided.
de: Es muss ein Benutzername angegeben werden.
es: Se debe proporcionar un nombre de usuario.
fr: Vous devez indiquer un nom d'utilisateur.
ja: ユーザー名を指定する必要があります。
pt: É necessário fornecer um nome de utilizador.

source: Minimum UID to import (Inclusive).
de: Minimale zu importierende UID (inklusiv).
es: UID mínimo para importar (inclusivo).
fr: UID minimum à importer (inclusif).
ja: インポートする最小 UID（指定値も含む）
pt: UID mínimo a importar (incluído).

source: Maximum UID to import (Exclusive).
de: Maximale zu importierende UID (exklusiv).
es: UID máximo para importar (exclusivo).
fr: UID maximum à importer (exclusif).
ja: インポートする最大 UID（指定値は除外）。
pt: UID máximo a importar (não incluído).

source: Minimum GID to import (Inclusive).
de: Minimale GID zu importieren (inklusiv).
es: GID mínimo para importar (inclusivo).
fr: GID minimum à importer (inclusif).
ja: インポートする最小 GID（指定値も含む）。
pt: GID mínimo a importar (incluído).

source: Maximum GID to import (Exclusive).
de: Maximale zu importierende GID (exklusiv).
es: GID máximo para importar (exclusivo).
fr: GID maximum à importer (exclusif).
ja: インポートする最大 GID（指定値は除外）。
pt: GID máximo a importar (não incluído).

source: Whether or not to check that the user's shell is not /bin/false.
de: Ob geprüft werden soll oder nicht, dass die Shell des Benutzers nicht /bin/false ist.
es: Indica si se debe comprobar o no que el shell del usuario no es /bin/false.
fr: Indique s'il faut vérifier que le shell de l'utilisateur n'est pas /bin/faux.
ja: ユーザーのシェルが /bin/false ではないことを確認するかどうかの指定です。
pt: Verificar ou não se a shell do utilizador não é /bin/false.

source: Hue Users
de: Hue-Benutzer
es: Usuarios de Hue
fr: Utilisateurs Hue
ja: Hue ユーザー
pt: Utilizadores da Hue

source: Hue Users - Add/Sync LDAP user
de: Hue-Benutzer - LDAP-Benutzer hinzufügen/synchronisieren
es: Usuarios de Hue: agregar/sincronizar usuario de LDAP
fr: Utilisateurs Hue - Ajouter/Synchroniser un utilisateur LDAP
ja: Hue ユーザー - LDAP ユーザーを追加／同期
pt: Utilizadores da Hue - Adicionar/Sincronizar utilizador de LDAP

source: Update user
de: Benutzer aktualisieren
es: Actualizar usuario
fr: Mettre à jour un utilisateur
ja: ユーザーを更新
pt: Actualizar utilizador

source: Add/Sync user
de: Benutzer hinzufügen/synchronisieren
es: Agregar/sincronizar usuario
fr: Ajouter/Synchroniser un utilisateur
ja: ユーザーを追加／同期
pt: Adicionar/Sincronizar utilizador

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
pt: Cancelar

source: Select all
de: Alle auswählen
es: Seleccionar todo
fr: Sélectionner tout
ja: すべて選択
pt: Seleccionar tudo

source: Search
de: Suche
es: Buscar
fr: Rechercher
ja: 検索
pt: Pesquisar

source: No groups found.
de: Keine Gruppen gefunden.
es: No se ha encontrado ningún grupo.
fr: Groupes introuvables.
ja: グループが見つかりません。
pt: Nenhum grupo encontrado.

source: Create a new group now
de: Jetzt eine neue Gruppe erstellen
es: Crear un grupo ahora
fr: Créer un groupe maintenant
ja: 新しいグループを今すぐ作成
pt: Criar um novo grupo agora

source: User added/synced correctly
de: Der Benutzer wurde ordnungsgemäß hinzugefügt/synchronisiert.
es: Usuario agregado o sincronizado correctamente
fr: Utilisateur ajouté/synchronisé correctement
ja: ユーザーが正しく追加／同期されました

source: Hue Users - Change password: %(username)s
de: Hue-Benutzer - Kennwort ändern: %(username)s
es: Usuarios de Hue - Cambiar contraseña: %(username)s
fr: Utilisateurs Hue - Modifier le mot de passe : %(username)s
ja: Hue ユーザー：パスワードを変更：%(username)s

source: Credentials
de: Zugangsdaten
es: Credenciales
fr: Informations de connexion
ja: 資格情報

source: (required)
de: (erforderlich)
es: (obligatorio)
fr: (requis)
ja: （必須）
pt: (obrigatório)

source: Change password
de: Kennwort ändern
es: Cambiar contraseña
fr: Modifier le mot de passe
ja: パスワードを変更

source: This field is required.
de: Dieses Feld ist erforderlich.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.
ja: このフィールドは必須です。
pt: Este campo é obrigatório.

source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
pt: Confirmar

source: Yes
de: Ja
es: Sí
fr: Oui
ja: はい
pt: Sim

source: Hue Groups
de: Hue-Gruppen
es: Grupos de Hue
fr: Groupes Hue
ja: Hue グループ
pt: Grupos da Hue

source: Hue Groups - Edit group: %(name)s
de: Hue-Gruppen - Gruppe bearbeiten: %(name)s
es: Grupos de Hue: editar grupo: %(name)s
fr: Groupes Hue - Modifier un groupe : %(name)s
ja: Hue グループ - グループの編集：%(name)s
pt: Grupos da Hue - Editar grupo: %(name)s

source: Hue Groups - Add/Sync LDAP group
de: Hue-Gruppen - LDAP-Gruppe hinzufügen/synchronisieren
es: Grupos de Hue: agregar/sincronizar grupo LDAP
fr: Groupes Hue - Ajouter/Synchroniser un groupe LDAP
ja: Hue グループ - LDAP グループを追加／同期
pt: Grupos da Hue - Adicionar/Sincronizar grupo de LDAP

source: Hue Groups - Create group
de: Hue-Gruppen - Gruppe erstellen
es: Grupos de Hue: crear grupo
fr: Groupes Hue - Créer un groupe
ja: Hue グループ - グループを作成
pt: Grupos da Hue - Criar grupo

source: Update group
de: Gruppe aktualisieren
es: Actualizar grupo
fr: Mettre à jour un groupe
ja: グループを更新
pt: Actualizar grupo

source: Add/Sync group
de: Gruppe hinzufügen/synchronisieren
es: Agregar/sincronizar grupo
fr: Ajouter/Synchroniser un groupe
ja: グループを追加／同期
pt: Adicionar/Sincronizar grupo

source: Add group
de: Gruppe hinzufügen
es: Agregar grupo
fr: Ajouter un groupe
ja: グループを追加
pt: Adicionar grupo

source: No users found.
de: Keine Benutzer gefunden.
es: No se ha encontrado ningún usuario.
fr: Utilisateurs introuvables.
ja: ユーザーが見つかりません。
pt: Nenhum utilizador encontrado.

source: Create a new user now
de: Jetzt einen neuen Benutzer erstellen
es: Crear un usuario nuevo ahora
fr: Créer un utilisateur maintenant
ja: 新しいユーザーを今すぐ作成
pt: Criar um novo utilizador agora

source: No permissions found.
de: Keine Genehmigungen gefunden.
es: No se han encontrado permisos.
fr: Aucune autorisation trouvée.
ja: パーミッションが見つかりません。
pt: Nenhuma permissão encontrada.

source: Group information updated correctly
de: Gruppeninformationen wurden ordnungsgemäß aktualisiert.
es: Información de grupo actualizada correctamente
fr: Informations sur le groupe mises à jour correctement
ja: グループ情報が正しく更新されました

source: Hue Permissions
de: Hue-Berechtigungen
es: Permisos de Hue
fr: Autorisations Hue
ja: Hue のパーミッション
pt: Permissões da Hue

source: Hue Permissions - Edit app: %(app)s
de: Hue-Berechtigungen - App bearbeiten: %(app)s
es: Permisos de Hue: editar aplicación: %(app)s
fr: Autorisations Hue - Modifier une application : %(app)s
ja: Hue のパーミッション - アプリケーションを編集：%(app)s
pt: Permissões da Hue - Editar aplicação: %(app)s

source: Update permission
de: Berechtigung aktualisieren
es: Actualizar permiso
fr: Mettre à jour une autorisation
ja: パーミッションを更新
pt: Actualizar permissão

source: Permission information updated correctly
de: Berechtigungsinformationen wurden ordnungsgemäß aktualisiert.
es: Información de permiso actualizada correctamente
fr: Informations d'autorisation mises à jour correctement
ja: パーミッション情報が正しく更新されました

source: Hue Users - Edit user: %(username)s
de: Hue-Benutzer - Benutzer bearbeiten: %(username)s
es: Usuarios de Hue: editar usuario: %(username)s
fr: Utilisateurs Hue - Modifier un utilisateur : %(username)s
ja: Hue ユーザー - ユーザーを編集：%(username)s
pt: Utilizadores da Hue - Editar utilizador: %(username)s

source: Hue Users - Create user
de: Hue-Benutzer - Benutzer erstellen
es: Usuarios de Hue: crear usuario
fr: Utilisateurs Hue - Créer un utilisateur
ja: Hue ユーザー - ユーザーを作成
pt: Utilizadores da Hue - Criar utilizador

source: Step 1: Credentials
de: Schritt 1: Zugangsdaten
es: Paso 1: credenciales
fr: Etape 1 : Informations de connexion
ja: 手順 1：資格情報
pt: Passo 1: credenciais

source: Step 2: Profile and Groups
de: Schritt 2: Profile und Gruppen
es: Paso 2: perfil y grupos
fr: Etape 2 : Profil et groupes
ja: 手順 2：プロファイルとグループ

source: Step 2: Profile
de: Schritt 2: Profil
es: Paso 2: perfil
fr: Etape 2 : Profil
ja: 手順 2：プロファイル

source: Step 3: Advanced
de: Schritt 3: Erweitert
es: Paso 3: avanzado
fr: Etape 3 : Paramètres avancés
ja: 手順 3：詳細
pt: Passo 3: opções avançadas

source: Back
de: Zurück
es: Volver
fr: Précédent
ja: 戻る
pt: Voltar

source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次ヘ
pt: Seguinte

source: Add user
de: Benutzer hinzufügen
es: Agregar usuario
fr: Ajouter un utilisateur
ja: ユーザーを追加
pt: Adicionar utilizador

source: User information updated correctly
de: Benutzerinformationen wurden ordnungsgemäß aktualisiert.
es: Información de usuario actualizada correctamente
fr: Informations sur l'utilisateur mises à jour correctement
ja: ユーザー情報が正しく更新されました

source: User admin icon
de: Benutzeradministrator-Symbol
es: Icono de administración de usuarios
fr: Icône Administrateur
ja: ユーザー管理アイコン

source: User Admin
de: Benutzeradministrator
es: Administrador de usuario
fr: Administrateur
ja: ユーザー管理者
pt: Utilizador admin

source: Users
de: Benutzer
es: Usuarios
fr: Utilisateurs
ja: ユーザー
pt: Utilizadores

source: Groups
de: Gruppen
es: Grupos
fr: Groupes
ja: グループ
pt: Grupos

source: Permissions
de: Berechtigungen
es: Permisos
fr: Autorisations
ja: パーミッション
pt: Permissões

source: Configurations
de: Konfigurationen
es: Configuraciones
ja: 設定

source: Application
de: Anwendung
es: Aplicación
ja: アプリケーション
pt: Aplicação

source: There are no configurations matching the search criteria.
de: Es gibt keine Konfigurationen, die den Suchkriterien entsprechen.
es: No hay ninguna configuración que coincida con los criterios de búsqueda.
fr: Aucune configuration ne correspond aux critères de recherche.
ja: 検索条件に一致する設定が存在しません。

source: configuration
de: Konfiguration
es: configuración
ja: 設定

source: Role
de: Rolle
es: Rol
fr: Rôle
ja: ロール

source: Remove
de: Entfernen
es: Quitar
fr: Supprimer
ja: 削除

source: Properties
de: Eigenschaften
es: Propiedades
fr: Propriétés
ja: プロパティ

source: Add role
de: Rolle hinzufügen
es: Añadir rol
fr: Ajouter un rôle
ja: ロールを追加

source: Update configuration
de: Konfiguration aktualisieren
es: Actualizar configuración
fr: Modifier la configuration
ja: 設定を更新

source: There was an error loading the configurations
de: Fehler beim Laden der Konfigurationen
es: Se ha producido un error al cargar las configuraciones
fr: Une erreur s'est produite lors du chargement des configurations
ja: 設定のロード中にエラーが発生しました

source: Search for name, members, etc...
de: Nach Namen, Mitgliedern usw. suchen...
es: Buscar nombre, miembros, etc.
fr: Rechercher un nom, des membres, etc.
ja: 名前、メンバーなどを検索...
pt: Pesquisar por nome, membros, etc...

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
pt: Eliminar

source: Add/Sync LDAP group
de: LDAP-Gruppe hinzufügen/synchronisieren
es: Actualizar/sincronizar grupo LDAP
fr: Ajouter/Synchroniser un groupe LDAP
ja: LDAP グループを追加／同期
pt: Adicionar/Sincronizar grupo de LDAP

source: Learn how to integrate Hue with your company LDAP
de: Erfahren Sie mehr zur Integration von Hue in Ihr Unternehmens-LDAP
es: Aprenda cómo integrar Hue en el LDAP de su empresa
fr: Découvrez comment intégrer Hue au protocole LDAP de votre société
ja: Hue を会社の LDAP と統合する方法を確認する

source: Group Name
de: Gruppenname
es: Nombre de grupo
fr: Nom de groupe
ja: グループ名
pt: Nome de grupo

source: Members
de: Mitglieder
es: Miembros
fr: Membres
ja: メンバー
pt: Membros

source: Edit %(groupname)s
de: %(groupname)s bearbeiten
es: Editar %(groupname)s
fr: Modifier %(groupname)s
ja: %(groupname)s の編集
pt: Editar %(groupname)s

source: There are no groups matching the search criteria.
de: Es gibt keine Gruppen, die den Suchkriterien entsprechen.
es: No hay ningún grupo que coincida con los criterios de búsqueda.
fr: Aucun groupe ne correspond aux critères de recherche.
ja: 検索条件に一致するグループが存在しません。
pt: Não há grupos correspondentes aos critérios de pesquisa.

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる

source: Are you sure you want to delete the selected group(s)?
de: Sind Sie sicher, dass Sie die ausgewählte(n) Gruppe(n) löschen möchten?
es: ¿Está seguro de que desea eliminar los grupos seleccionados?
fr: Voulez-vous vraiment supprimer le ou les groupes sélectionnés ?
ja: 選択したグループを削除してもよろしいですか?
pt: Tem a certeza de que pretende eliminar os grupos seleccionados?

source: No
de: Nein
fr: Non
ja: いいえ
pt: Não

source: No data available
de: Keine Daten verfügbar
es: No hay datos disponibles
fr: Aucune donnée disponible
ja: 利用可能なデータがありません
pt: Não existem dados disponíveis

source: No matching records
de: Keine übereinstimmenden Datensätze
es: No hay registros coincidentes
fr: Aucun enregistrement correspondant
ja: 一致するレコードがありません
pt: Não existem registos correspondentes

source: Search for application, group, etc...
de: Nach Anwendung, Gruppe usw. suchen...
es: Buscar aplicación, grupo, etc.
fr: Rechercher une application, un groupe, etc.
ja: アプリケーション、グループなどを検索...
pt: Pesquisar por aplicação, grupo, etc...

source: Permission
de: Berechtigung
es: Permiso
fr: Autorisation
ja: パーミッション
pt: Permissão

source: Edit permission
de: Berechtigung bearbeiten
es: Editar permiso
fr: Modifier l'autorisation
ja: パーミッションを編集
pt: Editar permissão

source: There are no permissions matching the search criteria.
de: Es gibt keine Berechtigungen, die den Suchkriterien entsprechen.
es: No hay ningún permiso que coincida con los criterios de búsqueda.
fr: Aucune autorisation ne correspond aux critères de recherche.
ja: 検索条件に一致するパーミッションが存在しません。
pt: Não há permissões correspondentes aos critérios de pesquisa.

source: Search for name, group, etc...
de: Nach Namen, Gruppe usw. suchen...
es: Buscar nombre, grupo, etc.
fr: Rechercher un nom, un groupe, etc.
ja: 名前、グループなどを検索...
pt: Pesquisar por nome, grupo, etc...

source: Add/Sync LDAP user
de: LDAP-Benutzer hinzufügen/synchronisieren
es: Agregar/sincronizar usuario LDAP
fr: Ajouter/Synchroniser un utilisateur LDAP
ja: LDAP ユーザーを追加／同期
pt: Adicionar/Sincronizar utilizador de LDAP

source: Sync LDAP users/groups
de: LDAP-Benutzer/-Gruppen synchronisieren
es: Sincronizar usuarios/grupos LDAP
fr: Synchroniser des utilisateurs/groupes LDAP
ja: LDAP ユーザー／グループを同期
pt: Sincronizar utilizadores/grupos de LDAP

source: First Name
de: Vorname
es: Nombre
fr: Prénom
ja: 名
pt: Nome

source: Last Name
de: Nachname
es: Apellido
fr: Nom
ja: 姓
pt: Apelido

source: E-mail
es: Correo electrónico
fr: Courriel
ja: 電子メール

source: Last Login
de: Letzte Anmeldung
es: Último inicio de sesión
fr: Dernière connexion
ja: 最後のログイン
pt: Último início de sessão

source: Edit %(username)s
de: %(username)s bearbeiten
es: Editar %(username)s
fr: Modifier %(username)s
ja: %(username)s を編集
pt: Editar %(username)s

source: There are no users matching the search criteria.
de: Es gibt keine Benutzer, die den Suchkriterien entsprechen.
es: No hay ningún usuario que coincida con los criterios de búsqueda.
fr: Aucun utilisateur ne correspond aux critères de recherche.
ja: 検索条件に一致するユーザーが存在しません。
pt: Não há utilizadores correspondentes aos critérios de pesquisa.

source: Are you sure you want to delete the selected user(s)?
de: Sind Sie sicher, dass Sie den/die ausgewählten Benutzer löschen möchten?
es: ¿Está seguro de que desea eliminar los usuarios seleccionados?
fr: Voulez-vous vraiment supprimer le ou les utilisateurs sélectionnés ?
ja: 選択したユーザーを削除してもよろしいですか?
pt: Tem a certeza de que pretende eliminar o(s) utilizador(es) seleccionado(s)?

source: An unknown error has occurred while deleting the user. Please try again.
de: Unbekannter Fehler beim Löschen des Benutzers. Versuchen Sie es erneut.
es: Se ha producido un error desconocido al eliminar el usuario. Inténtelo de nuevo.
fr: Une erreur inconnue s'est produite lors de la suppression de l'utilisateur. Veuillez réessayer.
ja: ユーザーを削除中に不明なエラーが発生しました。再試行してください。

source: The users and groups were updated correctly.
de: Die Benutzer und Gruppen wurden ordnungsgemäß aktualisiert.
es: Los usuarios y los grupos se actualizaron correctamente.
fr: Les utilisateurs et les groupes ont été mis à jour correctement.
ja: ユーザーとグループが正しく更新されました。

source: Sync LDAP users and groups
de: LDAP-Benutzer und -Gruppen synchronisieren
es: Sincronizar usuarios y grupos LDAP
fr: Synchroniser des utilisateurs et des groupes LDAP
ja: LDAP ユーザー／グループを同期
pt: Sincronizar utilizadores e grupos de LDAP

source: This will not import any users or groups that don't already exist in Hue. Only users and groups imported from LDAP can be synced.
de: Hiermit werden nur Benutzer oder Gruppen importiert, die bereits in Hue vorhanden sind. Nur aus LDAP importierte Benutzer und Gruppen können synchronisiert werden.
es: De esta forma, no se importará ningún usuario o grupo que no exista ya en Hue. Solo se pueden sincronizar los usuarios y grupos importados de LDAP.
fr: Aucun utilisateur ou groupe inexistant au préalable dans Hue ne sera importé. Seuls les utilisateurs et groupes importés depuis LDAP peuvent être synchronisés.
ja: Hue に存在していないユーザーおよびグループはインポートされません。LDAP からインポートされたユーザーおよびグループのみを同期できます。
pt: Não será efectuada a importação de quaisquer utilizadores ou grupos que não existam no Hue. Apenas utilizadores e grupos importados do LDAP podem ser sincronizados.

source: All user information and group memberships will be updated based on the LDAP server's current state.
de: Alle Benutzerdaten und Gruppenmitgliedschaften werden entsprechend dem aktuellen Status des LDAP-Servers aktualisiert.
es: Toda la información del usuario y la pertenencia a grupos se actualizará según el estado actual del servidor LDAP.
fr: Toutes les informations d'utilisateur et appartenances à des groupes seront mises à jour en fonction de l'état actuel du serveur LDAP.
ja: LDAP サーバーの現在の状態を基にして、すべてのユーザー情報とグループメンバーシップが更新されます。
pt: Todas as informações de utilizador e associações de grupos serão actualizadas com base no estado actual do servidor LDAP.

source: Sync
de: Synchronisieren
es: Sincronizar
fr: Synchronisation
ja: 同期
pt: Sincronizar

source: User: %(username)s
de: Benutzer: %(username)s
es: Usuario: %(username)s
fr: Utilisateur : %(username)s
ja: ユーザー：%(username)s

source: First name
de: Vorname
es: Nombre
fr: Prénom
ja: 名

source: Last name
de: Nachname
es: Apellido
fr: Nom
ja: 姓

source: Email
fr: Courriel
ja: 電子メール

source: Password
pt: Palavra-passe

source: Previous Password
pt: Palavra-passe anterior
