Repository: cloudera/hue
Catalog: apps/useradmin/src/useradmin/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, pt

source: New user home directory is created with these permissions
de: Das neue Home-Verzeichnis für den Benutzer wird mit den folgenden Berechtigungen erstellt
es: Un nuevo directorio de inicio se crea con estos permisos
fr: Le répertoire d'accueil du nouvel utilisateur a été créé avec ces autorisations
ja: 新しいユーザーホームディレクトリがこれらのパーミッションで作成されます

source: The name of a default group for users at creation time, or at first login if the server is configured to authenticate against an external source.
de: Der Name einer Standardgruppe für Benutzer bei der Erstellung oder der ersten Anmeldung, wenn der Server für die Authentifizierung einer externen Quelle konfiguriert ist.
es: El nombre de un grupo predeterminado para usuarios en el momento de su creación o en el primer inicio de sesión si el servidor está configurado para autenticar con un origen externo.
fr: Nom d'un groupe par défaut pour les utilisateurs lors de sa création ou lors de la première connexion si le serveur est configuré pour authentifier par rapport à une source externe.
ja: 作成時、またはサーバーが外部ソースに対して認証するように設定されている場合は、最初のログイン時のデフォルトのユーザーグループ名です。
pt: O nome de um grupo predefinido de utilizadores no momento da criação ou no momento do primeiro início de sessão, se o servidor estiver configurado para autenticar considerando uma fonte exterior.

source: Configuration options for user password policy
de: Konfigurationsoptionen für Benutzerkennwortrichtlinien
es: Opciones de configuración para la política de contraseñas de usuario
fr: Options de configuration pour une stratégie de mot de passe utilisateur
ja: ユーザーパスワードポリシーの設定オプション
pt: Opções de configuração para política de palava-passe do utilizador

source: Enable user password policy.
de: Aktivieren Sie die Benutzerkennwortrichtlinie.
es: Active la política de contraseñas de usuario.
fr: Activez la stratégie de mot de passe utilisateur.
ja: ユーザーパスワードポリシーを有効にします。
pt: Activar política de palavra-passe do utilizador.

source: The regular expression of password rule. The default rule requires that a password must be at least 8 characters long, and must contain both uppercase and lowercase letters, at least one number, and at least one special character.
de: Der reguläre Ausdruck der Kennwortregel. Die Standardregel erfordert, dass ein Kennwort mindestens 8 Zeichen lang ist und sowohl Groß- als auch Kleinbuchstaben, mindestens eine Ziffer und mindestens ein Sonderzeichen enthält.
es: La expresión regular de la regla de contraseñas. La regla predeterminada requiere que la contraseña tenga al menos 8 caracteres y que incluya letras mayúsculas y minúsculas, un número y un carácter especial como mínimo.
fr: Expression régulière de la règle de mot de passe. La règle par défaut stipule qu'un mot de passe doit compter 8 caractères minimum et comporter à la fois des majuscules et des minuscules, au moins un chiffre et au moins un caractère spécial.
ja: パスワードルールの正規表現。デフォルトのルールでは、パスワードは、8 文字以上で、大文字と小文字の両方、1 つ以上の数字、および 1 つ以上の特殊文字を含んでいる必要があります。
pt: A expressão regular da regra de palavra-passe. A regra predefinida exige que a palavra-passe tenha, no mínimo, 8 caracteres, que contenha maiúsculas e minúsculas e, no mínimo, um número e um carácter especial.

source: Message about the password rule defined in pwd_regex
de: Meldung zur in pwd_regex definierten Kennwortregel
es: El mensaje sobre la regla de contraseñas definido en pwd_regex
fr: Message relatif à la règle de mot de passe défini dans pwd_regex
ja: pwd_regex で定義されたパスワードルールに関するメッセージ
pt: Mensagem relativa à regra da palavra-passe definida em pwd_regex

source: The error message displayed if the provided password does not meet the enhanced password rule
de: Die Fehlermeldung, die angezeigt wird, wenn das angegebene Kennwort nicht der verbesserten Kennwortregel entspricht
es: El mensaje de error que aparece si la contraseña facilitada no cumple la regla de contraseñas mejoradas
fr: Message d'erreur affiché si le mot de passe fourni ne respecte pas la règle de mot de passe amélioré
ja: 入力されたパスワードが拡張されたパスワードルールを満たしていない場合に表示されるエラーメッセージ
pt: A mensagem de erro é apresentada, caso a palavra-passe fornecida não respeite a regra de palavra-passe melhorada

source: Full Distinguished Name required.
de: Vollständiger definierter Name erforderlich.
es: Se necesita un nombre completo distintivo.
fr: Nom distinctif complet requis.
ja: 完全な識別名が必要です。
pt: O nome único completo é obrigatório

source: Username is required.
de: Der Benutzername ist erforderlich.
es: Se necesita un nombre de usuario.
fr: Un nom d'utilisateur est requis.
ja: ユーザー名が必要です。
pt: O nome de utilizador é obrigatório.

source: Username must be fewer than 30 characters.
de: Der Benutzername muss aus weniger als 30 Zeichen bestehen.
es: El nombre de usuario debe tener menos de 30 caracteres.
fr: Le nom d'utilisateur doit compter moins de 30 caractères..
ja: ユーザー名は 30 文字未満にする必要があります。
pt: O nome de utilizador tem de ter menos de 30 caracteres.

source: Username must not contain whitespaces and ':'
de: Der Benutzername darf keine Leerzeichen und ":" enthalten.
es: El nombre de usuario no debe contener espacios en blanco ni ':'
fr: Le nom d'utilisateur ne doit inclure ni espaces ni deux-points
ja: ユーザー名はスペースと ':' を含んでいる必要があります。
pt: O nome de utilizador não pode conter espaços em branco, nem ":"

source: Group name required.
de: Gruppenname erforderlich.
es: Se necesita un nombre de grupo.
fr: Nom de groupe requis.
ja: グループ名は必須です。
pt: O nome de grupo é obrigatório.

source: Group name must be 80 characters or fewer.
de: Der Gruppenname darf höchstens 80 Zeichen enthalten.
es: El nombre de grupo debe tener 80 caracteres o menos.
fr: Le nom de groupe doit compter 80 caractères maximum.
ja: グループ名は 80 文字以下にする必要があります。
pt: O nome de grupo tem de ter 80 caracteres ou menos.

source: Group name can be any character as long as it's 80 characters or fewer.
de: Der Gruppenname kann beliebige Zeichen enthalten, aber es dürfen höchstens 80 sein.
es: El nombre de grupo puede contener cualquier carácter siempre y cuando no supere el límite de 80 caracteres.
fr: Le nom de groupe peut contenir toutes sortes de caractères et jusqu'à 80 caractères maximum.
ja: グループ名は、80 文字以下で任意の文字を使用できます。
pt: O nome de grupo pode conter qualquer carácter, desde que tenha 80 caracteres ou menos.

source: first_name must be fewer than 30 characters.
de: first_name muss aus weniger als 30 Zeichen bestehen.
es: first_name debe tener menos de 30 caracteres.
fr: le prénom doit compter moins de 30 caractères.
ja: 名は 30 文字未満にする必要があります。

source: last_name must be fewer than 30 characters.
de: last_name muss aus weniger als 30 Zeichen bestehen.
es: last_name debe tener menos de 30 caracteres.
fr: le nom de famille doit compter moins de 30 caractères.
ja: 姓は 30 文字未満にする必要があります。

source: Username or password is invalid.
de: Benutzername oder Kennwort ungültig.
es: El nombre de usuario o la contraseña no son válidos.
fr: Le nom d'utilisateur ou le mot de passe est incorrect.
ja: ユーザー名またはパスワードが無効です。

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名
pt: Nome de utilizador

source: Required. 30 characters or fewer. No whitespaces or colons.
de: Erforderlich. 30 Zeichen oder weniger. Keine Leerzeichen oder Doppelpunkte.
es: Obligatorio. 30 caracteres o menos. Sin espacios en blanco ni dos puntos.
fr: Requis. 30 caractères maximum. Espaces ou deux-points non autorisés.
ja: 必須。文字数は 30 以下。スペースとコロンは使用できません。
pt: Obrigatório. 30 caracteres ou menos. Sem espaços em branco ou dois pontos.

source: Whitespaces and ':' not allowed
de: Leerzeichen und ":" nicht zugelassen
es: No se permiten espacios en blanco ni ':'
fr: Espaces et deux-points interdits
ja: スペースと '.' は使用できません。
pt: Espaços em branco e ":" não permitidos

source: New Password
de: Neues Kennwort
es: Nueva contraseña
fr: Nouveau mot de passe
ja: 新規パスワード

source: Password confirmation
de: Kennwortbestätigung
es: Confirmación de contraseña
fr: Confirmation du mot de passe
ja: パスワードの確認
pt: Confirmação de palavra-passe

source: Current password
de: Aktuelles Kennwort
es: Contraseña actual
fr: Mot de passe actuel
ja: 現在のパスワード

source: Create home directory
de: Home-Verzeichnis erstellen
es: Crear directorio de inicio
fr: Créer un répertoire racine
ja: ホームディレクトリを作成
pt: Criar directório inicial

source: Create home directory if one doesn't already exist.
de: Home-Verzeichnis erstellen, falls noch keines vorhanden ist.
es: Crear directorio de inicio si aún no existe ninguno.
fr: Créez un répertoire racine s'il n'en existe pas encore.
ja: ホームディレクトリを作成してください（存在しない場合）。
pt: Criar directório inicial, caso ainda não exista.

source: Language Preference
de: Spracheinstellung
es: Preferencia de idioma
fr: Langue préférée
ja: 言語の設定

source: Unlock Account
de: Konto entsperren
es: Desbloquear cuenta
fr: Déverrouiller le compte
ja: アカウントをロック解除

source: Unlock user's account for login.
de: Konto des Benutzers für die Anmeldung entsperren
es: Desbloquear la cuenta de usuario para iniciar sesión.
fr: Déverrouillez le compte de l'utilisateur pour la connexion.
ja: ログインのためにユーザーのアカウントをロック解除します。

source: Passwords do not match.
de: Kennwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne concordent pas.
ja: パスワードが一致しません。
pt: As palavras-passe não coincidem.

source: You must specify a password when creating a new user.
de: Sie müssen ein Kennwort angeben, wenn Sie einen neuen Benutzer erstellen.
es: Debe especificar una contraseña al crear un nuevo usuario.
fr: Vous devez spécifier un mot de passe lors de la création d'un utilisateur.
ja: 新しいユーザーを作成するときにはパスワードを指定する必要があります。
pt: Tem de especificar uma palavra-passe ao criar um novo utilizador.

source: Required. 30 characters or fewer with username. 64 characters or fewer with DN. No whitespaces or colons.
de: Erforderlich. Höchstens 30 Zeichen mit Benutzername. Höchstens 64 Zeichen mit DN. Keine Leerzeichen oder Doppelpunkte.
es: Obligatorio. Nombre de usuario de 30 caracteres o menos. Nombre de dominio de 64 caracteres o menos. Sin espacios en blanco ni dos puntos.
fr: Requis. 30 caractères maximum pour le nom d'utilisateur. 64 caractères maximum pour le nom distinctif. Espaces ou deux-points non autorisés.
ja: 必須。ユーザー名は 30 文字以下、DN は 64 文字以下とし、スペースとコロンは使用できません。
pt: Obrigatório. 30 caracteres ou menos com nome de utilizador. 64 caracteres ou menos com DN. Sem espaços em branco ou dois pontos.

source: Distinguished name
de: Definierter Name
es: Nombre distintivo
fr: Nom distinctif
ja: 識別名
pt: Nome único

source: Whether or not the user should be imported by distinguished name.
de: Ob der Benutzer nach definiertem Namen importiert werden soll oder nicht.
es: Indica si el usuario se debe importar por nombre distintivo o no.
fr: Indique si l'utilisateur doit être importé par un nom distinctif.
ja: ユーザーを識別名指定でインポートするかどうかの指定です。
pt: Indica se o utilizador deve ou não ser importado por nome distinto.

source: Create home directory for user if one doesn't already exist.
de: Home-Verzeichnis für den Benutzer erstellen, falls noch keines vorhanden ist.
es: Crear directorio de inicio para el usuario si aún no existe ninguno.
fr: Créez un répertoire racine pour l'utilisateur s'il n'en existe pas encore.
ja: ユーザーのホームディレクトリを作成してください（存在しない場合）。
pt: Criar directório inicial para utilizador, caso ainda não exista.

source: Name
es: Nombre
fr: Nom
ja: 名前
pt: Nome

source: Required. 256 characters or fewer.
de: Erforderlich. Höchstens 256 Zeichen.
es: Obligatorio. 256 caracteres o menos.
fr: Requis. 256 caractères maximum.
ja: 必須。256 文字以下であることが必要です。
pt: Obrigatório. 256 caracteres ou menos.

source: 256 characters or fewer.
de: Höchstens 256 Zeichen.
es: 256 caracteres o menos.
fr: 256 caractères maximum.
ja: 256 文字以下であることが必要です。
pt: 256 caracteres ou menos.

source: Whether or not the group should be imported by distinguished name.
de: Ob die Gruppe nach definiertem Namen importiert werden soll oder nicht.
es: Indica si el grupo se debe importar por nombre distintivo o no.
fr: Indique si le groupe doit être importé par un nom distinctif.
ja: グループを識別名指定でインポートするかどうかの指定です。
pt: Indica se o grupo deve ser importado por nome distinto ou não.

source: Import new members
de: Neue Mitglieder importieren
es: Importar nuevos miembros
fr: Importer de nouveaux membres
ja: 新規メンバーのインポート
pt: Importar novos membros

source: Import unimported or new users from the group.
de: Nicht importierte oder neue Benutzer von der Gruppe importieren.
es: Importar usuarios no importados o nuevos del grupo.
fr: Importer des utilisateurs non importés ou nouveaux depuis le groupe.
ja: 未インポートユーザーまたは新規ユーザーをグループからインポートします。
pt: Importar utilizadores não importados ou novos a partir do grupo.

source: Create home directories
de: Home-Verzeichnisse erstellen
es: Crear directorios de inicio
fr: Créer des répertoires racines
ja: ホームディレクトリを作成
pt: Criar directórios iniciais

source: Create home directories for every member imported, if members are being imported.
de: Home-Verzeichnisse für jedes importierte Mitglied erstellen, wenn Mitglieder importiert werden.
es: Crear directorios de inicio para todos los miembros importados, si se están importando miembros.
fr: Créez des répertoires racines pour chaque membre importé si des membres sont importés actuellement.
ja: インポートされる各メンバーのホームディレクトリを作成してください（メンバーをインポートする場合）。
pt: Criar directórios iniciais para cada membro importado, se estiverem a ser importados membros.

source: Import new members from all subgroups
de: Neue Mitglieder aus allen Untergruppen importieren.
es: Importar nuevos miembros de todos los subgrupos.
fr: Importer de nouveaux utilisateurs depuis tous les sous-groupes
ja: すべてのサブグループから新規メンバーをインポート
pt: Importar novos membros de todos os subgrupos

source: Import unimported or new users from the all subgroups.
de: Nicht importierte oder neue Benutzer aus allen Untergruppen importieren.
es: Importar usuarios no importados o nuevos de todos los subgrupos.
fr: Importez des utilisateurs non importés ou nouveaux depuis tous les sous-groupes.
ja: 未インポートユーザーまたは新規ユーザーをすべてのサブグループからインポートします。
pt: Importar utilizadores não importados ou novos de todos os subgrupos.

source: Group name may only contain letters, numbers, hyphens or underscores.
de: Der Gruppenname darf nur Buchstaben, Ziffern, Bindestriche oder Unterstriche enthalten.
es: El nombre de grupo solo puede contener letras, números, guiones o guiones bajos.
fr: Le nom de groupe ne peut contenir que des lettres, des chiffres, des tirets et des barres de soulignement.
ja: グループ名には文字、数字、ハイフン、またはアンダースコアのみを使用できます。
pt: O nome de grupo pode conter apenas letras, números, hífens ou traços inferiores.

source: members
de: Mitglieder
es: miembros
fr: membres
ja: メンバー
pt: membros

source: permissions
de: Berechtigungen
es: permisos
fr: autorisations
ja: パーミッション
pt: permissões

source: groups
de: Gruppen
es: grupos
fr: groupes
ja: グループ
pt: grupos

source: Create Home Directories
de: Home-Verzeichnisse erstellen
es: Crear directorios de inicio
fr: Créer des répertoires racines
ja: ホームディレクトリを作成
pt: Criar Directórios Iniciais

source: Create home directory for every user, if one doesn't already exist.
de: Home-Verzeichnis für alle Benutzer erstellen, falls noch keines vorhanden ist.
es: Crear directorio de inicio para el usuario, si aún no existe ninguno.
fr: Créez un répertoire racine pour chaque utilisateur s'il n'en existe pas encore.
ja: 各ユーザーのホームディレクトリを作成してください（存在しない場合）。
pt: Criar directório inicial para cada utilizador, caso ainda não exista.

source: First Login
de: Erste Anmeldung
es: Primer inicio de sesión
fr: Première connexion
ja: 初回ログイン

source: If this is users first login.
de: Wenn es sich um die erste Anmeldung des Benutzers handelt.
es: Si se trata del primer inicio de sesión del usuario.
fr: Si c'est la première connexion de l'utilisateur.
ja: これがユーザーの初回ログインの場合。

source: You do not have permissions to %(description)s.
de: Sie haben keine Berechtigung zu %(description)s.
es: No tiene permisos para %(description)s.
fr: Vous n'êtes pas autorisé à %(description)s.
ja: %(description)s のためのパーミッションがありません。
pt: Não tem permissões para %(description)s.

source: You must be a superuser to delete users.
de: Sie müssen ein Superuser sein, um Benutzer löschen zu können.
es: Debe ser un superusuario para eliminar usuarios.
fr: Vous devez être un superutilisateur pour pouvoir supprimer des utilisateurs.
ja: ユーザーを削除するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para eliminar utilizadores.

source: A POST request is required.
de: Eine POST-Anforderung ist erforderlich.
es: Se necesita una solicitud POST.
fr: Requête POST requise.
ja: POST 要求が必要です。
pt: É necessário um pedido POST.

source: You cannot remove yourself.
de: Sie können sich selbst nicht löschen.
es: No puede quitarse a sí mismo.
fr: Vous ne pouvez pas vous supprimer vous-même.
ja: 自分自身を削除することはできません。
pt: Não pode remover-se a si próprio.

source: The users were deleted.
de: Die Benutzer wurden gelöscht.
es: Los usuarios se han eliminado.
fr: Les utilisateurs ont été supprimés.
ja: ユーザーが削除されました。
pt: Os utilizadores foram eliminados.

source: You must be a superuser to delete groups.
de: Sie müssen ein Superuser sein, um Gruppen zu löschen.
es: Debe ser un superusuario para eliminar grupos.
fr: Vous devez être un superutilisateur pour pouvoir supprimer des groupes.
ja: グループを削除するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para eliminar grupos.

source: The default user group may not be deleted.
de: Die Standardbenutzergruppe darf nicht gelöscht werden.
es: No se puede eliminar el grupo de usuarios predeterminado.
fr: Le groupe d'utilisateurs par défaut ne peut pas être supprimé.
ja: デフォルトのユーザーグループは削除できません。
pt: O grupo de utilizador predefinido não pode ser eliminado.

source: The groups were deleted.
de: Die Gruppen wurden gelöscht.
es: Los grupos se han eliminado.
fr: Les groupes ont été supprimés.
ja: グループが削除されました。
pt: Os grupos foram eliminados.

source: Group not found.
de: Gruppe nicht gefunden.
es: Grupo no encontrado.
fr: Groupe introuvable.
ja: グループが見つかりません。
pt: Grupo não encontrado.

source: You must be a superuser to add or edit another user.
de: Sie müssen ein Superuser sein, um einen anderen Benutzer hinzufügen oder bearbeiten zu können.
es: Debe ser un superusuario para agregar o editar otro usuario.
fr: Vous devez être un superutilisateur pour pouvoir ajouter ou modifier un autre utilisateur.
ja: 別のユーザーを追加または編集するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para adicionar ou editar outro utilizador.

source: You cannot change a username.
de: Ein Benutzername kann nicht geändert werden.
es: No puede cambiar un nombre de usuario.
fr: Vous ne pouvez pas modifier un nom d'utilisateur.
ja: ユーザー名は変更できません。
pt: Não pode alterar um nome de utilizador.

source: You cannot make yourself inactive.
de: Sie können sich selbst nicht deaktivieren.
es: No puede desactivarse a sí mismo.
fr: Vous ne pouvez pas vous définir vous-même comme inactif.
ja: 自分自身を非アクティブにすることはできません。
pt: Não pode desactivar-se a si próprio.

source: You cannot make yourself a superuser.
de: Sie können sich selbst nicht zu einem Superuser machen.
es: No puede convertirse a sí mismo en superusuario.
fr: Vous ne pouvez pas vous définir vous-même comme un superutilisateur.
ja: 自分自身をスーパーユーザーにすることはできません。
pt: Não pode definir-se a si próprio como superutilizador.

source: You must be a superuser to reset users.
de: Sie müssen ein Superuser sein, um Benutzer zurücksetzen zu können.
es: Debe ser un superusuario para restablecer usuarios.
fr: Vous devez être un superutilisateur pour pouvoir réinitialiser des utilisateurs.
ja: ユーザーをリセットするにはスーパーユーザーであることが必要です。

source: Successfully unlocked account for user: %s
de: Konto für folgenden Benutzer erfolgreich entsperrt: %s
es: Se ha desbloqueado correctamente la cuenta para el usuario: %s
fr: Compte déverrouillé avec succès pour l'utilisateur : %s
ja: ユーザー %s のアカウントを正常にロック解除しました

source: Failed to reset login attempts for %s: %s
de: Anmeldeversuche für %s konnten nicht zurückgesetzt werden: %s
es: Error al restablecer los intentos de inicio de sesión de %s: %s
fr: Echec de la réinitialisation du nombre d'essais de connexion pour %s : %s
ja: %s：%s に関して、ログイン試行回数のリセットに失敗しました

source: Cannot make home directory for user %s.
de: Home-Verzeichnis für Benutzer %s kann nicht erstellt werden.
es: No puede ser directorio de inicio para el usuario %s.
fr: Impossible de créer un répertoire d'accueil pour l'utilisateur %s.
ja: ユーザー %s のホームディレクトリを作成できません。
pt: Não é possível criar o directório de início para o utilizador %s.

source: User information updated
de: Benutzerinformationen aktualisiert
es: Información de usuario actualizada
fr: Informations sur l'utilisateur mises à jour
ja: ユーザー情報が更新されました
pt: Informações do utilizador actualizadas

source: You must be a superuser to add or edit a group.
de: Sie müssen ein Superuser sein, um eine Gruppe hinzuzufügen oder zu bearbeiten.
es: Debe ser un superusuario para agregar o editar un grupo.
fr: Vous devez être un superutilisateur pour pouvoir ajouter ou modifier un groupe.
ja: グループを追加または編集するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para adicionar ou editar um grupo.

source: Group information updated
de: Gruppeninformationen aktualisiert
es: Información de grupo actualizada
fr: Informations sur le groupe mises à jour
ja: グループ情報が更新されました
pt: Informações de grupo actualizadas

source: You must be a superuser to change permissions.
de: Sie müssen ein Superuser sein, um Berechtigungen ändern zu können.
es: Debe ser un superusuario para cambiar permisos.
fr: Vous devez être un superutilisateur pour pouvoir modifier les autorisations.
ja: パーミッションを変更するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para alterar permissões.

source: Permission information updated
de: Berechtigungsinformationen aktualisiert
es: Información de permiso actualizada
fr: Informations d'autorisation mises à jour
ja: パーミッション情報が更新されました
pt: Informações de permissão actualizadas

source: You must be a superuser to add another user.
de: Sie müssen ein Superuser sein, um einen anderen Benutzer hinzufügen zu können.
es: Debe ser un superusuario para agregar otro usuario.
fr: Vous devez être un superutilisateur pour pouvoir ajouter un autre utilisateur.
ja: 別のユーザーを追加するにはスーパーユーザーであることが必要です。
pt: Tem de ser um superutilizador para adicionar outro utilizador.

source: There was an error when communicating with LDAP
de: Fehler bei der Kommunikation mit LDAP
es: Error al comunicar con LDAP
fr: Une erreur s'est produite lors de la communication avec LDAP
ja: LDAP で通信しているときにエラーが発生しました
pt: Ocorreu um erro ao comunicar com o LDAP

source: There was a problem with some of the LDAP information
de: Es ist ein Problem mit einem Teil der LDAP-Daten aufgetreten:
es: Se ha producido un problema con parte de la información de LDAP
fr: Un problème est survenu avec certaines informations LDAP
ja: 一部の LDAP 情報に問題があります。
pt: Ocorreu um problema com alguma informação de LDAP

source: Could not get LDAP details for users in pattern %s.
de: LDAP-Details für Benutzer in Muster %s konnten nicht abgerufen werden.
es: No se pueden obtener los detalles de LDAP de los usuarios en el patrón %s.
fr: Impossible de récupérer les détails LDAP pour les utilisateurs dans le modèle %s.
ja: パターン %s のユーザーの LDAP 詳細を取得できませんでした。
pt: Não foi possível obter detalhes de LDAP para utilizadores no padrão %s

source: Failed to import following users: %s
de: Folgende Benutzer konnten nicht importiert werden: %s
es: Error al importar los siguientes usuarios: %s
fr: Echec de l'importation des utilisateurs suivants : %s
ja: 次のユーザーのインポートに失敗しました：%s
