Repository: cloudera/hue
Catalog: desktop/libs/hadoop/src/hadoop/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr

source: NameNode logical name.
de: Logischer NameNode-Name
es: Nombre lógico de NameNode.
fr: Nom logique du NameNode.

source: JobTracker logical name.
de: Logischer JobTracker-Name.
es: Nombre lógico de JobTracker.
fr: Nom logique du JobTracker.

source: Resource Manager logical name.
de: Logischer Name von Resource Manager.
es: Nombre lógico de Resource Manager.
fr: Nom logique du gestionnaire de ressources.

source: %(remote_dst)s already exists. Skipping.
de: %(remote_dst)s bereits vorhanden. Wird übersprungen.
es: %(remote_dst)s ya existe. Omitiendo.
fr: %(remote_dst)s existe déjà. Ignorer.

source: %(remote_dst)s does not exist. Trying to copy.
de: %(remote_dst)s nicht vorhanden. Kopieren wird versucht.
es: %(remote_dst)s no existe. Intentando copiar
fr: %(remote_dst)s n'existe pas. Tentative de copie en cours.

source: Copied %s -> %s.
de: %s -> %s kopiert.
es: Copiado %s -> %s.
fr: Copié %s -> %s

source: Copying %s -> %s failed.
de: Kopieren von %s -> %s fehlgeschlagen.
es: Error al copiar %s -> %s.
fr: Echec de la copie %s -> %s.

source: Skipping %s (not a file).
de: %s wird übersprungen (keine Datei).
es: Omitiendo %s (no es un archivo).
fr: %s ignoré (pas un fichier).

source: %(function)s has not been implemented.
de: %(function)s wurde noch nicht implementiert.
es: %(function)s no se ha implementado.
fr: %(function)s n'a pas été implémentée.

source: No HDFS found
de: Kein HDFS gefunden
es: No se ha encontrado ningún HDFS
fr: Aucun HDFS trouvé

source: User %s does not have permissions to write to path "%s".
de: Benutzer %s ist nicht berechtigt, in Pfad "%s" zu schreiben.
es: El usuario %s no cuenta con permisos para escribir en la ruta "%s".
fr: L'utilisateur %s ne dispose pas des autorisations pour écrire vers le chemin "%s".

source: File %s not found
de: Datei %s nicht gefunden
es: Archivo %s no encontrado
fr: Fichier %s introuvable

source: File %s is a directory
de: Datei %s ist ein Verzeichnis
es: El archivo %s es un directorio
fr: Le fichier %s est un répertoire

source: File %s is already trashed
de: Datei %s wurde bereits entfernt
es: El archivo %s ya se ha eliminado
fr: Le fichier %s est déjà placé dans la corbeille

source: Delete failed: %s
de: Löschen fehlgeschlagen: %s
es: Error al eliminar: %s
fr: Echec de la suppression : %s

source: File %s is not in trash
de: Datei %s ist nicht im Papierkorb
es: El archivo %s no se encuentra en la papelera
fr: Le fichier %s n'est pas dans la corbeille

source: Path %s already exists.
de: Pfad %s ist bereits vorhanden.
es: La ruta %s ya existe.
fr: Le chemin d'accès %s existe déjà.

source: Mkdir failed: %s
de: Mkdir fehlgeschlagen: %s
es: Error en Mkdir: %s
fr: Echec de la commande Mkdir : %s

source: Rename failed: %s -> %s
de: Umbenennen fehlgeschlagen: %s -> %s
es: Error al cambiar de nombre: %s -> %s
fr: Echec du changement de nom : %s -> %s

source: '%s' is not a directory
de: '%s' ist kein Verzeichnis
es: '%s' no es un directorio
fr: "%s" n'est pas un répertoire

source: Copy src '%s' does not exist
de: Kopie-src '%s' ist nicht vorhanden
es: La copia de origen '%s' no existe
fr: La copie src "%s" n'existe pas

source: Copy src '%s' is a directory
de: Kopie-src '%s' ist ein Verzeichnis
es: La copia de origen '%s' es un directorio
fr: La copie src "%s" est un répertoire

source: Copy dst '%s' is a directory
de: Kopie-dst '%s' ist eine Verzeichnis
es: La copia de destino '%s' es un directorio
fr: La copie dst "%s" est un répertoire

source: File not found: %s
de: Datei nicht gefunden: %s
es: Archivo no encontrado: %s
fr: Fichier introuvable : %s

source: Destination file %s exists and is not a directory.
de: Zieldatei %s existiert und ist kein Verzeichnis.
es: El archivo de destino %s existe y no es un directorio.
fr: Le fichier de destination %s existe et n'est pas un répertoire.

source: Failed to create '%s'. HDFS did not return a redirect
de: '%s' konnte nicht erstellt werden. HDFS gab keine Umleitung aus.
es: Error al crear '%s'. HDFS no ha devuelto un redireccionamiento
fr: Echec de la création de "%s". HDFS n'a pas renvoyé de redirection

source: Failed to upload file. WebHdfs requires a valid username to upload files.
de: Fehler beim Hochladen der Datei. WebHdfs erfordert einen gültigen Benutzernamen, um Dateien hochzuladen.
es: Error al cargar el archivo. WebHdfs necesita un nombre de usuario válido para cargar archivos.
fr: Echec du chargement du fichier. WebHdfs requiert un nom d'utilisateur valable pour charger des fichiers.

source: Is a directory: '%s'
de: Ist ein Verzeichnis: '%s'
es: Es un directorio: '%s'
fr: Est un répertoire : "%s"

source: Invalid argument to seek for whence
de: Ungültiges zu suchendes Argument
es: Argumento de búsqueda de ubicación no válido
fr: Argument non valide à rechercher

source: File not open for writing
de: Datei nicht zum Schreiben geöffnet
es: Archivo no abierto para escritura
fr: Fichier non ouvert pour l'écriture

source: Filesystem root '/' should be owned by '%s'
de: Dateisystemstamm "/" darf nicht Eigentum von "%s" sein
es: El propietario de la raíz del sistema de archivos '/' debe ser '%s'
fr: La racine du système de fichiers '/' ne doit pas être détenue par '%s'

source: Failed to access filesystem root
de: Dateisystemstamm konnte nicht aufgerufen werden
es: Error al acceder a la raíz del sistema de archivos
fr: Echec de l'accès à la racine du système de fichiers

source: Failed to create temporary file "%s"
de: Temporäre Datei "%s" konnte nicht erstellt werden
es: Error al crear el archivo temporal "%s"
fr: Echec de la création du fichier temporaire "%s"

source: Failed to remove temporary file "%s"
de: Temporäre Datei "%s" konnte nicht entfernt werden
es: Error al eliminar el archivo temporal "%s"
fr: Echec de la suppression du fichier temporaire "%s"

source: YARN cluster is not available.
de: YARN-Cluster ist nicht verfügbar.
es: El clúster de YARN no está disponible.
fr: Le cluster YARN n'est pas disponible.

source: No Resource Manager are available.
de: Es ist kein Resource Manager verfügbar.
es: No hay ningún Resource Manager disponible.
fr: Aucun gestionnaire de ressources n'est disponible.

source: YARN did not return any token field.
de: YARN gab keine Token-Felder aus.
es: YARN no devolvió ningún campo de token.
fr: YARN n'a renvoyé aucun champ de jeton.

source: YARN RM returned a failed response: %s
de: YARN RM gab eine Fehlermeldung zurück: %s
es: RM de YARN devolvió una respuesta fallida: %s
fr: Le gestionnaire de ressources YARN a renvoyé une réponse d'échec : %s

source: No Spark History Server is available.
de: Kein Spark-Verlaufsserver verfügbar.
es: No hay ningún servidor de historial de Spark disponible.
fr: Aucun serveur d'historique de Spark n'est disponible.
