Repository: cloudera/hue
Catalog: desktop/libs/liboauth/src/liboauth/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, pt, pt_br

source: Invalid response from OAuth provider: %s
de: Ungültige Antwort von OAuth-Provider: %s
es: Respuesta del proveedor OAuth no válida: %s
fr: Réponse non valable du fournisseur OAuth : %s
ja: OAuth プロバイダーからの無効な応答：%s
pt: Resposta inválida do fornecedor OAuth: %s
pt_br: Resposta inválida de provedor OAuth: %s

source: The Consumer key of the twitter application.
de: Der Konsumentenschlüssel der Twitter-Anwendung.
es: La clave de consumidor de la aplicación de Twitter.
fr: Clé Consommateur de l'application Twitter.
ja: Twitter アプリケーションのコンシューマキーです。
pt: A chave do consumidor da aplicação Twitter.
pt_br: A chave de consumidor do aplicativo Twitter.

source: The Consumer key of the google application.
de: Der Konsumentenschlüssel der Google-Anwendung.
es: La clave de consumidor de la aplicación de Google.
fr: Clé Consommateur de l'application Google.
ja: Google アプリケーションのコンシューマキーです。
pt: A chave do consumidor da aplicação Google.
pt_br: A chave de consumidor do aplicativo Google.

source: The Consumer key of the facebook application.
de: Der Konsumentenschlüssel der Facebook-Anwendung.
es: La clave de consumidor de la aplicación de Facebook.
fr: Clé Consommateur de l'application Facebook.
ja: Facebook アプリケーションのコンシューマキーです。
pt: A chave do consumidor da aplicação Facebook.
pt_br: A chave de consumidor do aplicativo Facebook.

source: The Consumer key of the linkedin application.
de: Der Konsumentenschlüssel der LinkedIn-Anwendung.
es: La clave de consumidor de la aplicación de LinkedIn.
fr: Clé Consommateur de l'application LinkedIn.
ja: LinkedIn アプリケーションのコンシューマキーです。
pt: A chave do consumidor da aplicação LinkedIn.
pt_br: A chave de consumidor do aplicativo LinkedIn.

source: The Consumer secret of the twitter application.
de: Die geheime Angabe des Kunden für die Twitter-Anwendung.
es: El secreto de consumidor de la aplicación de Twitter.
fr: Secret Consommateur de l'application Twitter.
ja: Twitter アプリケーションのコンシューマシークレットです。
pt: O segredo do consumidor da aplicação Twitter.
pt_br: O segredo de consumidor do aplicativo Twitter.

source: The Consumer secret of the google application.
de: Die geheime Angabe des Kunden für die Google-Anwendung.
es: El secreto de consumidor de la aplicación de Google.
fr: Secret Consommateur de l'application Google.
ja: Google アプリケーションのコンシューマシークレットです。
pt: O segredo do consumidor da aplicação Google.
pt_br: O segredo de consumidor do aplicativo Google.

source: The Consumer secret of the facebook application.
de: Die geheime Angabe des Kunden für die Facebook-Anwendung.
es: El secreto de consumidor de la aplicación de Facebook.
fr: Secret Consommateur de l'application Facebook.
ja: Facebook アプリケーションのコンシューマシークレットです。
pt: O segredo do consumidor da aplicação Facebook.
pt_br: O segredo de consumidor do aplicativo Facebook.

source: The Consumer secret of the linkedin application.
de: Die geheime Angabe des Kunden für die LinkedIn-Anwendung.
es: El secreto de consumidor de la aplicación de LinkedIn.
fr: Secret Consommateur de l'application LinkedIn.
ja: LinkedIn アプリケーションのコンシューマシークレットです。
pt: O segredo do consumidor da aplicação LinkedIn.
pt_br: O segredo de consumidor do aplicativo LinkedIn.

source: The Twitter Request token URL.
de: Die Twitter-Anforderungstoken-URL.
es: La URL del token de la solicitud de Twitter.
fr: URL du jeton de la requête Twitter.
ja: Twitter 要求トークンの URL です。
pt: URL do token de pedido Twitter.
pt_br: A URL do token de solicitação do Twitter.

source: The Google Request token URL.
de: Die Google-Anforderungstoken-URL.
es: La URL del token de la solicitud de Google.
fr: URL du jeton de la requête Google.
ja: Google 要求トークンの URL です。
pt: URL do token de pedido Google.
pt_br: A URL do token de solicitação do Google.

source: The Facebook Request token URL.
de: Die Facebook-Anforderungstoken-URL.
es: La URL del token de la solicitud de Facebook.
fr: URL du jeton de la requête Facebook.
ja: Facebook 要求トークンの URL です。
pt: URL do token de pedido Facebook.
pt_br: A URL do token de solicitação do Facebook.

source: The Linkedin Request token URL.
de: Die LinkedIn-Anforderungstoken-URL.
es: La URL del token de la solicitud de LinkedIn.
fr: URL du jeton de la requête LinkedIn.
ja: LinkedIn 要求トークンの URL です。
pt: URL do token de pedido LinkedIn.
pt_br: A URL do token de solicitação do LinkedIn.

source: The Twitter Access token URL.
de: Die Twitter-Zugriffstoken-URL.
es: La URL del token de acceso a Twitter.
fr: URL du jeton d'accès Twitter.
ja: Twitter アクセストークンの URL です。
pt: URL do token de acesso Twitter.
pt_br: A URL do token de acesso do Twitter.

source: The Google Access token URL.
de: Die Google-Zugriffstoken-URL.
es: La URL del token de acceso a Google.
fr: URL du jeton d'accès Google.
ja: Google アクセストークンの URL です。
pt: URL do token de acesso Google.
pt_br: A URL do token de acesso do Google.

source: The Facebook Access token URL.
de: Die Facebook-Zugriffstoken-URL.
es: La URL del token de acceso a Facebook.
fr: URL du jeton d'accès Facebook.
ja: Facebook アクセストークンの URL です。
pt: URL do token de acesso Facebook.
pt_br: A URL do token de acesso do Facebook.

source: The Linkedin Access token URL.
de: Die LinkedIn-Zugriffstoken-URL.
es: La URL del token de acceso a LinkedIn.
fr: URL du jeton d'accès LinkedIn.
ja: LinkedIn アクセストークンの URL です。
pt: URL do token de acesso LinkedIn.
pt_br: A URL do token de acesso do LinkedIn.

source: The Twitter Authorize URL.
de: Die Twitter-Autorisierungs-URL.
es: La URL autorizada de Twitter.
fr: URL d'autorisation Twitter.
ja: Twitter 認証の URL です。
pt: URL de autorização do Twitter.
pt_br: A URL de autorização do Twitter.

source: The Google Authorize URL.
de: Die Google-Autorisierungs-URL.
es: La URL autorizada de Google.
fr: URL d'autorisation Google.
ja: Google 認証の URL です。
pt: URL de autorização do Google.
pt_br: A URL de autorização do Google.

source: The Facebook Authorize URL.
de: Die Facebook-Autorisierungs-URL.
es: La URL autorizada de Facebook.
fr: URL d'autorisation Facebook.
ja: Facebook 認証の URL です。
pt: URL de autorização do Facebook.
pt_br: A URL de autorização do Facebook.

source: The Linkedin Authorize URL.
de: Die LinkedIn-Autorisierungs-URL.
es: La URL autorizada de LinkedIn.
fr: URL d'autorisation LinkedIn.
ja: LinkedIn 認証の URL です。
pt: URL de autorização do LinkedIn.
pt_br: A URL de autorização do LinkedIn.

source: Comma-separated list of whitelisted domains.
de: Durch Kommas abgetrennte Liste mit Domänen auf der Whitelist.
es: Lista separada por comas de los dominios permitidos.
fr: Liste des domaines acceptés, séparés par des virgules.
ja: ホワイトリスト化されたドメインのカンマ区切りのリストです。
pt: Lista separada por vírgulas de domínios em lista de aprovação.
pt_br: Lista de domínios da lista de permissão separados por vírgula.

source: JSON formatted hash of username simplifications. Example: {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} converts "email@sub1.domain.com" to "email_S1"
de: JSON-formatiertes Hash mit vereinfachten Benutzernamen. Beispiel: {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} konvertiert "email@sub1.domain.com" zu "email_S1".
es: Hash con formato JSON de nombres de usuarios simplificados. Ejemplo: {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} transforma "email@sub1.domain.com" en "email_S1"
fr: Hachage au format JSON des simplifications de noms d'utilisateur. Exemple : {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} convertit "email@sub1.domain.com" en "email_S1"
ja: JSON 形式のハッシュによるユーザー名の簡略化。例：{"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} では、"email@sub1.domain.com" が "email_S1" に変換されます
pt: Hash formatada em JSON de simplificações de nomes de utilizador. Exemplo: {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} converte "email@sub1.domain.com" para "email_S1"
pt_br: Hash formatado JSON de simplificações do nome de usuário. Exemplo: {"@sub1.domain.com":"_S1", "@sub2.domain.com":"_S2"} converte "email@sub1.domain.com" para "email_S1"

source: Invalid request: %s
de: Ungültige Abfrage: %s
es: Consulta no válida: %s
fr: Requête non valide : %s
ja: 無効な要求：%s
pt: Pedido inválido: %s
pt_br: Solicitação inválida: %s

source: Hue - Sign up
de: Hue - Registrieren
es: Hue - Registrarse
fr: Hue - Inscription
ja: Hue - サインアップ
pt: Hue - Efectuar o registo
pt_br: Hue - Inscrever-se

source: Hue - Sign in
de: Hue - Anmelden
es: Hue - Iniciar sesión
fr: Hue - Connexion
ja: Hue - サインイン
pt: Hue - Iniciar sessão
pt_br: Hue - Assinar

source: Hue logo
es: Logotipo de Hue
fr: Logo Hue
ja: Hue ロゴ

source: Visit gethue.com
de: gethue.com besuchen
es: Visite gethue.com
fr: Visitez le site gethue.com
ja: gethue.com にアクセス
pt: Visite gethue.com
pt_br: Visite gethue.com

source: Fell asleep? Visit us on gethue.com instead!
de: Eingeschlafen? Besuchen Sie uns lieber auf gethue.com!
es: ¿Se ha dormido? ¡Visite gethue.com!
fr: Envie d'une petite sieste ? Visitez plutôt notre site à l'adresse gethue.com.
ja: 寝ていないでぜひ gethue.com にアクセスしてください。
pt: Deixou-se dormir? Visite-nos em gethue.com!
pt_br: Caiu no sono? Visite-nos em gethue.com!

source: Error!
de: Fehler!
fr: Erreur !
ja: エラーが発生しました。
pt: Erro!
pt_br: Erro!

source: Invalid username or password.
de: Benutzername oder Kennwort ungültig.
es: Nombre de usuario o contraseña no válido.
fr: Nom d'utilisateur ou mot de passe non valide.
ja: 無効なユーザー名またはパスワードです。
pt: Nome de utilizador ou palavra-passe inválido.
pt_br: Nome de usuário ou senha inválido.

source: This is your first time logging in.
de: Dies ist Ihre erste Anmeldung.
es: Es la primera vez que inicia sesión.
fr: Il s'agit de votre première connexion.
ja: これは初回のログインです。
pt: Esta é a primeira vez que inicia sessão.
pt_br: Este é seu primeiro login.

source: You will become Hue superuser.
de: Sie werden Hue-Superuser.
es: Se convertirá en un superusuario de Hue.
fr: Vous deviendrez un superutilisateur Hue.
ja: Hue スーパーユーザーになります。
pt: Irá transformar-se num super utilizador Hue.
pt_br: Você se tornará superusuário do Hue.

source: Sign Up via
de: Registrieren über
es: Registrarse mediante
fr: S'inscrire par
ja: サインアップ方法

source: Sign In via
de: Anmelden über
es: Iniciar sesión mediante
fr: Se connecter par
ja: サインイン方法

source: Google icon
de: Google-Symbol
es: Icono de Google
fr: Icône Google
ja: Google アイコン

source: Facebook icon
de: Facebook-Symbol
es: Icono de Facebook
fr: Icône Facebook
ja: Facebook アイコン

source: Linkedin icon
de: LinkedIn-Symbol
es: Icono de LinkedIn
fr: Icône LinkedIn
ja: Linkedin アイコン

source: Twitter icon
de: Twitter-Symbol
es: Icono de Twitter
fr: Icône Twitter
ja: Twitter アイコン

source: The oauth app is not configured with any provider.
de: Für die oauth-App wurde kein Provider konfiguriert.
es: La aplicación oauth no está configurada con ningún proveedor.
fr: L'application oauth n'est configurée auprès d'aucun fournisseur.
ja: どのプロバイダーでも、oauth アプリが設定されていません。
