Repository: cloudera/hue
Catalog: desktop/libs/libsentry/src/libsentry/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Failed to connect to Sentry server %s, and Sentry HA is not enabled.
de: Die Verbindung mit dem Sentry-Server %s konnte nicht hergestellt werden, und Sentry HA ist nicht aktiviert.
es: Error al conectar con el servidor Sentry %s; no se ha habilitado la HA de Sentry.
fr: Impossible de se connecter au serveur Sentry %s et la haute disponibilité Sentry n’est pas activée.
ja: Sentry サーバー %s への接続に失敗しましたため、Sentry HA は有効になりません。
ko: Sentry 서버 %s에 연결하지 못했으며, Sentry HA가 설정되지 않았습니다.
zh_cn: 无法连接到 Sentry 服务器 %s，并且 Sentry HA 未启用。

source: Failed to find an available Sentry server.
de: Es konnte kein verfügbarer Sentry-Server gefunden werden.
es: Error al buscar un servidor Sentry disponible.
fr: Impossible de trouver un serveur Sentry disponible.
ja: 利用可能な Sentry サーバーが見つかりませんでした。
ko: 사용할 수 있는 Sentry 서버를 찾지 못했습니다.
zh_cn: 找不到可用的 Sentry 服务器。

source: Encountered unexpected error in SentryApi.
de: Unerwarteter Fehler in SentryApi.
es: Se ha producido un error inesperado en la API de Sentry.
fr: Erreur inattendue rencontrée dans SentryApi.
ja: SentryApi で予期しないエラーが発生しました。
ko: SentryApi에서 예기치 않은 오류가 발생했습니다.
zh_cn: SentryApi 发生意外错误。

source: Hostname or IP of server.
de: Hostname oder IP des Servers.
es: Nombre de host o IP de servidor.
fr: Nom d'hôte ou IP de serveur.
ja: サーバーのホスト名または IP です。
ko: 서버의 호스트 이름 또는 IP입니다.
zh_cn: 服务器的主机名或 IP。

source: Port the sentry service is running on.
de: Port, auf dem der Sentry-Dienst ausgeführt wird.
es: Puerto en el que se ejecuta el servicio de Sentry.
fr: Port sur lequel le service Sentry est en cours d'exécution.
ja: Sentry サービスを実行しているポートです。
ko: Sentry 서비스가 실행 중인 포트입니다.
zh_cn: 正在其上运行 Sentry 服务的端口。

source: Sentry configuration directory, where sentry-site.xml is located.
de: Verzeichnis der Sentry-Konfiguration, in dem sich sentry-site.xml befindet.
es: Directorio de configuración de Sentry, donde está sentry-site.xml.
fr: Répertoire de configuration de Sentry, où se trouve le fichier sentry-site.xml.
ja: sentry-site.xml が格納されている Sentry 設定ディレクトリ。
ko: sentry-site.xml이 위치한 Sentry 구성 디렉토리입니다.
zh_cn: Sentry 配置目录，即 sentry-site.xml 的所在位置。

source: Number of seconds when the privilege list of a user is cached.
de: Anzahl von Sekunden, in denen die Berechtigungsliste eines Benutzers zwischengespeichert wird.
es: Tiempo en segundos durante el que se guarda en caché la lista de privilegios de un usuario.
fr: Nombre de secondes lorsque la liste des privilèges d’un utilisateur est cachée.
ja: ユーザーの権限リストをキャッシュする秒数です。
ko: 사용자의 권한 목록이 캐시되는 기간(초)입니다.
zh_cn: 缓存用户权限列表的秒数。

source: Cannot create a Sentry client without server hostname and port.
de: Ohne Serverhostname und Port kann kein Sentry-Client erstellt werden.
es: No se puede crear un cliente de Sentry sin el nombre de host y el puerto del servidor.
fr: Impossible de créer un client Sentry sans le nom d’hôte et le port du serveur.
ja: サーバーのホスト名とポートが指定されていないため、Sentry クライアントを作成できません。
ko: 서버 호스트 이름 및 포트 없이 Sentry 클라이언트를 생성할 수 없습니다.
zh_cn: 未提供服务器主机名和端口，无法创建 Sentry 客户端。

source: Encountered unexpected error while trying to find available Sentry client: %s
de: Unerwarteter Fehler beim Suchen nach einem verfügbaren Sentry-Client: %s
es: Se ha producido un error inesperado al buscar un cliente de Sentry disponible: %s
fr: Erreur inattendue rencontrée lors de la recherche d'un client Sentry disponible : %s
ja: 利用可能な Sentry クライアントを探しているときに予期しないエラーが発生しました：%s
ko: 사용할 수 있는 Sentry 클라이언트를 찾는 중 예기치 않은 오류 발생: %s
zh_cn: 尝试查找可用的 Sentry 客户端时发生意外错误：%s

source: No Sentry servers are configured.
de: Es ist kein Sentry-Server konfiguriert.
es: No se han configurado servidores Sentry.
fr: Aucun serveur Sentry n'est configuré.
ja: Sentry サーバーが設定されていません。
ko: 구성된 Sentry 서버가 없습니다.
zh_cn: 没有配置 Sentry 服务器。

source: Error in retrieving Sentry server properties.
de: Fehler beim Abrufen der Sentry-Servereigenschaften.
es: Error al recuperar las propiedades del servidor Sentry.
fr: Erreur lors de la récupération des propriétés du serveur Sentry.
ja: Sentry サーバープロパティを取得しているときにエラーが発生しました。
ko: Sentry 서버 속성을 검색하는 중 오류가 발생했습니다.
zh_cn: 检索 Sentry 服务器属性时出错。
