{"body":"<div><div>\n        <div id=\"title\">\n                        <h1 class=\"hue-doc-title-hive\">Data Connectors in Hive</h1>\n        </div>\n\n        <!--<div id=\"toc\" class=\"content prepend-top\">\n            <h1>Table of Contents</h1>\n            $replacement.render(\"toc\")\n        </div>-->\n\n        <div id=\"src-177049669\">\n    <div id=\"src-177049669_safe-id-RGF0YUNvbm5lY3RvcnNpbkhpdmUtV2hhdGlzYURhdGFjb25uZWN0b3I_\">\n        <h2><span>What is a Data connector?</span></h2>\n            <p style=\"margin-left:30px;\">\n    Data connectors (referred to as \"connector\" in Hive Query Language) are top level objects in Hive where users can define a set of properties required to be able to connect to a datasource from hive. So a connector has a type (closed enumerated set) that allows Hive to determine the driver class (for JDBC) and other URL params, a URL and a set of properties that could include the default credentials for the remote datasource. Once defined, users can use the same connector object to map multiple databases from the remote datasource to local hive metastore.            </p>\n                <p style=\"margin-left:30px;\">\n                </p>\n                <p style=\"margin-left:30px;\">\n    With <a class=\"hue-doc-external-link\" href=\"https://cwiki.apache.org/confluence/display/Hive/JDBC+Storage+Handler\" target=\"_blank\">JDBC Storage Handlers</a>, users define a table in hive metastore for which data resides in a remote JDBC datastore. This hive table's metadata is persisted locally in hive metastore's backend. When Hiveserver2 runs a query against this table, data is retrieved from the remote JDBC table. While this is very powerful in itself, it has limitations.            </p>\n    <ul><li>            <p>\n    Each remote table in remote datasource has to be individually mapped to a local hive table. It becomes tedious if you have to map an entire database of many tables.            </p>\n    </li><li>            <p>\n    Any new tables in the remote datasource are not automatically visible and will need to be manually mapped in hive.            </p>\n    </li><li>            <p>\n    The metadata for the mapped table is static. It does not track changes to the remote table. If remote table has changed (added columns or dropped columns), the mapped hive table has to be dropped and re-created. This management compounds when one has constantly changing tables.            </p>\n    </li></ul>            <p>\n                </p>\n                <p style=\"margin-left:30px;\">\n    Data connectors allow users to map a database/schema in the remote datasource to a Hive database. Such databases are referred to as REMOTE databases in hive.            </p>\n    <pre>       CREATE REMOTE DATABASE postgres_db1 USING &lt;connectorName&gt; WITH DBPROPERTIES ('connector.remoteDbName'='db1');</pre><ul><li>            <p>\n    All the tables within a mapped database (<i>db1</i>) are automatically visible from Hive. The metadata for these tables are not persisted in Hive metastore's backend. They are retrieved at runtime via a live connector.            </p>\n    </li><li>            <p>\n    All future tables will automatically be visible in Hive.            </p>\n    </li><li>            <p>\n    The columns and their datatypes are mapped to a compatible hive datatype at runtime as well. So any metadata changes to tables in the remote datasource are immediately visible in hive.            </p>\n    </li><li>            <p>\n    The same connector can be used to map another database to a hive database. All the connection information is shared between these REMOTE databases.            </p>\n    </li></ul>    </div>\n    <div id=\"src-177049669_safe-id-RGF0YUNvbm5lY3RvcnNpbkhpdmUtSG93ZG9JdXNlaXQ_\">\n        <h2><span>How do I use it?</span></h2>\n<ol><li>            <p>\n    Create a connector first.            </p>\n    <pre>    CREATE CONNECTOR pg_local TYPE 'postgres' URL 'jdbc:<a class=\"hue-doc-external-link\" href=\"postgresql://localhost:5432\" target=\"_blank\">postgresql://localhost:5432</a>' WITH DCPROPERTIES (\"hive.sql.dbcp.username\"=\"postgres\", \"hive.sql.dbcp.password\"=\"postgres\");<br><br></pre></li><li>            <p>\n    Create a database of type REMOTE in hive using the connector from Step1. This maps a remote database named \"<tt>hive_hms_testing</tt>\" to a hive database named \"<i><tt>pg_hive_testing</tt></i>\" in hive.            </p>\n    </li></ol><pre>         CREATE REMOTE DATABASE pg_hive_testing USING pg_local WITH DBPROPERTIES (\"connector.remoteDbName\"=\"hive_hms_testing\");<br><br>         // USING keystore instead of cleartext passwords in DCPROPERTIES<br>         CREATE CONNECTOR pg_local_ks TYPE 'postgres' URL 'jdbc:<a class=\"hue-doc-external-link\" href=\"postgresql://localhost:5432/hive_hms_testing\" target=\"_blank\">postgresql://localhost:5432/hive_hms_testing</a>' WITH DCPROPERTIES(\"hive.sql.dbcp.username\"=\"postgres\",\"hive.sql.dbcp.password.keystore\"=\"jceks://app/local/hive/secrets.jceks\" \"hive.sql.dbcp.password.key\"=\"postgres.credential\");<br>         CREATE REMOTE DATABASE pg_ks_local USING pg_local_ks(\"connector.remoteDbName\"=\"hive_hms_testing\");<br>   <br>   3. Use the tables in REMOTE database much like the JDBC-storagehandler based tables in hive. One big difference is that the metadata for these tables are never persisted in hive. Currently, create/alter/drop table DDLs are not supported in REMOTE databases. <br><br>         USE pg_hive_testing;<br>         SHOW TABLES;<br>         DESCRIBE [formatted] &lt;tablename&gt;;<br>         SELECT &lt;col1&gt; from &lt;tablename&gt; where &lt;filter1&gt; and &lt;filter2&gt;;</pre>    </div>\n        </div>\n    </div></div>","title":"Data Connectors in Hive"}