{"body":"<div><div>\n        <div id=\"title\">\n                        <h1 class=\"hue-doc-title-hive\">RCFile</h1>\n        </div>\n\n        <!--<div id=\"toc\" class=\"content prepend-top\">\n            <h1>Table of Contents</h1>\n            $replacement.render(\"toc\")\n        </div>-->\n\n        <div id=\"src-58851803\">\n            <p>\n    RCFile (Record Columnar File) is a data placement structure designed for MapReduce-based data warehouse systems. Hive added the RCFile format in version 0.6.0.            </p>\n                <p>\n    RCFile stores table data in a flat file consisting of binary key/value pairs. It first partitions rows horizontally into row splits, and then it vertically partitions each row split in a columnar way. RCFile stores the metadata of a row split as the key part of a record, and all the data of a row split as the value part.            </p>\n                <p>\n    RCFile combines the advantages of both row-store and column-store to satisfy the need for fast data loading and query processing, efficient use of storage space, and adaptability to highly dynamic workload patterns.            </p>\n    <ul><li>            <p>\n    As row-store, RCFile guarantees that data in the same row are located in the same node.            </p>\n    </li><li>            <p>\n    As column-store, RCFile can exploit column-wise data compression and skip unnecessary column reads.            </p>\n    </li></ul>            <p>\n    A shell utility is available for reading RCFile data and metadata: see <a class=\"hue-doc-external-link\" href=\"https://cwiki.apache.org/confluence/display/Hive/RCFileCat\" target=\"_blank\">RCFileCat</a>.            </p>\n                <p>\n    For details about the RCFile format, see:            </p>\n    <ul><li>            <p>\n    Javadoc for <a class=\"hue-doc-external-link\" href=\"http://hive.apache.org/javadocs/r1.0.1/api/org/apache/hadoop/hive/ql/io/RCFile.html\" target=\"_blank\">RCFile.java</a>            </p>\n    </li><li>            <p>\n    the 2011 ICDE conference paper \"<a class=\"hue-doc-external-link\" href=\"http://www.cse.ohio-state.edu/hpcs/WWW/HTML/publications/papers/TR-11-4.pdf\" target=\"_blank\">RCFile: A Fast and Space-efficient Data Placement Structure in MapReduce-based Warehouse Systems</a>\" by Yongqiang He, Rubao Lee, Yin Huai, Zheng Shao, Namit Jain, Xiaodong Zhang, and Zhiwei Xu.            </p>\n    </li></ul>            <p>\n                </p>\n            </div>\n    </div></div>","title":"RCFile"}