{"body":"<div><div>\n        <div id=\"title\">\n                        <h1 class=\"hue-doc-title-hive\">Hive HPL/SQL</h1>\n        </div>\n\n        <!--<div id=\"toc\" class=\"content prepend-top\">\n            <h1>Table of Contents</h1>\n            $replacement.render(\"toc\")\n        </div>-->\n\n        <div id=\"src-59690156\">\n            <p>\n    Hive Hybrid Procedural SQL On Hadoop (HPL/SQL) is a tool that implements procedural SQL for Hive. It is available in Hive 2.0.0 (<a class=\"hue-doc-external-link\" href=\"https://issues.apache.org/jira/browse/HIVE-11055\" target=\"_blank\">HIVE-11055</a>).            </p>\n                <p>\n    <i>HPL/SQL is an open source tool (Apache License 2.0) that implements procedural SQL language for Apache Hive, SparkSQL, Impala as well as any other SQL-on-Hadoop implementation, any NoSQL and any RDBMS.</i>            </p>\n                <p>\n    <i>HPL/SQL is a hybrid and heterogeneous language that understands syntaxes and semantics of almost any existing procedural SQL dialect, and you can use with any database, for example, running existing Oracle PL/SQL code on Apache Hive and Microsoft SQL Server, or running Transact-SQL on Oracle, Cloudera Impala or Amazon Redshift.</i>            </p>\n                <p>\n    <i>HPL/SQL language is compatible to a large extent with Oracle PL/SQL, ANSI/ISO SQL/PSM (IBM DB2, MySQL, Teradata i.e), PostgreSQL PL/pgSQL (Netezza), Transact-SQL (Microsoft SQL Server and Sybase) that allows you leveraging existing SQL/DWH skills and familiar approach to implement data warehouse solutions on Hadoop. It also facilitates migration of existing business logic to Hadoop.</i>            </p>\n                <p>\n    <i>HPL/SQL is an efficient way to implement ETL processes in Hadoop.</i>            </p>\n                <p>\n    HPL/SQL language is compatible to a large extent with Oracle PL/SQL, ANSI/ISO SQL/PSM (IBM DB2, MySQL, Teradata), PostgreSQL PL/pgSQL (PostgreSQL, Netezza) and Transact-SQL (Microsoft SQL Server and Sybase) that facilitates migration of existing business logic to Hadoop.            </p>\n                <p>\n    See <a class=\"hue-doc-external-link\" href=\"http://www.hplsql.org/doc\" target=\"_blank\">HPL/SQL Reference</a> for documentation.            </p>\n                <p>\n                </p>\n            </div>\n    </div></div>","title":"Hive HPL/SQL"}