Repository: cloudera/hue
Catalog: apps/sqoop/src/sqoop/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja

source: The sqoop server URL.
de: Die Sqoop-Server-URL.
es: La URL de Sqoop Server.
fr: URL du serveur sqoop.
ja: Sqoop サーバーの URL です。

source: Could not get connectors.
de: Konnektoren konnten nicht abgerufen werden.
es: No se han podido obtener los conectores.
fr: Impossible d'obtenir des connecteurs.
ja: 接続を取得できませんでした。

source: GET request required.
de: Eine GET-Anforderung ist erforderlich.
es: Se necesita una solicitud GET.
fr: Requête GET requise.
ja: GET 要求が必要です。

source: Could not get connector.
de: Konnektor konnte nicht abgerufen werden.
es: No se ha podido obtener el conector.
fr: Impossible d'obtenir un connecteur.
ja: コネクタを取得できませんでした。

source: Could not get link.
de: Link konnte nicht abgerufen werden.
es: No se ha podido obtener el enlace.
fr: Impossible d'obtenir un lien.
ja: リンクを取得できませんでした。

source: Could not get job.
de: Job konnte nicht abgerufen werden.
es: No se ha podido obtener el job.
fr: Impossible d'obtenir un job.
ja: ジョブを取得できませんでした。

source: Could not get submission.
de: Übermittlung konnte nicht abgerufen werden.
es: No se ha podido obtener el envío.
fr: Impossible d'obtenir un envoi.
ja: サブミッションを取得できませんでした。

source: Could not get driver.
de: Treiber konnte nicht abgerufen werden.
es: No se ha podido conseguir el controlador.
fr: Impossible d'obtenir un pilote.
ja: ドライバを取得できませんでした。

source: Could not connect to sqoop server. %s (%s)
de: Verbindung mit Scoop-Server konnte nicht hergestellt werden. %s (%s)
es: No se ha podido conectar a Sqoop Server. %s (%s)
fr: Impossible de se connecter au serveur sqoop. %s (%s)
ja: Soop サーバーに接続できませんでした。%s（%s）

source: Could not get jobs.
de: Jobs konnten nicht abgerufen werden.
es: No se han podido obtener los jobs.
fr: Impossible d'obtenir des jobs.
ja: ジョブを取得できませんでした。

source: POST request required.
de: Eine POST-Anforderung ist erforderlich.
es: Se necesita una solicitud POST.
fr: Requête POST requise.
ja: POST 要求が必要です。

source: Error saving job
de: Fehler beim Speichern des Jobs
es: Error al guardar el job
fr: Erreur lors de l'enregistrement du job
ja: ジョブを保存中のエラー

source: Could not create job.
de: Der Job konnte nicht erstellt werden.
es: No se ha podido crear el job.
fr: Impossible de créer un job.
ja: ジョブを作成できませんでした。

source: Could not update job.
de: Der Job konnte nicht aktualisiert werden.
es: No se ha podido actualizar el job.
fr: Impossible de mettre à jour le job.
ja: ジョブを更新できませんでした。

source: GET or POST request required.
de: Eine GET- oder POST-Anforderung ist erforderlich.
es: Se necesita una solicitud GET o POST.
fr: Requête GET ou POST requise.
ja: GET または POST 要求が必要です。

source: Could not clone job.
de: Der Job konnte nicht geklont werden.
es: No se ha podido clonar el job.
fr: Impossible de cloner le job.
ja: ジョブを複製できませんでした。

source: Could not delete job.
de: Der Job konnte nicht gelöscht werden.
es: No se ha podido eliminar el job.
fr: Impossible de supprimer un job.
ja: ジョブを削除できませんでした。

source: Could not start job.
de: Der Job konnte nicht gestartet werden.
es: No se ha podido iniciar el job.
fr: Impossible de lancer le job.
ja: ジョブを開始できませんでした。

source: Could not stop job.
de: Der Job konnte nicht gestoppt werden.
es: No se ha podido detener el job.
fr: Impossible d'arrêter le job.
ja: ジョブを停止できませんでした。

source: Could not get job status.
de: Der Jobstatus konnte nicht abgerufen werden.
es: No se ha podido obtener el estado del job.
fr: Impossible d'obtenir un statut de job.
ja: ジョブのステータスを取得できませんでした。

source: Could not get links.
de: Links konnten nicht abgerufen werden.
es: No se han podido obtener los enlaces.
fr: Impossible d'obtenir des liens.
ja: リンクを取得できませんでした。

source: Error saving link
de: Fehler beim Speichern des Links
es: Error al guardar el enlace
fr: Erreur lors de l'enregistrement du lien
ja: リンクを保存中のエラー

source: Could not create link.
de: Der Link konnte nicht erstellt werden.
es: No se ha podido crear el enlace.
fr: Impossible de créer un lien.
ja: リンクを作成できませんでした。

source: Could not update link.
de: Der Link konnte nicht aktualisiert werden.
es: No se ha podido actualizar el enlace.
fr: Impossible de mettre à jour le lien.
ja: リンクを更新できませんでした。

source: Could not clone link.
de: Der Link konnte nicht geklont werden.
es: No se ha podido clonar el enlace.
fr: Impossible de cloner le lien.
ja: リンクを複製できませんでした。

source: Could not delete link.
de: Der Link konnte nicht gelöscht werden.
es: No se ha podido eliminar el enlace.
fr: Impossible de supprimer le lien.
ja: リンクを削除できませんでした。

source: Could not get submissions.
de: Einsendungen konnten nicht abgerufen werden.
es: No se han podido obtener los envíos.
fr: Impossible d'obtenir des envois.
ja: サブミッションを取得できませんでした。

source: Create a new job
de: Einen neuen Job erstellen
es: Crear un nuevo job
fr: Créer un nouveau job
ja: 新規ジョブを作成

source: New job
de: Neuer Job
es: Nuevo job
fr: Nouveau job
ja: 新規ジョブ

source: Manage links
de: Links verwalten
es: Gestionar enlaces
fr: Gérer les liens
ja: リンクを管理

source: Sqoop Jobs
es: Jobs de Sqoop
fr: Jobs Sqoop
ja: Sqoop ジョブ

source: Search for job name or content
de: Nach Jobnamen oder -inhalt suchen
es: Buscar el nombre o el contenido del job
fr: Rechercher un nom ou un contenu de job
ja: ジョブ名または内容を検索

source: Create a new link
de: Einen neuen Link erstellen
es: Crear un nuevo enlace
fr: Créer un lien
ja: 新しいリンクを作成

source: New link
de: Neuer Link
es: Nuevo enlace
fr: Nouveau lien
ja: 新しいリンク

source: Manage jobs
de: Jobs verwalten
es: Gestionar jobs
fr: Gérer les jobs
ja: ジョブを管理

source: Sqoop Links
es: Enlaces de Sqoop
fr: Liens Sqoop
ja: Sqoop リンク

source: Search for link name or content
de: Nach Linknamen oder -inhalt suchen
es: Buscar el nombre o el contenido del enlace
fr: Rechercher un nom ou un contenu de lien
ja: リンク名または内容を検索

source: Back to jobs list
de: Zurück zur Jobliste
es: Volver a la lista de jobs
fr: Retour à la liste des jobs
ja: ジョブリストに戻る

source: New Job
de: Neuer Job
es: Nuevo job
fr: Nouveau job
ja: 新規ジョブ

source: New Connection
de: Neue Verbindung
es: Nueva conexión
fr: Nouvelle connexion
ja: 新規接続

source: Sqoop error
de: Sqoop-Fehler
es: Error de Sqoop
fr: Erreur Sqoop
ja: Sqoop エラー

source: Click to edit
de: Zum Bearbeiten klicken
es: Haga clic para editar
fr: Cliquer pour modifier
ja: クリックして編集

source: Last run:
de: Letzte Ausführung:
es: Última ejecución:
fr: Dernière exécution :
ja: 前回の実行：

source: There are currently no jobs.
de: Derzeit sind keine Jobs vorhanden.
es: Actualmente no hay ningún job.
fr: Il n'existe actuellement aucun job.
ja: 現在、ジョブはありません。

source: Click here to add one.
de: Hier klicken, um einen hinzuzufügen.
es: Haga clic aquí para agregar uno.
fr: Cliquez ici pour en ajouter un.
ja: 追加するにはここをクリックします。

source: Run the job
de: Job ausführen
es: Ejecutar el job
fr: Exécuter le job
ja: ジョブを実行

source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
ja: 実行

source: Stop the job
de: Job stoppen
es: Detener el job
fr: Arrêter le job
ja: ジョブを停止

source: Stop
de: Anhalten
es: Detener
fr: Arrêter
ja: 停止

source: Copy the job
de: Job kopieren
es: Copiar el job
fr: Copier le job
ja: ジョブをコピー

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー

source: Delete the job
de: Job löschen
es: Eliminar el job
fr: Supprimer le job
ja: ジョブを削除

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除

source: Submissions
de: Übermittlungen
es: Envíos
fr: Envois
ja: サブミッション

source: Browse output directory
de: Ausgangsverzeichnis durchsuchen
es: Explorar directorio de salida
fr: Parcourir le répertoire de sortie
ja: 出力ディレクトリを参照

source: Output directory
de: Ausgangsverzeichnis
es: Directorio de salida
fr: Répertoire de sortie
ja: 出力ディレクトリ

source: Browse input directory
de: Eingangsverzeichnis durchsuchen
es: Explorar directorio de entrada
fr: Parcourir le répertoire d'entrée
ja: 入力ディレクトリを参照

source: Input directory
de: Eingangsverzeichnis
es: Directorio de entrada
fr: Répertoire d'entrée
ja: 入力ディレクトリ

source: Logs
de: Protokolle
es: Registros
fr: Journaux
ja: ログ

source: Last status
de: Letzter Status
es: Último estado
fr: Dernier statut
ja: 前回のステータス

source: Back
de: Zurück
es: Volver
fr: Précédent
ja: 戻る

source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次へ

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存

source: Save and run
de: Speichern und ausführen
es: Guardar y ejecutar
fr: Enregistrer et exécuter
ja: 保存して実行

source: There are currently no links.
de: Derzeit sind keine Links vorhanden.
es: Actualmente no hay ningún enlace.
fr: Il n'existe actuellement aucun lien.
ja: 現在、リンクはありません。

source: Name
es: Nombre
fr: Nom
ja: 名前

source: Connector
de: Konnektor
es: Conector
fr: Connecteur
ja: コネクタ

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル

source: Choose a folder
de: Einen Ordner auswählen
es: Seleccionar una carpeta
fr: Choisir un dossier
ja: フォルダを選択

source: Are you sure you'd like to delete this job?
de: Soll dieser Job wirklich gelöscht werden?
es: ¿Está seguro de que desea eliminar este job?
fr: Voulez-vous vraiment supprimer ce job ?
ja: このジョブを削除してもよろしいですか？

source: No
de: Nein
fr: Non
ja: いいえ

source: Yes, delete it
de: Ja, löschen
es: Sí, eliminarlo
fr: Oui, supprimer cet élément
ja: はい、削除します

source: Are you sure you'd like to delete this link?
de: Soll dieser Link wirklich gelöscht werden?
es: ¿Está seguro de que desea eliminar este enlace?
fr: Voulez-vous vraiment supprimer ce lien ?
ja: このリンクを削除してもよろしいですか？

source: server at
de: Server bei
es: servidor en
fr: serveur à
ja: 次のサーバー

source: from
de: von
es: de
fr: de
ja: 元

source: to
de: bis
es: a
fr: vers
ja: 先

source: Job type
de: Jobtyp
es: Tipo de job
fr: Type de job
ja: ジョブタイプ

source: Import from a Database to Hadoop
de: Aus einer Datenbank in Hadoop importieren
es: Importar desde una base de datos a Hadoop
fr: Importer à partir d'une base de données vers Hadoop
ja: データベースから Hadoop にインポート

source: Import
de: Importieren
es: Importar
fr: Importer
ja: インポート

source: Import from Hadoop to a Database
de: Aus Hadoop in eine Datenbank importieren
es: Importar desde Hadoop a una base de datos
fr: Importer depuis Hadoop vers une base de données
ja: Hadoop からデータベースにインポート

source: Export
de: Exportieren
es: Exportar
fr: Exporter
ja: エクスポート

source: Connection
de: Verbindung
es: Conexión
fr: Connexion
ja: 接続

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集

source: Add a new link
de: Neuen Link hinzufügen
es: Añador un nuevo enlace
fr: Ajouter un nouveau lien
ja: 新しいリンクを追加

source: Property name
de: Name der Eigenschaft
es: Nombre de propiedad
fr: Nom de la propriété
ja: プロパティ名

source: Value
de: Wert
es: Valor
fr: Valeur
ja: 値

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
ja: 追加

source: Choose...
de: Auswählen...
es: Elegir...
fr: Choisir...
ja: 選択...

source: True
de: Wahr
fr: Vrai

source: False
de: Falsch
fr: Faux

source: Step 1: From
de: Schritt 1: Von
es: Paso 1: de
fr: Etape 1 : De
ja: 手順 1：元

source: Step 1: To
de: Schritt 1: Bis
es: Paso 1: a
fr: Etape 1 : A
ja: 手順 1：先

source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース

source: Step 2: To
de: Schritt 2: Bis
es: Paso 2: a
fr: Etape 2 : A
ja: 手順 2：先

source: Step 2: From
de: Schritt 2: Von
es: Paso 2: de
fr: Etape 2 : De
ja: 手順 2：元

source: Step 1: Type
de: Schritt 1: Typ
es: Paso 1: tipo
fr: Etape 1 : Type
ja: 手順 1：タイプ

source: Step 3: To
de: Schritt 3: Bis
es: Paso 3: a
fr: Etape 3 : A
ja: 手順 3：先

source: Please specify a link.
de: Geben Sie einen Link an.
es: Especifique un enlace.
fr: Indiquez un lien.
ja: リンクを指定してください。

source: Cannot connect to sqoop server.
de: Verbindung zu Scoop-Server nicht möglich.
es: No se puede acceder a Sqoop Server.
fr: Impossible d'établir une connexion au serveur sqoop.
ja: Sqoop サーバーに接続できません。

source: The job is starting...
de: Der Job beginnt...
es: El job se está iniciando...
fr: Le job est lancé...
ja: ジョブを開始しています...

source: Started job.
de: Gestarteter Job.
es: Job iniciado.
fr: Job lancé.
ja: ジョブを開始しました。

source: Error:
de: Fehler:
fr: Erreur :
ja: エラー：

source: Stopped job.
de: Gestoppter Job.
es: Job detenido.
fr: Job arrêté.
ja: ジョブを停止しました。

source: Could not load node.
de: Knoten konnte nicht geladen werden.
es: No se ha podido cargar el nodo.
fr: Impossible de charger un nœud.
ja: ノードをロードできませんでした。

source: Did you know? You can use the tab key or CTRL + Space to autocomplete file and folder names
de: Wussten Sie das? Sie können Datei- und Ordnernamen mit der Tabulatortaste oder mit STRG + Leerzeichen automatisch vervollständigen.
es: ¿Sabía que puede usar el tabulador o CTRL + Espacio para autocompletar los nombres de archivo y de carpeta?
fr: Le saviez-vous ? Vous pouvez utiliser la touche Tabulation ou la combinaison de touches CTRL + Espace pour renseigner automatiquement les noms de dossier et de fichier
ja: ご存知ですか？ Tab キーを使用するか、CTRL キーを押しながら Space キーを押して、ファイル名やフォルダ名のオートコンプリートが可能です

source: There was a problem with the server. Look at the Sqoop2 server logs for more details.
de: Mit dem Server ist ein Problem aufgetreten. Die Sqoop2-Serverprotokolle enthalten weitere Informationen.
es: Se ha producido un problema con el servidor. Consulte los registros del servidor Sqoop2 para obtener más información.
fr: Un problème est survenu avec le serveur. Consultez les journaux du serveur Sqoop2 pour plus de détails.
ja: サーバーで問題が発生しました。Sqoop2 サーバーログで詳細を確認してください。

source: Unknown error.
de: Unbekannter Fehler.
es: Error desconocido.
fr: Erreur inconnue.
ja: 不明なエラーです。

source: Watch out! This path currently does not exist.
de: Vorsicht! Dieser Pfad ist derzeit nicht vorhanden.
es: Atención. Esta ruta no existe actualmente.
fr: Attention ! Ce chemin d'accès n'existe pas actuellement.
ja: 注意してください。このパスは現在存在しません。

source: Untitled Job
de: Job ohne Titel
es: Job sin título
fr: Job sans titre
ja: 無題のジョブ

source: Actions
de: Aktionen
es: Acciones
ja: アクション
