Repository: cloudera/hue
Catalog: apps/hbase/src/hbase/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja

source: HBase Thrift 1 server cannot be contacted: %s
de: HBase Thrift 1-Server konnte nicht kontaktiert werden: %s
es: No se puede contactar con el servidor HBase Thrift 1: %s
fr: Impossible de contacter le serveur HBase Thrift 1 : %s
ja: HBase Thrift 1 サーバーに接続できません：%s

source: Api Error: %s
de: API-Fehler: %s
es: Error de Api: %s
fr: Erreur d'API : %s
ja: API エラー：%s

source: Cluster configuration %s isn't formatted correctly.
de: Cluster-Konfiguration %s ist nicht korrekt formatiert.
es: La configuración del clúster %s no tiene el formato correcto.
fr: Le format de la configuration du cluster %s n'est pas correct.
ja: クラスタ設定 %s が正しくフォーマットされていません。

source: Cluster by the name of %s does not exist in configuration.
de: Cluster mit Namen %s ist in der Konfiguration nicht vorhanden.
es: El clúster con el nombre %s no existe en la configuración.
fr: Le cluster nommé %s n'existe pas dans la configuration.
ja: %s という名前のクラスタが設定に存在しません。

source: The kerberos principal name is missing from the hbase-site.xml configuration file.
de: Der Kerberos-Principal-Name fehlt in der Konfigurationsdatei hbase-site.xml.
es: Falta el nombre principal de Kerberos del archivo de configuración hbase-site.xml.
fr: Le nom principal kerberos est manquant dans le fichier de configuration hbase-site.xml.
ja: Kerberos プリンシパル名が hbase-site.xml 設定ファイルに見つかりません。

source: Comma-separated list of HBase Thrift servers for clusters in the format of '(name|host:port)'. Use full hostname with security.Prefix hostname with https:// if using SSL and http mode with impersonation.
de: Durch Kommas abgetrennte Liste von HBase Thrift-Servern für Cluster im Format "(name|host:port)". Verwenden Sie den vollständigen Hostnamen mit Sicherheit. Stellen Sie dem Hostnamen https:// voran, wenn Sie SSL und den HTTP-Modus mit Identitätswechsel verwenden.
es: Lista separada por comas de los servidores HBase Thrift para clústeres con formato '(nombre|host:puerto)'. Use el nombre completo del host con seguridad. Nombre de host con prefijo con https:// si utiliza SSL y el modo http con suplantación.
fr: Liste de valeurs séparées par des virgules de serveurs Thrift HBase pour les clusters au format "(name|host:port)". Utilisez le nom d'hôte complet avec la sécurité. Préfixez le nom d'hôte avec https:// si vous utilisez SSL et le mode http avec imitation.
ja: クラスターを構成する HBase Thrift サーバーを、(name|host:port) の形式で指定したカンマ区切りリストです。セキュリティで保護される完全なホスト名を使用します。つまり、権限の借用で SSL と http モードを使用する場合、ホスト名の前に https:// を指定します。

source: Hard limit of rows or columns per row fetched before truncating.
de: Feste Begrenzung der Zeilen oder Spalten pro vor der Kürzung abgerufener Zeile.
es: Límite fijo de filas o columnas por fila obtenido antes de truncar.
fr: Limite stricte de lignes ou de colonnes par ligne extraite avant le tronquage.
ja: 切り詰めの実行前に取得された行または行ごとの列のハード制限です。

source: 'buffered' is the default of the HBase Thrift Server and supports security. 'framed' can be used to chunk up responses, which is useful when used in conjunction with the nonblocking server in Thrift.
de: "buffered" ist der Standard des HBase Thrift Server und unterstützt Sicherheit. "framed" kann verwendet werden, um Antworten zu teilen, was in Verbindung mit dem nicht sperrenden Server in Thrift zu empfehlen ist.
es: 'buffered' es el valor predeterminado del servidor HBase Thrift y es compatible con seguridad. 'framed' se puede utilizar para fragmentar respuestas, lo que resulta útil cuando se utiliza con el servidor sin bloqueo en Thrift.
fr: "buffered" est la valeur par défaut du serveur Thrift HBase et prend en charge la sécurité. La valeur "framed", qui peut servir à tronquer des réponses, s'avère utile lorsqu'elle est utilisée conjointement avec le serveur non bloquant dans Thrift.
ja: HBase Thrift サーバーのデフォルトである 'buffered' はセキュリティをサポートします。'framed' を使用する応答を集めることができます。これは、 Thrift でノンブロッキングサーバーと組み合わせて使用する場合に役に立ちます。

source: HBase configuration directory, where hbase-site.xml is located.
de: Verzeichnis der Hive-Konfiguration, in dem sich hive-site.xml befindet.
es: Directorio de configuración de HBase, donde está hbase-site.xml.
fr: Répertoire de configuration HBase, contenant le fichier hbase-site.xml.
ja: hbase-site.xml を保存する HBase 設定ディレクトリ。

source: Force Hue to use Http Thrift mode with doas impersonation, regarless of hbase-site.xml properties.
de: Zwingt Hue, ungeachtet der Eigenschaften in hbase-site.xml den HTTP-Thrift-Modus mit doAs-Identitätswechsel zu verwenden.
es: Fuerce a Hue para que utilice el modo Http Thrift con suplantación "doAs", independientemente de las propiedades de hbase-site.xml.
fr: Forcez Hue à utiliser le mode Thrift Http avec une imitation faire comme si, quelles que soient les propriétés de hbase-site.xml.
ja: hbase-site.xml プロパティにかかわらず、権限の借用と同様に、Http Thrift モードの使用を Hue に強制します。

source: A POST request is required.
de: Eine POST-Anforderung ist erforderlich.
es: Se necesita una solicitud POST.
fr: Requête POST requise.
ja: POST 要求が必要です。

source: HBase icon
de: HBase-Symbol
es: Icono de HBase
fr: Icône HBase
ja: HBase アイコン

source: HBase Browser
fr: Navigateur HBase

source: Refresh Row
de: Zeile aktualisieren
es: Actualizar fila
fr: Actualiser la ligne
ja: 行を更新

source: Delete Row
de: Zeile löschen
es: Eliminar fila
fr: Supprimer la ligne
ja: 行を削除

source: Toggle Collapse Selected
de: Umschalten von Ausblenden ausgewählt
es: Alternar Contraer la selección
fr: Afficher ou masquer la réduction sélectionnée
ja: 縮小の選択を切り替え

source: Select All Visible
de: Alle sichtbaren auswählen
es: Seleccionar todos los visibles
fr: Sélectionner tous les éléments visibles
ja: 表示されているすべてを選択

source: Add New Column/Cell
de: Neue Spalte/Zelle hinzufügen
es: Agregar nueva columna/celda
fr: Ajouter une nouvelle colonne/cellule
ja: 新規の列／セルを追加

source: Full Editor
de: Gesamter Editor
es: Editor completo
fr: Editeur complet
ja: フルエディタ

source: No rows to display.
de: Keine anzuzeigenden Zeilen.
es: No hay filas que mostrar.
fr: Aucune ligne à afficher.
ja: 表示する行がありません。

source: Sort By
de: Sortieren nach
es: Clasificar por
fr: Trier par
ja: ソート基準

source: Home
de: Startseite
es: Inicio
fr: Accueil
ja: ホーム

source: Switch Cluster
de: Cluster umschalten
es: Cambiar clúster
fr: Changer de cluster
ja: クラスタを切り替え

source: Search for Table Name
de: Nach Tabellennamen suchen
es: Buscar nombre de tabla
fr: Rechercher un nom de table
ja: テーブル名を検索

source: Enable
de: Aktivieren
es: Activar
fr: Activer
ja: 有効化

source: Disable
de: Deaktivieren
es: Desactivar
fr: Désactiver
ja: 無効化

source: Drop
de: Ablegen
es: Descartar
fr: Supprimer
ja: ドロップ

source: New Table
de: Neue Tabelle
es: Nueva tabla
fr: Nouvelle table
ja: 新しいテーブル

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる

source: Create New Table
de: Neue Tabelle erstellen
es: Crear nueva tabla
fr: Créer une nouvelle table
ja: 新しいテーブルを作成

source: Table Name
de: Tabellenname
es: Nombre de tabla
fr: Nom de la table
ja: テーブル名

source: Column Families
de: Spaltenfamilien
es: Familias de columnas
fr: Familles de colonne
ja: 列ファミリ

source: Add an additional column family
de: Weitere Spaltenfamilie hinzufügen
es: Añadir una familia de columnas adicional
fr: Ajouter une famille de colonnes supplémentaire
ja: 列ファミリを追加

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル

source: Submit
de: Übermitteln
es: Enviar
fr: Envoyer
ja: サブミット

source: Remove Column Family
de: Spaltenfamilie entfernen
es: Eliminar familia de columnas
fr: Supprimer la famille de colonnes
ja: 列ファミリを削除

source: Remove column property
de: Spalteneigenschaft entfernen
es: Eliminar una propiedad de columna
fr: Supprimer la propriété de colonne
ja: 列のプロパティを削除

source: Additional column property
de: Zusätzliche Spalteneigenschaft
es: Propiedad de columna adicional
fr: Propriété de colonne supplémentaire
ja: 追加の列のプロパティ

source: Add a column property
de: Spalteneigenschaft hinzufügen
es: Añadir una propiedad de columna
fr: Ajouter une propriété de colonne
ja: 列のプロパティを追加

source: Autocomplete Suggestions:
de: Vorschläge zum automatischen Vervollständigen:
es: Sugerencias de autocompletar:
fr: Suggestions saisies automatiquement :
ja: オートコンプリートの提案：

source: Toggle Grid
de: Raster umschalten
es: Alternar cuadrícula
fr: Afficher ou masquer la grille
ja: グリッドを切り替え

source: Toggle Select All Rows
de: Auswählen aller Zeilen umschalten
es: Alternar Seleccionar todas las filas
fr: Afficher ou masquer la sélection de toutes les lignes
ja: すべての行を選択に切り替え

source: All
de: Alle
es: Todos
fr: Tout
ja: すべて

source: Drop Columns
de: Spalten ablegen
es: Descartar columnas
fr: Supprimer les colonnes
ja: 列をドロップ

source: Fetched
de: Abgerufen
es: Obtenido
fr: Extrait
ja: 取得済み

source: starting from
de: beginnt am
es: empezando el
fr: à partir du
ja: 開始日

source: in
es: en
fr: en
ja: 次に含まれる

source: seconds
de: Sekunden
es: segundos
fr: secondes
ja: 秒

source: Entries after
de: Einträge nach
es: Las entradas después de
fr: Entrées après
ja: この後のエントリ

source: were truncated.
de: wurden verkürzt.
es: estaban truncados.
fr: ont été tronquées.
ja: 切り捨てられました。

source: Drop Rows
de: Zeilen ablegen
es: Descartar filas
fr: Supprimer les lignes
ja: 行をドロップ

source: Bulk Upload
de: Massen-Upload
es: Carga en bloque
fr: Télécharger par bloc
ja: バルクアップロード

source: New Row
de: Neue Zeile
es: Nueva fila
fr: Nouvelle ligne
ja: 新規行

source: Insert New Row
de: Neue Zeile einfügen
es: Insertar nueva fila
fr: Insérer une nouvelle ligne
ja: 新規行を挿入

source: Row Key
de: Zeilenschlüssel
es: Clave de fila
fr: Clé de ligne
ja: 行キー

source: Add Field
de: Feld hinzufügen
es: Añadir campo
fr: Ajouter un champ
ja: フィールドを追加

source: Create New Column
de: Neue Spalte erstellen
es: Crear nueva columna
fr: Créer une colonne
ja: 新規列を作成

source: Column Name
de: Spaltenname
es: Nombre de columna
fr: Nom de la colonne
ja: 列名

source: Cell Value
de: Zellenwert
es: Valor de celda
fr: Valeur de la cellule
ja: セル値

source: Upload
de: Hochladen
es: Cargar
fr: Charger
ja: アップロード

source: Edit Cell
de: Zelle bearbeiten
es: Editar celda
fr: Modifier la cellule
ja: セルを編集

source: Cell History:
de: Zellenverlauf:
es: Historial de celda:
fr: Historique de la cellule :
ja: セル履歴：

source: Current Version
de: Aktuelle Version
es: Versión actual
fr: Version courante
ja: 現在のバージョン

source: Edited
de: Bearbeitet
es: Editado
fr: Modifié
ja: 編集済み

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存

source: Revert
de: Rückgängig machen
es: Revertir
fr: Revenir en arrière
ja: 復帰

source: Cell image
de: Zellenbild
es: Imagen de celda
fr: Image de la cellule
ja: セルのイメージ

source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認

source: Confirm Delete
de: Löschen bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression
ja: 削除を確認

source: Delete row
de: Zeile löschen
es: Eliminar fila
fr: Supprimer la ligne
ja: 行を削除

source: ? (This cannot be undone)
de: ? (Dies kann nicht rückgängig gemacht werden)
es: ? (No se puede deshacer)
fr: ? (Cette opération ne peut pas être annulée.)
ja: ?（これは元に戻せません）

source: Are you sure you want to drop this column?
de: Soll diese Spalte wirklich beendet werden?
es: ¿Está seguro de que desea descartar esta columna?
fr: Voulez-vous vraiment supprimer cette colonne ?
ja: この列をドロップしてもよろしいですか？

source: enable
de: aktivieren
es: activar
fr: activer
ja: 有効化

source: disable
de: deaktivieren
es: desactivar
fr: désactiver
ja: 無効化

source: Are you sure you want to
de: Möchten Sie diese Tabelle wirklich
es: ¿Está seguro de que desea
fr: Voulez-vous vraiment
ja: よろしいですか

source: this table?
es: esta tabla?
fr: cette table ?
ja: このテーブルですか？

source: End Query
de: Abfrage beenden
es: Finalizar consulta
fr: Requête de fin
ja: クエリを終了

source: Prefix Scan
de: Präfix-Scan
es: Análisis de prefijos
fr: Analyse du préfixe
ja: プレフィックススキャン

source: Start Scan
de: Scannen beginnen
es: Iniciar examen
fr: Démarrer l'analyse
ja: スキャンを開始

source: Start Select Columns
de: Start der Spaltenauswahl
es: Iniciar columnas seleccionadas
fr: Démarrer la sélection de colonnes
ja: 列の選択を開始

source: End Column/Family
de: Ende der Spalte/Familie
es: Finalizar columna/familia
fr: Colonne/famille de fin
ja: 列／ファミリを終了

source: End Select Columns
de: Ende der Spaltenauswahl
es: Finalizar columnas seleccionadas
fr: Fin de la sélection de colonnes
ja: 列の選択を終了

source: Start FilterString
de: Start von FilterString
es: Iniciar FilterString
fr: Démarrer FilterString
ja: FilterString を開始

source: End FilterString
de: Ende von FilterString
es: Finalizar FilterString
fr: Chaîne de filtre de fin
ja: FilterString を終了

source: Row Key Value
de: Zeilenschlüsselwert
es: Valor de clave de fila
fr: Valeur de clé de ligne
ja: 行キー値

source: Length of Scan or Row Key
de: Länge des Scans oder Zeilenschlüssel
es: Longitud de examen o clave de fila
fr: Longueur de la clé Analyse ou Ligne
ja: スキャンまたは行キーの長さ

source: Column Family: Column Name
de: Spaltenfamilie: Spaltenname
es: Familia de columnas: nombre de columna
fr: Famille de colonne : nom de la colonne
ja: 列ファミリ：列名

source: Rows starting with
de: Zeilen beginnend mit
es: Filas que empiezan por
fr: Lignes commençant par
ja: 行の先頭の値

source: String
de: Zeichenfolge
es: Cadena
fr: Chaîne
ja: 文字列

source: Integer
de: Ganzzahl
es: Entero
fr: Entier
ja: 整数

source: Column Range
de: Spaltenbereich
es: Intervalo de columnas
fr: Plage de colonnes
ja: 列の範囲

source: .CSV, .TSV, etc...
de: .CSV, .TSV, usw...
ja: .CSV、.TSVなど...
