Repository: cloudera/hue
Catalog: apps/shell/src/shell/locale/*/LC_MESSAGES/django.po
Languages: de, ja, ko, pt, pt_br, zh_cn

source: bin/hadoop return non-zero %(retcode)d while trying to merge credentials.
de: bin/hadoop gibt Nicht-Null %(retcode)d zurück beim Versuch, Benutzerinformationen zusammenzuführen.
ja: bin/hadoop は、資格情報をマージしようとしている間に、ゼロではない %(retcode)d を返します。
ko: 자격 증명을 병합하는 동안 bin/hadoop이 0이 아닌 값 %(retcode)d을(를) 반환했습니다.
pt: bin/hadoop devolveu %(retcode)d não zero ao tentar unir credenciais.
pt_br: Retorno do bin/hadoop %(retcode)d diferente de zero enquanto tenta mesclar credenciais.
zh_cn: 尝试合并凭据期间，bin/hadoop 返回了非零 %(retcode)d。

source: Error
de: Fehler
ja: エラー
ko: 오류
pt: Erro
pt_br: Erro
zh_cn: 错误

source: Failed to create a shell of the given type. The possible reasons for this are:
de: Eine Shell des gegebenen Typs konnte nicht erstellt werden. Die möglichen Gründe dafür sind:
ja: 指定されたタイプのシェルを作成できませんでした。考えられる原因は次のとおりです。
ko: 주어진 유형의 Shell을 생성하지 못했습니다. 가능한 원인:
pt: Falha ao criar uma shell do tipo indicado. Os motivos possíveis para tal são:
pt_br: Falha ao criar um programa shell de determinado tipo. As razões possíveis são:
zh_cn: 无法创建给定类型的 shell。造成这种情况的原因可能是：

source: The system is out of PTYs.
de: Das System hat keine PTYs mehr.
ja: システムが PTY 外です。
ko: 이 시스템이 PTY 밖에 있습니다.
pt: O sistema já não tem mais PTYs.
pt_br: O sistema está fora do PTYs.
zh_cn: 系统已超出 PTY。

source: The system cannot create more subprocesses.
de: Das System kann keine weiteren Subprozesse erstellen.
ja: サブプロセスをこれ以上作成できません。
ko: 이 시스템은 추가 하위 프로세스를 생성할 수 없습니다.
pt: O sistema não pode criar mais subprocessos.
pt_br: O sistema não pode criar mais subprocessos.
zh_cn: 系统无法创建更多子进程。

source: You do not have permission to create shells of this type.
de: Sie haben nicht die erforderlichen Rechte, um Shells dieser Art zu erstellen.
ja: このタイプのシェルを作成するパーミッションがありません。
ko: 이 유형의 Shell을 생성할 권한이 없습니다.
pt: Não tem permissão para criar shells deste tipo.
pt_br: Você não tem permissão para criar shells deste tipo.
zh_cn: 您无权创建此类型的 shell。

source: There is no shell with that name.
de: Es gibt keine Shell mit diesem Namen.
ja: 指定された名前のシェルがありません。
ko: 이 이름을 갖는 Shell이 없습니다.
pt: Não existe uma shell com o nome indicado.
pt_br: Não existe shell para aquele nome.
zh_cn: 不存在该名称的 shell。

source: There is no Unix user account for you.
de: Es gibt kein Unix-Benutzerkonto für Sie.
ja: 使用できる UNIX ユーザーアカウントがありません。
ko: 귀하의 Unix 사용자 계정이 없습니다.
pt: Não existe qualquer conta de utilizador de Unix associada a si.
pt_br: Não existe conta de usuário Unix para você.
zh_cn: 您没有 Unix 用户帐户。

source: Select one of the available shells from the toolbar above.
de: Wählen Sie eine der verfügbaren Shells aus der Symbolleiste oben aus.
ja: 上のツールバーにある使用可能なシェルの中から 1 つ選択してください。
ko: 위 도구 모음에서 사용 가능한 Shell 하나를 선택하십시오.
pt: Seleccione uma das shells disponíveis na barra de ferramentas acima.
pt_br: Selecione um dos shells disponíveis na barra de ferramentas acima.
zh_cn: 请从上面的工具栏中选择其中一个可用的 shell。

source: You do not have permission to access any shell or there is no configured shell.
de: Sie haben nicht die erforderlichen Rechte, um auf eine Shell zuzugreifen, oder es gibt keine konfigurierte Shell.
ja: どのシェルにもアクセスするパーミッションがないか、シェルが 1 つも設定されていません。
ko: Shell에 대한 액세스 권한이 없거나 구성된 Shell이 없습니다.
pt: Não tem permissão para aceder a qualquer shell ou não existe qualquer shell configurada.
pt_br: Você não tem permissão para acessar qualquer shell ou não existe um shell configurado.
zh_cn: 您无权访问任何 shell，或者不存在配置 shell。

source: The shell is not present on the Hue host.
de: Die Shell ist auf dem Hue-Host nicht vorhanden.
ja: シェルが Hue ホストに存在しません。
ko: Shell이 Hue 호스트에 없습니다.
pt: A shell não está presente no anfitrião do Hue.
pt_br: O shell não está presente no host do Hue.
zh_cn: 在 Hue 主机上不存在 shell。

source: The Shell application requires a Unix user account for every user of Hue on the remote web server.
de: Die Shell-Anwendung erfordert ein Unix-Benutzerkonto für jeden Benutzer von Hue auf dem Remote-Webserver.
ja: このシェルアプリケーションでは、リモート Web サーバー上にある Hue のすべてのユーザーに Unix のユーザーアカウントが必要です。
ko: Shell 애플리케이션에서는 원격 웹 서버에 있는 Hue의 모든 사용자에 대한 Unix 사용자 계정이 필요합니다.
pt: A aplicação Shell requer uma conta de utilizador Unix para cada utilizador da Hue no servidor web remoto.
pt_br: O aplicativo Shell necessita de uma conta de usuário Unix para cada usuário do Hue no servidor Web remoto.
zh_cn: 对于远程 Web 服务器上的每个 Hue 用户，Shell 应用程序都需要一个 Unix 用户帐户。

source: Ask your administrator to create a user account for you on the remote web server as described in the Shell documentation.
de: Bitten Sie Ihren Administrator, für Sie ein Benutzerkonto auf dem Remote-Webserver zu erstellen, wie in der Shell-Dokumentation beschrieben.
ja: シェルのマニュアルに従ってリモート Web サーバー上にユーザーアカウントを作成することを担当の管理者に依頼してください。
ko: Shell 설명서에 나와 있는 대로 관리자에게 원격 웹 서버에 대한 사용자 계정을 생성해주도록 요청하십시오.
pt: Solicite ao seu administrador que lhe crie uma conta de utilizador no servidor web remoto, conforme descrito na documentação da Shell.
pt_br: Peça a seu administrador para criar uma conta de usuário para você no servidor Web remoto conforme descrito na documentação do shell.
zh_cn: 请要求您的管理员根据 Shell 文档中的描述，为您在远程 Web 服务器上创建一个用户帐户。

source: The webserver currently running Hue does not support the Shell application. Please contact your administrator.
de: Der Webserver, auf dem derzeit Hue ausgeführt wird, unterstützt die Shell-Anwendung nicht. Wenden Sie sich an Ihren Administrator.
ja: 現在 Hue を実行している Web サーバーは、Shell アプリケーションをサポートしていません。管理者に問い合わせてください。
ko: 현재 Hue를 실행하는 웹 서버가 Shell 애플리케이션을 지원하지 않습니다. 관리자에게 문의하십시오.
pt: O servidor de Internet que está a executar actualmente o Hue não suporta a aplicação Shell. Contacte o seu administrador.
pt_br: O servidor da Web que atualmente executa o Hue não oferece suporte ao aplicativo Shell. Entre em contato com o seu administrador.
zh_cn: 当前正在运行 Hue 的 Web 服务器不支持 Shell 应用程序。请与您的管理员联系。
