Repository: cloudera/hue
Catalog: apps/filebrowser/src/filebrowser/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Submitting is not available as the Oozie app is disabled
de: Senden ist nicht verfügbar, da die Oozie-App deaktiviert ist
es: El envío no es posible porque la aplicación de Oozie está desactivada
fr: L'envoi n'est pas disponible car l'application Oozie est désactivée
ja: Oozie アプリが無効になっているため、サブミットを実行できません
ko: Oozie 앱을 사용할 수 없으므로 제출할 수 없음
zh_cn: 禁用 Oozie 应用程序后，提交不可用

source: Task
es: Tarea
fr: Tâche
ja: タスク
ko: 작업
zh_cn: 任务

source: submitted.
de: übermittelt.
es: enviada.
fr: envoyée.
ja: サブミットされました。
ko: 제출되었습니다.
zh_cn: 已提交。

source: Drop the files here to upload
de: Dateien zum Hochladen hier ablegen
es: Soltar aquí los archivos para cargar
fr: Déposer ici les fichiers à charger
ja: ここにファイルをドロップしてアップロード
ko: 업로드할 파일 여기 두기
zh_cn: 拖放文件到此处进行上传

source: Select files
de: Dateien auswählen
es: Seleccionar archivos
fr: Sélectionner des fichiers
ja: ファイルを選択
ko: 파일 선택
zh_cn: 选择文件

source: Failed
de: Fehlgeschlagen
es: Erróneos
fr: Echoué
ja: 失敗しました
ko: 실패함
zh_cn: 失败

source: Error:
de: Fehler:
fr: Erreur :
ja: エラー：
ko: 오류:
zh_cn: 错误：

source: uploaded successfully.
de: erfolgreich hochgeladen.
es: carga realizada correctamente.
fr: chargé avec succès.
ja: 正常にアップロードしました。
ko: 성공적으로 업로드했습니다.
zh_cn: 上传成功。

source: Drop the archives here to upload and extract them
de: Archive hier ablegen, um sie hochzuladen und zu extrahieren
es: Soltar aquí los archivos para cargarlos y extraerlos
fr: Déposer ici les archives pour les charger et les extraire
ja: ここにアーカイブをドロップして、アップロードと抽出を実行します
ko: 업로드하여 압축 해제할 아카이브 여기 두기
zh_cn: 拖放存档到此处以进行上传并对其进行提取

source: Select ZIP, TGZ or BZ2 files
de: ZIP-, TGZ- oder BZ2-Dateien auswählen
es: Seleccionar archivos ZIP, TGZ o BZ2
fr: Sélectionner des fichiers ZIP, TGZ ou BZ2
ja: ZIP、TGZ、または BZ2 ファイルを選択
ko: ZIP, TGZ 또는 BZ2 파일 선택
zh_cn: 选择 ZIP、TGZ 或 BZ2 文件

source: Drop files here to upload
de: Dateien zum Hochladen hier ablegen
es: Soltar aquí archivos para cargar
fr: Déposer ici les fichiers à charger
ja: ここにファイルをドロップしてアップロード
ko: 업로드할 파일 여기 두기
zh_cn: 拖放文件到此处以进行上传

source: User is required.
de: Benutzer ist erforderlich.
es: El usuario es necesario.
fr: L'utilisateur est requis.
ja: ユーザーが必要です。
ko: 사용자를 입력해야 합니다.
zh_cn: 需要提供用户。

source: Group is required.
de: Gruppe ist erforderlich.
es: El grupo es obligatorio.
fr: Un groupe est requis.
ja: グループが必要です。
ko: 그룹이 필요합니다.
zh_cn: 组为必填字段。

source: Specify another group.
de: Geben Sie eine andere Gruppe an.
es: Especifique otro grupo.
fr: Indiquez un autre groupe.
ja: 別のグループを指定してください。
ko: 다른 그룹을 지정하십시오.
zh_cn: 指定另一个组。

source: Specify another user.
de: Geben Sie einen anderen Benutzer an.
es: Especifique otro usuario.
fr: Indiquez un autre utilisateur.
ja: 別のユーザーを指定してください。
ko: 다른 사용자를 지정하십시오.
zh_cn: 指定另一位用户。

source: Did you know? You can use the tab key or CTRL + Space to autocomplete file and folder names
de: Wussten Sie das? Sie können Datei- und Ordnernamen mit der Tabulatortaste oder mit STRG + Leerzeichen automatisch vervollständigen.
es: ¿Sabía que puede usar el tabulador o CTRL + Espacio para autocompletar los nombres de archivo y de carpeta?
fr: Le saviez-vous ? Vous pouvez utiliser la touche Tabulation ou la combinaison de touches CTRL + Espace pour renseigner automatiquement les noms de dossier et de fichier
ja: ご存知ですか？ Tab キーを使用するか、CTRL キーを押しながら Space キーを押して、ファイル名やフォルダー名のオートコンプリートが可能です
ko: 유용한 정보: tab 키 또는 Ctrl + Space를 사용하여 파일 및 폴더 이름을 자동 완성할 수 있습니다.
zh_cn: 您知道吗？您可使用 Tab 键或 CTRL + 空格键自动完成文件和文件夹名称

source: There was a problem with your request.
de: Bei Ihrer Anfrage ist ein Fehler aufgetreten.
es: Se ha producido un error en la solicitud.
fr: Un problème est survenu avec votre requête.
ja: 要求に関する問題があります。
ko: 요청에 문제가 있습니다.
zh_cn: 您的请求出错。

source: Save File As...
de: Datei speichern unter...
es: Guardar archivo como...
fr: Enregistrer le fichier sous…
ja: ファイルに名前を付けて保存...
ko: 다른 이름으로 파일 저장...
zh_cn: 将文件另存为...

source: Workflow submitted.
fr: Workflow envoyé.
