Repository: cloudera/hue
Catalog: apps/filebrowser/src/filebrowser/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Max snappy decompression size in bytes.
de: Maximale Snappy-Dekomprimierungsgröße in Byte.
es: Tamaño máximo de descompresión de Snappy en bites.
fr: Taille maximale de décompression snappy en octets.
ja: snappy の最大解凍サイズ（バイト）です。
ko: 최대 snappy 압축 해제 크기(바이트)입니다.
zh_cn: 最大 Snappy 解压缩大小（字节）。

source: Location on local filesystem where the uploaded archives are temporary stored.
de: Der Speicherort auf dem lokalen Dateisystem, im dem hochgeladene Archive temporär gespeichert werden.
es: Ubicación en el sistema de archivos local donde se almacenan de forma temporal los archivos cargados.
fr: Emplacement sur le système de fichiers local où les archives téléchargées sont temporairement stockées.
ja: アップロードされたアーカイブが一時的に保存されているローカルファイルシステム上の場所です。
ko: 업로드된 아카이브가 임시로 저장되는 로컬 파일 시스템 위치입니다.
zh_cn: 位于本地文件系统中，其中暂时存储着上载的存档。

source: whether to show the download button in hdfs file browser.
de: Legt fest, ob die Download-Schaltfläche im HDFS-Datei-Browser angezeigt wird.
es: Determina si se debe mostrar el botón de descarga en el explorador de archivos HDFS.
fr: s'il faut afficher le bouton de téléchargement dans l'explorateur de fichiers hdfs.
ja: HDFS File Browser で［ダウンロード］ボタンを表示するかどうかです。
ko: HDFS 파일 브라우저에서 다운로드 버튼의 표시 여부입니다.
zh_cn: 是否在 hdfs 文件浏览器中显示下载按钮。

source: whether to show the upload button in hdfs file browser.
de: Legt fest, ob die Upload-Schaltfläche im HDFS-Datei-Browser angezeigt wird.
es: Determina si se debe mostrar el botón de carga en el explorador de archivos HDFS.
fr: s'il faut afficher le bouton de chargement dans l'explorateur de fichiers hdfs.
ja: HDFS File Browser で［アップロード］ボタンを表示するかどうかです。
ko: HDFS 파일 브라우저에서 업로드 버튼의 표시 여부입니다.
zh_cn: 是否在 hdfs 文件浏览器中显示上传按钮。

source: Flag to enable the extraction of a uploaded archive in HDFS.
de: Flag zum Aktivieren der Extrahierung eines hochgeladenen Archivs in HDFS.
es: Marca para activar la extracción de un archivo cargado en HDFS.
fr: Indicateur permettant d'activer l'extraction d'une archive téléchargée dans HDFS.
ja: アップロードしたアーカイブの HDFS での抽出を有効にするフラグです。
ko: HDFS에서 업로드된 아카이브에 대한 압축 해제를 허용하는 플래그입니다.
zh_cn: 此标记用于提取 HDFS 中上传的存档。

source: File to edit
de: Zu bearbeitende Datei
es: Archivo que editar
fr: Fichier à modifier
ja: 編集するファイル
ko: 편집할 파일
zh_cn: 要编辑的文件

source: Contents
de: Inhalt
es: Contenido
fr: Contenus
ja: コンテンツ
ko: 콘텐츠
zh_cn: 内容

source: Encoding
de: Kodierung
es: Codificación
fr: Encodage
ja: エンコード中
ko: 인코딩
zh_cn: 编码

source: File to rename
de: Umzubenennende Datei
es: Archivo al que cambiar el nombre
fr: Fichier à renommer
ja: 名前を変更するファイル
ko: 이름을 변경할 파일
zh_cn: 要重命名的文件

source: The file to rename.
de: Die umzubenennende Datei.
es: Archivo al que cambiar el nombre.
fr: Fichier à renommer.
ja: 名前を変更するファイルです。
ko: 이름을 변경할 파일입니다.
zh_cn: 要重命名的文件。

source: New name
de: Neuer Name
es: Nuevo nombre
fr: Nouveau nom
ja: 新しい名前
ko: 새 이름
zh_cn: 新名称

source: Rename the file to:
de: Datei umbenennen in:
es: Cambiar nombre de archivo a:
fr: Renommer le fichier par :
ja: ファイルを次の名前に変更：
ko: 다음으로 파일 이름 변경:
zh_cn: 将文件重命名为：

source: File to copy
de: Zu kopierende Datei
es: Archivo a copiar
fr: Fichier à copier
ja: コピーするファイル
ko: 복사할 파일
zh_cn: 要复制的文件

source: The file to copy.
de: Die zu kopierende Datei.
es: El archivo que se va a copiar.
fr: Fichier à copier.
ja: コピーするファイルです。
ko: 복사할 파일입니다.
zh_cn: 要复制的文件。

source: Destination location
de: Zielspeicherort
es: Ubicación de destino
fr: Emplacement de destination
ja: 宛先の場所
ko: 대상 위치
zh_cn: 目标位置

source: Copy the file to:
de: Datei kopieren in:
es: Copiar el archivo a:
fr: Copier le fichier vers :
ja: ファイルのコピー先：
ko: 파일을 복사할 위치:
zh_cn: 将文件复制到：

source: File to set replication factor
de: Datei zum Festlegen des Replikationsfaktors
es: Archivo para establecer factor de replicación
fr: Fichier de définition du facteur de réplication
ja: レプリケーションファクタ設定ファイル
ko: 복제 요소를 설정하기 위한 파일
zh_cn: 用于设置复制因子的文件

source: The file to set replication factor.
de: Die Datei zum Festlegen des Replikationsfaktors.
es: El archivo para establecer el factor de replicación.
fr: Fichier utilisé pour définir le facteur de réplication.
ja: レプリケーションファクタを設定するファイルです。
ko: 복제 요소를 설정하기 위한 파일입니다.
zh_cn: 此文件用于设置复制因子。

source: Value of replication factor
de: Wert des Replikationsfaktors
es: Valor del factor de replicación
fr: Valeur du facteur de réplication
ja: レプリケーションファクタの値
ko: 복제 요소의 값
zh_cn: 复制因子的值

source: The value of replication factor.
de: Der Wert des Replikationsfaktors.
es: El valor del factor de replicación.
fr: Valeur utilisée pour le facteur de réplication.
ja: レプリケーションファクタの値です。
ko: 복제 요소의 값입니다.
zh_cn: 复制因子的值。

source: File to Upload
de: Hochzuladende Datei
es: Archivo que cargar
fr: Fichier à charger
ja: アップロードするファイル
ko: 업로드할 파일
zh_cn: 要上传的文件

source: Destination Path
de: Zielpfad
es: Ruta de destino
fr: Chemin de destination
ja: 目的のパス
ko: 대상 경로
zh_cn: 目标路径

source: Filename or directory to upload to.
de: Dateiname oder Verzeichnis, in das hochgeladen werden soll.
es: Nombre de archivo o directorio en el que cargar.
fr: Nom de fichier ou répertoire vers lequel effectuer le chargement.
ja: アップロード先のファイル名またはディレクトリ。
ko: 업로드할 파일 이름 또는 디렉토리입니다.
zh_cn: 要上传到的文件名或目录。

source: Archive to Upload
de: Archiv für Upload
es: Almacenamiento que cargar
fr: Archive à charger
ja: アップロードするアーカイブ
ko: 업로드할 아카이브
zh_cn: 要上传的存档

source: Archive to upload to.
de: Archiv, in das hochgeladen wird.
es: Almacenamiento en el que cargar.
fr: Archive vers laquelle effectuer le chargement.
ja: アップロードするアーカイブです。
ko: 업로드할 아카이브입니다.
zh_cn: 要上传的存档。

source: File to remove
de: Zu entfernende Datei
es: Archivo que quitar
fr: Fichiers à supprimer
ja: 削除するファイル
ko: 제거할 파일
zh_cn: 要移除的文件

source: Directory to remove
de: Zu entfernendes Verzeichnis
es: Directorio que quitar
fr: Répertoire à supprimer
ja: 削除するディレクトリ
ko: 제거할 디렉토리
zh_cn: 要移除的目录

source: Directory to remove (recursively)
de: Zu entfernendes Verzeichnis (rekursiv)
es: Directorio que quitar (recursivamente)
fr: Répertoire à supprimer (récursivement)
ja: 削除（再帰的）するディレクトリ
ko: 제거할 디렉토리(반복 적용)
zh_cn: 要移除的目录（递归）

source: Path to restore
de: Wiederherzustellender Pfad
es: Ruta a restaurar
fr: Chemin d'accès à restaurer
ja: 復元するパス
ko: 복구할 경로
zh_cn: 要还原的路径

source: Path in which to create the directory
de: Pfad, in dem das Verzeichnis erstellt werden soll
es: Ruta en la que crear el directorio
fr: Chemin dans lequel créer le répertoire
ja: ディレクトリの作成先とするパス
ko: 디렉토리 생성 경로
zh_cn: 要在其中创建目录的路径

source: Directory Name
de: Verzeichnisname
es: Nombre de directorio
fr: Nom du répertoire
ja: ディレクトリ名
ko: 디렉토리 이름
zh_cn: 目录名称

source: Path in which to create the file
de: Pfad, in dem die Datei erstellt werden soll
es: Ruta en la que crear el archivo
fr: Chemin d'accès vers lequel créer le fichier
ja: ファイルの作成先とするパス
ko: 파일을 생성할 경로
zh_cn: 要在其中创建文件的路径

source: File Name
de: Dateiname
es: Nombre de archivo
fr: Nom du fichier
ja: ファイル名
ko: 파일 이름
zh_cn: 文件名

source: Path to change user/group ownership
de: Pfad zur Änderung des Eigentums von Benutzer/Gruppe
es: Ruta a la que cambiar propiedad de usuario/grupo
fr: Chemin pour modifier la propriété de l'utilisateur/groupe
ja: ユーザー/グループの所有権を変更するパス
ko: 사용자/그룹 소유권 변경 경로
zh_cn: 用户/组所有权更改路径

source: User
de: Benutzer
es: Usuario
fr: Utilisateur
ja: ユーザー
ko: 사용자
zh_cn: 用户

source: OtherUser
es: Otro usuario
fr: Autre utilisateur
ja: 別のユーザー
ko: 다른 사용자
zh_cn: OtherUser（其他用户）

source: Group
de: Gruppe
es: Grupo
fr: Groupe
ja: グループ
ko: 그룹
zh_cn: 组

source: OtherGroup
es: Otro grupo
fr: Autre groupe
ja: 別のグループ
ko: 다른 그룹
zh_cn: OtherGroup（其他组）

source: Recursive
de: Rekursiv
es: Recursivo
fr: Récursif
ja: 再帰的
ko: 재귀
zh_cn: 递归

source: Path to change permissions
de: Pfad zur Änderung von Berechtigungen
es: Ruta a la que cambiar permisos
fr: Chemin pour modifier les autorisations
ja: パーミッションを変更するパス
ko: 권한 변경 경로
zh_cn: 权限更改路径

source: File not found: %(path)s.
de: Datei nicht gefunden: %(path)s.
es: Archivo no encontrado: %(path)s.
fr: Fichier introuvable : %(path)s.
ja: ファイルが見つかりません：%(path)s。
ko: 파일을 찾을 수 없음: %(path)s.
zh_cn: 未找到文件：%(path)s。

source: '%(path)s' is not a file.
de: "%(path)s" ist keine Datei.
es: '%(path)s' no es un archivo.
fr: '%(path)s' n'est pas un fichier.
ja: '%(path)s' はファイルではありません。
ko: '%(path)s'은(는) 파일이 아닙니다.
zh_cn: '%(path)s' 不是一个文件。

source: User %s is not authorized to download file at path "%s"
de: Benutzer %s ist nicht berechtigt, die Datei im Pfad "%s" herunterzuladen
es: El usuario %s no está autorizado para descargar el archivo en la ruta "%s"
fr: L'utilisateur %s n'est pas autorisé à télécharger le fichier dans le chemin d'accès "%s"
ja: ユーザー %s はパス "%s" からのファイルのダウンロードを許可されていません
ko: 사용자 %s은(는) "%s" 경로에서 파일을 다운로드할 권한이 없습니다.
zh_cn: 用户 %s 无权将文件下载到路径“%s” 中

source: Failed to download file at path "%s": %s
de: Datei im Pfad "%s" konnte nicht heruntergeladen werden: %s
es: Error al descargar el archivo en la ruta "%s": %s
fr: Échec du téléchargement du fichier dans le chemin d'accès "%s" : %s
ja: パス "%s" からファイルをダウンロードできませんでした：%s
ko: "%s" 경로에서 파일을 다운로드할 수 없음: %s
zh_cn: 无法将以下文件下载到路径“%s”中：%s

source: S3 filesystem exception.
de: S3-Dateisystem-Ausnahme.
es: Excepción del sistema de archivos S3.
fr: Exception du système de fichiers S3.
ja: S3 ファイルシステムの例外です。
ko: S3 파일 시스템 예외.
zh_cn: S3 文件系统异常。

source: Cannot access: %(path)s.
de: Kann nicht zugreifen auf: %(path)s.
es: No se puede acceder: %(path)s.
fr: Accès impossible : %(path)s.
ja: アクセスできません：%(path)s。
ko: %(path)s에 액세스할 수 없습니다.
zh_cn: 无法访问：%(path)s。

source: The HDFS REST service is not available.
de: Der HDFS REST-Dienst ist nicht verfügbar.
es: El servicio HDFS REST no está disponible.
fr: Le service REST HDFS n'est pas disponible.
ja: HDFS REST サービスが使用できません。
ko: HDFS REST 서비스를 사용할 수 없습니다.
zh_cn: HDFS REST 服务不可用。

source: Note: you are a Hue admin but not a HDFS superuser, "%(superuser)s" or part of HDFS supergroup, "%(supergroup)s".
de: Hinweis: Sie sind ein Hue-Administrator, aber kein HDFS-Superuser, "%(superuser)s" oder Mitglied der HDFS-Supergruppe "%(supergroup)s".
es: Nota: Usted es un administrador de Hue, pero no un superusuario de HDFS, "%(superuser)s" ni parte de un supergrupo de HDFS, "%(supergroup)s".
fr: Remarque : vous êtes un administrateur Hue, mais pas un superutilisateur HDFS, "%(superuser)s", et vous ne faites partie d'un supergroupe HDFS, "%(supergroup)s".
ja: 注意: 現在、Hue の管理者ですが、HDFS のスーパーユーザー "%(superuser)s" ではありません。また、HDFS スーパーグループ "%(supergroup)s" にも属していません。
ko: 참고: 귀하는 Hue 관리자지만, HDFS superuser("%(superuser)s") 또는 HDFS supergroup("%(supergroup)s")에 속하지 않습니다.
zh_cn: 注意：您是 Hue 管理员，但不是 HDFS 超级用户（即 "%(superuser)s" 或 HDFS 超级组 "%(supergroup)s" 的一部分）。

source: Cannot edit a directory: %(path)s
de: Kann ein Verzeichnis nicht bearbeiten: %(path)s
es: No se puede editar un directorio: %(path)s
fr: Modification d'un répertoire impossible : %(path)s
ja: ディレクトリを編集できません：%(path)s
ko: 디렉토리를 편집할 수 없음: %(path)s
zh_cn: 无法编辑目录：%(path)s

source: File too big to edit: %(path)s
de: Datei zu groß zum Bearbeiten: %(path)s
es: Archivo demasiado largo para su edición: %(path)s
fr: Fichier trop volumineux pour le modifier : %(path)s
ja: 編集するにはファイルが大きすぎます：%(path)s
ko: 파일이 너무 커 편집할 수 없음: %(path)s
zh_cn: 文件太大，无法编辑：%(path)s

source: File is not encoded in %(encoding)s; cannot be edited: %(path)s.
de: Datei ist nicht verschlüsselt in %(encoding)s; kann nicht bearbeitet werden: %(path)s.
es: El archivo no está codificado en %(encoding)s; no se puede editar: %(path)s.
fr: Le fichier n'est pas encodé en %(encoding)s ; modification impossible : %(path)s.
ja: ファイルが %(encoding)s でエンコードされていないので編集できません：%(path)s。
ko: 파일이 %(encoding)s(으)로 인코딩되지 않아 편집할 수 없음: %(path)s.
zh_cn: 文件未采用 %(encoding)s 进行编码；无法编辑：%(path)s。

source: No path specified
de: Kein Pfad angegeben
es: No se ha especificado ninguna ruta
fr: Aucun chemin spécifié
ja: パスが指定されていません
ko: 지정된 경로가 없음
zh_cn: 没有指定路径

source: The file could not be saved
de: Datei konnte nicht gespeichert werden
es: El archivo no se ha podido guardar.
fr: Le fichier n'a pas pu être enregistré
ja: ファイルを保存できませんでした
ko: 파일을 저장할 수 없음
zh_cn: 无法保存文件

source: Not a directory: %(path)s
de: Kein Verzeichnis: %(path)s
es: No es un directorio: %(path)s
fr: Pas un répertoire : %(path)s
ja: ディレクトリではありません：%(path)s
ko: 디렉토리가 아님: %(path)s
zh_cn: 不是目录：%(path)s

source: File not found: %(path)s
de: Datei nicht gefunden: %(path)s
es: Archivo no encontrado: %(path)s
fr: Fichier introuvable : %(path)s
ja: ファイルが見つかりません：%(path)s
ko: 파일을 찾을 수 없음: %(path)s
zh_cn: 未找到文件：%(path)s

source: Not a file: '%(path)s'
de: Keine Datei: '%(path)s'
es: No es un archivo: '%(path)s'
fr: Pas un fichier : '%(path)s'
ja: ファイルではありません：'%(path)s'
ko: 파일이 아님: '%(path)s'
zh_cn: 不是文件：'%(path)s'

source: First byte to display must be before last byte to display.
de: Erstes anzuzeigendes Byte muss vor letztem anzuzeigenden Byte sein.
es: El primer byte que mostrar debe ser anterior al último byte que mostrar.
fr: Le premier octet à afficher doit précéder le dernier octet à afficher.
ja: 最初に表示するバイトは、最後に表示するバイトよりも前にあることが必要です。
ko: 처음 표시할 바이트는 마지막으로 표시할 바이트 앞에 위치해야 합니다.
zh_cn: 要显示的第一个字节必须在要显示的最后一个字节之前。

source: Mode must be one of 'binary' or 'text'.
de: Modus muss entweder 'binary' oder 'text' sein.
es: El modo debe ser 'binario' o 'texto'.
fr: Le mode doit être 'binaire' ou 'texte'.
ja: モードは「バイナリ」または「テキスト」のいずれか 1 つとする必要があります。
ko: 모드는 '바이너리'와 '텍스트' 중 하나여야 합니다.
zh_cn: 模式必须是其中一个 'binary' 或 'text'。

source: Offset may not be less than zero.
de: Versatz darf nicht weniger sein als Null.
es: El desplazamiento no puede ser inferior a cero.
fr: Le décalage ne peut pas être inférieur à zéro.
ja: オフセットはゼロ以上であることが必要です。
ko: 오프셋은 음수일 수 없습니다.
zh_cn: 偏移不能小于零。

source: Length may not be less than zero.
de: Länge darf nicht weniger sein als Null.
es: La longitud no puede ser inferior a cero.
fr: La longueur ne peut pas être inférieure à zéro.
ja: 長さはゼロ以上であることが必要です。
ko: 길이는 0보다 작을 수 없습니다.
zh_cn: 长度不能小于零。

source: Cannot request chunks greater than %(bytes)d bytes.
de: Es können keine Teile angefordert werden, die größer als %(bytes)d Bytes sind.
es: No se pueden solicitar fragmentos que tengan más de %(bytes)d bytes.
fr: Impossible de demander des blocs supérieurs à %(bytes)d octets.
ja: %(bytes)d バイトを超えるチャンクは要求できません。
ko: %(bytes)d바이트보다 큰 청크는 요청할 수 없습니다.
zh_cn: 不能请求大于 %(bytes)d 字节的区块。

source: Failed to decompress snappy compressed file.
de: Komprimierte Snappy-Datei konnte nicht dekomprimiert werden.
es: Error al descomprimir el archivo comprimido de Snappy.
fr: Echec de la décompression du fichier compressé snappy.
ja: snappy 圧縮ファイルを解凍できませんでした。
ko: Snappy 압축 파일을 압축 해제할 수 없습니다.
zh_cn: 无法对 Snappy 压缩的文件解压缩。

source: Failed to decompress snappy compressed file. Snappy is not installed.
de: Komprimierte Snappy-Datei konnte nicht dekomprimiert werden. Snappy ist nicht installiert.
es: Error al descomprimir el archivo comprimido de Snappy. Snappy no está instalado.
fr: Echec de la décompression du fichier compressé snappy. Snappy n'est pas installé.
ja: snappy 圧縮ファイルを解凍できませんでした。snappy がインストールされていません。
ko: Snappy 압축 파일을 압축 해제할 수 없습니다. Snappy가 설치되지 않았습니다.
zh_cn: 无法对 Snappy 压缩的文件解压缩。未安装 Snappy。

source: Failed to decompress snappy compressed file. File size is greater than allowed max snappy decompression size of %d.
de: Komprimierte Snappy-Datei konnte nicht dekomprimiert werden. Datei ist größer als die zugelassene maximale Snappy-Dekomprimierungsgröße von %d.
es: Error al descomprimir el archivo comprimido de Snappy. El tamaño del archivo es mayor que el tamaño máximo de descompresión de %d permitido por Snappy.
fr: Echec de la décompression du fichier compressé snappy. La taille du fichier est supérieure à la taille de décompression snappy maximale autorisée égale à %d.
ja: snappy 圧縮ファイルを解凍できませんでした。ファイルサイズが snappy の最大許容解凍サイズ %d を上回っています。
ko: Snappy 압축 파일을 압축 해제할 수 없습니다. 파일 크기가 허용된 최대 snappy 압축 해제 크기(%d)보다 큽니다.
zh_cn: 无法对 Snappy 压缩的文件解压缩。文件大小超出允许的最大 Snappy 解压缩大小 %d。

source: Failed to read Avro file.
de: Avro-Datei konnte nicht gelesen werden.
es: Error al leer el archivo Avro.
fr: Echec de lecture du fichier Avro.
ja: Avro ファイルの読み取りに失敗しました。
ko: Avro 파일을 읽을 수 없습니다.
zh_cn: 无法读取 Avro 文件。

source: Failed to read Parquet file.
de: Parquet-Datei konnte nicht gelesen werden.
es: Error al leer el archivo Parquet.
fr: Echec de lecture du fichier Parquet.
ja: Parquet ファイルの読み取りに失敗しました。
ko: Parquet 파일을 읽을 수 없습니다.
zh_cn: 无法读取 Parquet 文件。

source: Offsets are not supported with Gzip compression.
de: Offsets werden mit Gzip-Komprimierung nicht unterstützt.
es: Los desplazamientos no son compatibles con la compresión Gzip.
fr: Les décalages ne sont pas pris en charge avec la compression Gzip.
ja: Gzip 圧縮はオフセットに対応していません。
ko: 오프셋은 Gzip 압축을 지원하지 않습니다.
zh_cn: 不支持采用 Gzip 压缩的偏移。

source: Failed to decompress file.
de: Datei konnte nicht dekomprimiert werden.
es: Error al descomprimir el archivo.
fr: Echec de la décompression du fichier.
ja: ファイルの解凍に失敗しました。
ko: 파일을 압축 해제할 수 없습니다.
zh_cn: 无法对文件解压缩。

source: Failed to read file.
de: Datei konnte nicht gelesen werden.
es: Error al leer el archivo.
fr: Echec de la lecture du fichier.
ja: ファイルの読み取りに失敗しました。
ko: 파일을 읽을 수 없습니다.
zh_cn: 无法读取文件。

source: First Block
de: Erster Block
es: Primer bloque
fr: Premier bloc
ja: 最初のブロック
ko: 맨 처음 블록
zh_cn: 第一个块

source: Previous Block
de: Vorheriger Block
es: Bloque anterior
fr: Bloc précédent
ja: 前のブロック
ko: 이전 블록
zh_cn: 上一个块

source: Next Block
de: Nächster Block
es: Bloque siguiente
fr: Bloc suivant
ja: 次のブロック
ko: 다음 블록
zh_cn: 下一个块

source: Last Block
de: Letzter Block
es: Último bloque
fr: Dernier bloc
ja: 最後のブロック
ko: 마지막 블록
zh_cn: 最后一个块

source: Cannot perform operation.
de: Operation kann nicht durchgeführt werden.
es: No se puede realizar la operación.
fr: Impossible d'effectuer l'opération.
ja: 操作を実行できません。
ko: 작업을 수행할 수 없습니다.
zh_cn: 无法执行操作。

source: Could not rename folder "%s" to "%s": Hashes are not allowed in filenames.
de: Ordner konnte nicht von "%s" in "%s" umbenannt werden: Rauten sind in Dateinamen nicht zulässig.
es: No se ha podido cambiar el nombre de la carpeta "%s" a "%s": las almohadillas no están permitidas en los nombres de archivo.
fr: Impossible de renommer le dossier "%s" en "%s" : les hachages sont interdits dans les noms de fichier.
ja: ファイル名にはハッシュを使用できないため、フォルダの名前を "%s" から "%s" に変更できません。
ko: 폴더 이름을 "%s"에서 "%s"(으)로 바꿀 수 없습니다. 파일 이름에 해시를 사용할 수 없습니다.
zh_cn: 无法将文件夹 "%s" 重命名为 "%s"：文件名中不允许使用哈希。

source: The destination path "%s" already exists.
de: Der Zielpfad "%s" ist bereits vorhanden.
es: La ruta de destino "%s" ya existe.
fr: Le chemin d'accès de destination "%s" existe déjà.
ja: 目的のパス "%s" はすでに存在します。
ko: 대상 경로 "%s"이(가) 이미 존재합니다.
zh_cn: 目标路径“%s”已存在。

source: Setting of replication factor failed
de: Festlegen des Replikationsfaktors ist fehlgeschlagen
es: Error al establecer el factor de replicación
fr: Échec de la définition du facteur de réplication
ja: レプリケーションファクタを設定できませんでした
ko: 복제 요소의 설정 실패
zh_cn: 设置复制因子失败

source: Could not name folder "%s": Slashes or hashes are not allowed in filenames.
de: Ordner konnte nicht in "%s" umbenannt werden: Schrägstriche oder Rauten sind in Dateinamen nicht zulässig.
es: No se ha podido dar el nombre "%s" a la carpeta: las barras oblicuas y las almohadillas no están permitidas en los nombres de archivo.
fr: Impossible de nommer le dossier "%s" : les barres obliques et les hachages sont interdits dans les noms de fichier.
ja: ファイル名にはスラッシュやハッシュを使用できないため、フォルダの名前を "%s" にできません。
ko: 폴더 이름 "%s"을(를) 지정할 수 없습니다. 파일 이름에 슬래시 또는 해시를 사용할 수 없습니다.
zh_cn: 无法将文件夹命名为 "%s"：文件名中不允许使用斜线或哈希。

source: Could not name file "%s": Slashes are not allowed in filenames.
de: Datei konnte nicht in "%s" umbenannt werden: Schrägstriche sind in Dateinamen nicht zulässig.
es: No se ha podido cambiar el nombre del archivo "%s": las barras oblicuas no están permitidas en los nombres de archivo.
fr: Impossible de nommer le fichier "%s" : les barres obliques sont interdites dans les noms de fichier.
ja: ファイル名にはスラッシュを使用できないため、ファイルの名前を "%s" に設定できません。
ko: 파일 이름을 "%s"로 바꿀 수 없음: 파일 이름에 슬래시를 사용할 수 없습니다.
zh_cn: 无法命名文件 "%s"：文件名中不允许使用斜线。

source: Sorry, no "%(sep)s" in the filename %(name)s.sep
de: Kein "%(sep)s" im Dateinamen %(name)s.sep
es: Lo sentimos, no se pueden "%(sep)s" utilizar en el nombre de archivo %(name)s.sep
fr: Désolé, aucun "%(sep)s" dans le nom de fichier %(name)s.sep
ja: 申し訳ありませんが、"%(sep)s" がファイル名 %(name)s.sep にありません
ko: 파일 이름 %(name)s.sep에 "%(sep)s"이(가) 없습니다.
zh_cn: 很抱歉，文件名 %(name)s.sep 中没有 "%(sep)s"

source: Destination %(name)s already exists.
de: Ziel %(name)s ist bereits vorhanden.
es: El destino %(name)s ya existe.
fr: La destination %(name)s existe déjà.
ja: 宛先 %(name)s はすでに存在します。
ko: 대상 %(name)s이(가) 이미 존재합니다.
zh_cn: 目标 %(name)s 已存在。

source: Copy to %(name)s failed: %(error)s
de: Kopieren nach %(name)s fehlgeschlagen: %(error)s
es: Error al copiar en %(name)s: %(error)s
fr: Echec de la copie vers %(name)s : %(error)s
ja: %(name)s へのコピーに失敗しました：%(error)s
ko: %(name)s에 복사할 수 없습니다: %(error)s
zh_cn: 无法复制到 %(name)s：%(error)s

source: Error in upload form: %s
de: Fehler im Upload-Formular: %s
es: Error en el formulario de carga: %s
fr: Erreur dans le formulaire de chargement : %s
ja: アップロードフォームのエラー: %s
ko: 업로드 양식 %s에 오류 발생
zh_cn: 上载表单错误：%s

source: No "%(sep)s" allowed in the filename %(name)s.sep
de: Kein "%(sep)s" im Dateinamen %(name)s.sep zugelassen
es: No se pueden utilizar "%(sep)s" en el nombre de archivo %(name)s.sep
fr: Le nom de fichier %(name)s.sep ne doit contenir aucun "%(sep)s".
ja: "%(sep)s" はファイル名 %(name)s.sep では使用できません
ko: 파일 이름 %(name)s.sep에 "%(sep)s"을(를) 사용할 수 없습니다.
zh_cn: 文件名 %(name)s.sep 中不允许使用 %(sep)s

source: Could not extract contents of file.
de: Dateiinhalt konnte nicht extrahiert werden.
es: No se ha podido extraer el contenido del archivo.
fr: Impossible d'extraire le contenu du fichier.
ja: ファイルのコンテンツを抽出できませんでした。
ko: 파일 콘텐츠를 압축 해제할 수 없습니다.
zh_cn: 无法提取文件内容。

source: Could not interpret archive type.
de: Archivtyp konnte nicht interpretiert werden.
es: No se ha podido interpretar el tipo de archivo.
fr: Impossible d'interpréter le type d'archive.
ja: アーカイブタイプを認識できませんでした。
ko: 아카이브 유형을 해석할 수 없습니다.
zh_cn: 无法解释存档类型。

source: Exception occurred while extracting archive: %s
de: Beim Extrahieren des Archivs ist eine Ausnahme aufgetreten: %s
es: Se ha producido una excepción al extraer el archivo: %s
fr: Une exception s'est produite lors de l'extraction de l'archive : %s
ja: アーカイブの抽出中に例外が発生しました：%s
ko: 아카이브 압축을 해제하는 동안 예외 발생: %s
zh_cn: 提取存档时发生异常：%s

source: ERROR: Configuration parameter enable_extract_uploaded_archive has to be enabled before calling this method.
de: FEHLER: Der Konfigurationsparameter enable_extract_uploaded_archive mussvor dem Aufruf dieser Methode aktiviert werden.
es: ERROR: Es necesario habilitar el parámetro de configuración enable_extract_uploaded_archive antes de llamar a este método.
fr: ERREUR : le paramètre de configuration enable_extract_uploaded_archive doit être activé avant d'appeler cette méthode.
ja: エラー：このメソッドを呼び出す前に、設定パラメーター enable_extract_uploaded_archive を有効にする必要があります。
ko: 오류: 이 메서드를 호출하기 전에 구성 매개변수 enable_extract_uploaded_archive를 설정해야 합니다.
zh_cn: 错误：调用此方法前必须启用配置参数 enable_extract_uploaded_archive。

source: Exception occurred while compressing files: %s
de: Beim Komprimieren von Dateien ist eine Ausnahme aufgetreten: %s
es: Se ha producido una excepción al comprimir los archivos: %s
fr: Une exception s'est produite lors de la compression des fichiers : %s
ja: ファイルの圧縮中に例外が発生しました：%s
ko: 파일을 압축하는 동안 예외 발생: %s
zh_cn: 压缩文件时发生异常：%s

source: Error: Output directory is not set.
de: Fehler: Ausgabeverzeichnis ist nicht festgelegt.
es: Error: No se ha establecido el directorio de salida.
fr: Erreur : le répertoire de sortie n'est pas défini.
ja: エラー：出力ディレクトリが設定されていません。
ko: 오류: 출력 디렉토리가 설정되어 있지 않습니다.
zh_cn: 错误：未设置输出目录。
