Repository: cloudera/hue
Catalog: apps/filebrowser/src/filebrowser/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko, zh_cn

source: Must implement 'extract' method.
de: Methode 'extract' muss implementiert werden.
es: Debe implementar el método 'extract'.
fr: Doit implémenter la méthode 'extract'.
ja: 'extract' メソッドを実装する必要があります。
ko: 'extract' 메서드를 구현해야 합니다.
zh_cn: 必须实施 “提取”方法。

source: %(filename)s - File Viewer
de: %(filename)s - Datei-Anzeigeprogramm
es: %(filename)s: visor de archivos
fr: %(filename)s - Afficheur de fichiers
ko: %(filename)s - 파일 뷰어
zh_cn: %(filename)s - 文件查看器

source: View as text
de: Als Text anzeigen
es: Ver como texto
fr: Afficher comme texte
ja: テキストとして表示
ko: 텍스트로 보기
zh_cn: 以文本格式查看

source: View as binary
de: Als Binärdatei anzeigen
es: Ver como binario
fr: Afficher comme binaire
ja: バイナリとして表示
ko: 바이너리로 보기
zh_cn: 以二进制格式查看

source: Preview as Gzip
de: Vorschau als Gzip
es: Vista previa como Gzip
fr: Aperçu comme Gzip
ja: Gzip としてプレビュー
ko: Gzip으로 미리 보기
zh_cn: 以 Gzip 格式预览

source: Preview as Bzip2
de: Vorschau als Bzip2
es: Vista previa como Bzip2
fr: Aperçu comme Bzip2
ja: Bzip2 としてプレビュー
ko: Bzip2로 미리 보기
zh_cn: 作为 Bzip2 预览

source: Preview as Avro
de: Vorschau als Avro
es: Vista previa como Avro
fr: Aperçu comme Avro
ja: Avro としてプレビュー
ko: Avro로 미리 보기
zh_cn: 以 Avro 格式预览

source: Stop preview
de: Vorschau anhalten
es: Detener vista previa
fr: Arrêter l'aperçu
ja: プレビューを中止
ko: 미리 보기 중지
zh_cn: 停止预览

source: Edit file
de: Datei bearbeiten
es: Editar archivo
fr: Modifier le fichier
ja: ファイルを編集
ko: 파일 편집
zh_cn: 编辑文件

source: View file
de: Datei anzeigen
es: Ver archivo
fr: Afficher le fichier
ja: ファイルを表示
ko: 파일 보기
zh_cn: 查看文件

source: Download
de: Herunterladen
es: Descargar
fr: Télécharger
ja: ダウンロード
ko: 다운로드
zh_cn: 下载

source: View file location
de: Speicherort der Datei anzeigen
es: Ver ubicación de archivo
fr: Afficher l'emplacement du fichier
ja: ファイルの場所を表示
ko: 파일 위치 보기
zh_cn: 查看文件位置

source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 更新
ko: 새로 고침
zh_cn: 刷新

source: Last modified
de: Zuletzt geändert
es: Última modificación
fr: Dernière modification
ja: 前回の変更
ko: 최종 수정 날짜
zh_cn: 上次修改

source: Size
de: Größe
es: Tamaño
fr: Taille
ja: サイズ
ko: 크기
zh_cn: 大小

source: Mode
de: Modus
es: Modo
ja: モード
ko: 모드
zh_cn: 模式

source: Page
de: Seite
es: Página
ja: ページ
ko: 페이지
zh_cn: 页面

source: to
de: bis
es: a
fr: vers
zh_cn: 至

source: of
de: von
es: de
fr: sur
zh_cn: 的

source: First page
de: Erste Seite
es: Primera página
fr: Première page
ja: 最初のページ
ko: 첫 페이지
zh_cn: 首页

source: Previous page
de: Vorherige Seite
es: Página anterior
fr: Page précédente
ja: 前のページ
ko: 이전 페이지
zh_cn: 上一页

source: Next page
de: Nächste Seite
es: Página siguiente
fr: Page suivante
ja: 次のページ
ko: 다음 페이지
zh_cn: 下一页

source: Last page
de: Letzte Seite
es: Última página
fr: Dernière page
ja: 最後のページ
ko: 마지막 페이지
zh_cn: 末页

source: The current file is empty.
de: Die aktuelle Datei ist leer.
es: El archivo actual está vacío.
fr: Le fichier courant est vide.
ja: 現在のファイルは空です。
ko: 현재 파일이 비어 있습니다.
zh_cn: 当前文件为空。

source: Warning: some binary data has been masked out with '&#xfffd'.
de: Warnung: einige binäre Daten wurden mit '&#xfffd' ausgeblendet.
es: Advertencia: algunos datos binarios se han enmascarado con '&#xfffd'.
fr: Avertissement : certaines données binaires ont été masquées via '&#xfffd'.
ja: 警告：'&#xfffd' でマスクされているバイナリデータがあります。
ko: 경고: 일부 바이너리 데이터는 '&#xfffd'(으)로 마스킹되었을 수 있습니다.
zh_cn: 警告：已使用 '&#xfffd' 将有些二进制数据屏蔽。

source: Output rendered from compressed %s file.
de: Aus komprimierter %s-Datei wiedergegebene Ausgabe.
es: Resultado obtenido del archivo %s comprimido.
fr: Sortie obtenue à partir du fichier %s compressé.
ja: 圧縮された %s ファイルから出力が表示されました。
ko: 압축된 %s 파일에서 렌더링된 출력입니다.
zh_cn: 压缩 %s 文件提供的输出。

source: Sorry, you cannot request for more than %s pages.
de: Leider darf Ihre Anfrage nicht mehr als %s Seiten umfassen.
es: Lo sentimos, no puede solicitar más de %s páginas.
fr: Désolé, vous ne pouvez pas demander plus de %s pages.
ja: 申し訳ありませんが、%s ページを超える要求はできません。
ko: 죄송합니다. %s페이지 이상은 요청할 수 없습니다.
zh_cn: 抱歉，您无法请求超过 %s 个页面。

source: There was an unexpected server error.
de: Ein unerwarteter Serverfehler ist aufgetreten.
es: Se ha producido un error de servidor inesperado.
fr: Erreur inattendue du serveur.
ja: 予期しないサーバーエラーが発生しました。
ko: 예기치 않은 서버 오류가 발생했습니다.
zh_cn: 存在异常服务器错误。

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_cn: 保存

source: Save as
de: Speichern unter
es: Guardar como
fr: Enregistrer sous
ja: 名前を付けて保存
ko: 다른 이름으로 저장
zh_cn: 另存为

source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
zh_cn: 关闭

source: Enter the location where you would like to save the file.
de: Geben Sie den Speicherort ein, an dem die Datei gespeichert werden soll.
es: Introduzca la ubicación en la que desea guardar el archivo.
fr: Indiquez l'emplacement où vous souhaitez enregistrer le fichier.
ja: ファイルの保存先を入力してください。
ko: 파일을 저장할 위치를 입력하십시오.
zh_cn: 输入文件保存位置。

source: Name is required.
de: Der Name ist erforderlich.
es: El nombre es necesario.
fr: Le nom est requis.
ja: 名前が必要です。
ko: 이름을 입력해야 합니다.
zh_cn: 需要提供名称。

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_cn: 取消

source: saved correctly
de: ordnungsgemäß gespeichert
es: guardado correctamente
fr: enregistré correctement
ja: 正しく保存されました
ko: 올바르게 저장됨
zh_cn: 已正确保存

source: S3 region %s
es: Región S3 %s
fr: Région S3 %s
ja: S3 領域 %s
ko: S3 영역 %s
zh_cn: S3 区域 %s

source: Home
de: Startseite
es: Inicio
fr: Accueil
ja: ホーム
ko: 홈
zh_cn: 主页

source: Edit path
de: Pfad bearbeiten
es: Editar ruta
fr: Modifier un chemin d'accès
ja: パスを編集
ko: 경로 편집
zh_cn: 编辑路径

source: View trash
de: Papierkorb anzeigen
es: Ver papelera
fr: Afficher la corbeille
ja: ゴミ箱を表示
ko: 휴지통 보기
zh_cn: 查看垃圾桶

source: Trash
de: Papierkorb
es: Papelera
fr: Corbeille
ja: ゴミ箱
ko: 휴지통
zh_cn: 垃圾桶

source: View History
de: Verlauf anzeigen
es: Ver historial
fr: Afficher l'historique
ja: 履歴を表示
ko: 기록 보기
zh_cn: 查看历史记录

source: History
de: Verlauf
es: Historial
fr: Historique
ja: 履歴
ko: 기록
zh_cn: 历史记录

source: File browser icon
de: Datei-Browser-Symbol
es: Icono del explorador de archivos
fr: Icône Navigateur de fichiers
ja: File Browser アイコン
ko: 파일 브라우저 아이콘
zh_cn: 文件浏览器图标

source: File Browser
de: Datei-Browser
es: Explorador de archivos
fr: Navigateur de fichiers
ko: 파일 브라우저
zh_cn: 文件浏览器

source: File Operation
de: Dateivorgang
es: Operación de archivo
fr: Opération de fichier
ja: ファイル操作
ko: 파일 작업
zh_cn: 文件操作

source: Search for file name
de: Nach Dateinamen suchen
es: Buscar nombre de archivo
fr: Rechercher un nom de fichier
ja: ファイル名を検索
ko: 파일 이름 검색
zh_cn: 搜索文件名

source: Actions
de: Aktionen
es: Acciones
ja: アクション
ko: 작업
zh_cn: 操作

source: Rename
de: Umbenennen
es: Cambiar nombre
fr: Renommer
ja: 名前の変更
ko: 이름 변경
zh_cn: 重命名

source: Move
de: Verschieben
es: Mover
fr: Déplacer
ja: 移動
ko: 이동
zh_cn: 移动

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
ko: 복사
zh_cn: 复制

source: Change owner / group
de: Eigentümer / Gruppe ändern
es: Cambiar propietario/grupo
fr: Modifier le propriétaire/groupe
ja: 所有者／グループを変更
ko: 소유자/그룹 변경
zh_cn: 更改所有者/组

source: Change permissions
de: Berechtigungen ändern
es: Cambiar permisos
fr: Modifier les autorisations
ja: パーミッションを変更
ko: 권한 변경
zh_cn: 更改权限

source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
ja: サマリ
ko: 요약
zh_cn: 摘要

source: Set Replication
de: Replikation festlegen
es: Establecer replicación
fr: Définir la réplication
ja: レプリケーションを設定
ko: 복제 설정
zh_cn: 设置复制

source: Set replication
de: Replikation festlegen
es: Establecer replicación
fr: Définir la réplication
ja: レプリケーションを設定
ko: 복제 설정
zh_cn: 设置复制

source: Compress selection into a single archive
de: Auswahl in ein einzelnes Archiv komprimieren
es: Comprimir selección en un único archivo
fr: Compresser la sélection dans une archive unique
ja: 選択したファイルを単一のアーカイブに圧縮
ko: 선택 항목을 단일 아카이브로 압축
zh_cn: 将所选项压缩至单个存档

source: Compress
de: Komprimieren
es: Comprimir
fr: Compresser
ja: 圧縮
ko: 압축
zh_cn: 压缩

source: Extract selected archive
de: Ausgewähltes Archiv extrahieren
es: Extraer el almacenamiento seleccionado
fr: Extraire l’archive sélectionnée
ja: 選択したアーカイブを抽出
ko: 선택한 아카이브 압축 해제
zh_cn: 提取所选存档

source: Extract
de: Extrahieren
es: Extraer
fr: Extraire
ja: 抽出
ko: 압축 해제
zh_cn: 提取

source: Restore from trash
de: Aus Papierkorb wiederherstellen
es: Restaurar contenido de la papelera
fr: Restaurer à partir de la corbeille
ja: ゴミ箱から復元する
ko: 휴지통 복구
zh_cn: 从垃圾桶还原

source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
ja: 復元
ko: 복구
zh_cn: 还原

source: Delete forever
de: Dauerhaft löschen
es: Eliminar permanentemente
fr: Supprimer définitivement
ja: 完全に削除
ko: 영구적으로 삭제
zh_cn: 永久删除

source: Move to trash
de: In Papierkorb verschieben
es: Mover a papelera
fr: Déplacer vers la corbeille
ja: ゴミ箱に移動
ko: 휴지통으로 이동
zh_cn: 移至垃圾桶

source: Submit
de: Übermitteln
es: Enviar
fr: Envoyer
ja: サブミット
ko: 제출
zh_cn: 提交

source: Open in Editor
de: Im Editor öffnen
es: Abrir en el editor
fr: Ouvrir dans l’éditeur
ja: エディタで開く
ko: 편집기에서 열기
zh_cn: 在编辑器中打开

source: Empty trash
de: Papierkorb leeren
es: Vaciar papelera
fr: Vider la corbeille
ja: ゴミ箱を空にする
ko: 휴지통 비우기
zh_cn: 清空垃圾桶

source: Upload files
de: Dateien hochladen
es: Cargar archivos
fr: Charger les fichiers
ja: ファイルをアップロード
ko: 파일 업로드
zh_cn: 上传文件

source: Upload
de: Hochladen
es: Cargar
fr: Charger
ja: アップロード
ko: 업로드
zh_cn: 上传

source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
ko: 파일
zh_cn: 文件

source: Archive
de: Archivieren
es: Almacenamiento
ja: アーカイブ
ko: 아카이브
zh_cn: 存档

source: Zip/Tgz/Bz2 file
de: Zip/Tgz/Bz2-Datei
es: Archivo Zip/Tgz/Bz2
fr: Fichier zip/tgz/bz2
ja: Zip/Tgz/Bz2 ファイル
ko: Zip/Tgz/Bz2 파일
zh_cn: Zip/Tgz/Bz2 文件

source: New
de: Neu
es: Nuevo
fr: Nouveau
ja: 新規
ko: 새로 만들기
zh_cn: 新建

source: File
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
ko: 파일
zh_cn: 文件

source: Directory
de: Verzeichnis
es: Directorio
fr: Répertoire
ja: ディレクトリ
ko: 디렉토리
zh_cn: 目录

source: Bucket
es: Contenedor
fr: Compartiment
ja: バケット
ko: 버킷
zh_cn: 分段

source: This is Hadoop trash. Files will be under a checkpoint, or timestamp named, directory.
de: Dies ist der Hadoop-Papierkorb. Die Dateien befinden sich unter einem Prüfpunkt oder einem Verzeichnis mit Zeitstempel.
es: Esta es la papelera de Hadoop. Los archivos estarán en un directorio de punto de control o con marca de hora.
fr: Il s'agit de la corbeille Hadoop. Les fichiers seront situés sous un répertoire de point de contrôle ou horodaté.
ja: これは Hadoop のゴミ箱です。ファイルはチェックポイント、またはタイムスタンプの名前が付けられた、ディレクトリ下に入れられます。
ko: Hadoop 휴지통입니다. 파일이 검사점 또는 타임스탬프 명명, 디렉토리에 있게 됩니다.
zh_cn: 这是 Hadoop 垃圾桶。文件将位于 checkpoint 或按时间戳命名的目录下。

source: The permissions for this folder are managed by the Sentry Namenode plugin.
de: Die Berechtigungen für diesen Ordner werden durch das Sentry NamenodePlugin verwaltet.
es: El complemento NameNode de Sentry gestiona los permisos de esta carpeta.
fr: Les autorisations pour ce dossier sont gérées par le module complémentaire Sentry Namenode.
ja: このフォルダのパーミッションは、 Sentry Namenode プラグインによって管理されています。
ko: 이 폴더에 대한 권한은 Sentry Namenode 플러그인에서 관리합니다.
zh_cn: 此文件夹的权限由 Sentry Namenode 插件进行管理。

source: The permissions of some of the selected files are managed by the Sentry Namenode plugin.
de: Die Berechtigungen einiger ausgewählter Dateien werden durch das Sentry NamenodePlugin verwaltet.
es: El complemento NameNode de Sentry gestiona algunos de los archivos seleccionados.
fr: Les autorisations de certains fichiers sélectionnés sont gérées par le module complémentaire Sentry Namenode.
ja: 選択された一部のファイルのパーミッションは、Sentry Namenode プラグインによって管理されています。
ko: 선택한 파일 중 일부에 대한 권한은 Sentry Namenode 플러그인에서 관리합니다.
zh_cn: 某些选定文件的权限由 Sentry Namenode 插件进行管理。

source: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
zh_cn: 名称

source: Permissions
de: Berechtigungen
es: Permisos
fr: Autorisations
ja: パーミッション
ko: 권한
zh_cn: 权限

source: Date
de: Datum
es: Fecha
ja: 日付
ko: 날짜
zh_cn: 日期

source: There are no files matching the search criteria.
de: Es gibt keine Dateien, die den Suchkriterien entsprechen.
es: No hay ningún archivo que coincida con los criterios de búsqueda.
fr: Aucun fichier ne correspond aux critères de recherche.
ja: 検索条件に一致するファイルが存在しません。
ko: 검색 기준과 일치하는 파일이 없습니다.
zh_cn: 没有符合搜索条件的文件。

source: Show
de: Anzeigen
es: Mostrar
fr: Afficher
ja: 表示
ko: 표시
zh_cn: 显示

source: items
de: Elemente
es: elementos
fr: éléments
ja: アイテム
ko: 항목
zh_cn: 项目

source: Extract Archive
de: Archiv extrahieren
es: Extraer archivo
fr: Extraire l'archive
ja: アーカイブを抽出
ko: 아카이브 압축 해제
zh_cn: 提取存档

source: Start a task to extract the contents of this archive.
de: Eine Aufgabe zum Extrahieren des Inhalts dieses Archivs starten.
es: Inicie una tarea para extraer el contenido de este archivo.
fr: Démarrez une tâche pour extraire le contenu de cette archive.
ja: このアーカイブのコンテンツを抽出するタスクを開始します。
ko: 아카이브의 콘텐츠를 압축 해제하려면 작업을 시작하십시오.
zh_cn: 启动一个任务以提取此存档的内容。

source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
zh_cn: 否

source: Yes
de: Ja
es: Sí
fr: Oui
ja: はい
ko: 예
zh_cn: 是

source: Compress Files
de: Dateien komprimieren
es: Comprimir archivos
fr: Compresser les fichiers
ja: ファイルを圧縮
ko: 파일 압축
zh_cn: 压缩文件

source: Archive Name
de: Archivname
es: Nombre de almacenamiento
fr: Nom de l’archive
ja: アーカイブ名
ko: 아카이브 이름
zh_cn: 存档名称

source: Start a task to compress the selected file(s) and/or folder(s)
de: Starten Sie einen Task, um die ausgewählte(n) Datei(en) und/oder Ordner zu komprimieren.
es: Inicie una tarea para comprimir los archivos o las carpetas seleccionados.
fr: Démarrer une tâche pour compresser le ou les fichiers et/ou le ou les dossiers sélectionnés
ja: 選択したファイルとフォルダを圧縮するタスクを開始します
ko: 선택한 파일 및/또는 폴더를 압축하는 작업을 시작합니다.
zh_cn: 启动任务以压缩所选文件和/或文件夹

source: Are you sure you want to override the existing archive?
de: Sind Sie sicher, dass Sie das vorhandene Archiv außer Kraft setzen möchten?
es: ¿Está seguro de que desea sobrescribir el almacenamiento existente?
fr: Voulez-vous vraiment remplacer l’archive existante ?
ja: 既存のアーカイブを上書きしてもよろしいですか?
ko: 기존 아카이브를 재정의하시겠습니까?
zh_cn: 是否确定要覆盖现有存档？

source: Confirm Delete
de: Löschen bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression
ja: 削除を確認
ko: 삭제 확인
zh_cn: 确认删除

source: Are you sure you want to delete these buckets?
de: Möchten Sie diese Buckets wirklich löschen?
es: ¿Está seguro de que desea eliminar estos contenedores?
fr: Voulez-vous vraiment supprimer ces compartiments ?
ja: これらのバケットを削除してもよろしいですか?
ko: 이 버킷을 삭제하시겠습니까?
zh_cn: 是否确定要删除这些分段？

source: Deleting a bucket will delete all of its contents and release the bucket name to be reserved by others.
de: Wenn ein Bucket gelöscht wird, wird der gesamte Inhalt gelöscht und der Name des Buckets wird freigegeben, damit er von anderen reserviert werden kann.
es: Si elimina un contenedor, se eliminará todo su contenido y se liberará el nombre del contenedor para que lo puedan reservar otros.
fr: La suppression d'un compartiment supprimera tout son contenu et libérera son nom pour qu'il puisse être réservé par d'autres.
ja: バケットを削除すると、バケット内のすべてのコンテンツが削除され、他のバケットで使用できるようにバケット名が解放されます。
ko: 버킷을 삭제하면 버킷의 모든 콘텐츠가 삭제되고 버킷 이름이 다른 곳에서 예약될 수 있도록 릴리스됩니다.
zh_cn: 删除分段将删除其所有内容，并释放此分段名称，以便留给其他分段使用。

source: Are you sure you want to delete these files?
de: Sind Sie sicher, dass Sie diese Dateien löschen möchten?
es: ¿Está seguro de que desea eliminar estos archivos?
fr: Voulez-vous vraiment supprimer ces fichiers ?
ja: これらのファイルを削除してもよろしいですか?
ko: 이 파일을 삭제하시겠습니까?
zh_cn: 是否确定要删除这些文件？

source: Are you sure you want to permanently delete these files?
de: Sind Sie sicher, dass Sie diese Dateien dauerhaft löschen möchten?
es: ¿Está seguro de que desea eliminar de forma permanente estos archivos?
fr: Voulez-vous vraiment supprimer ces fichiers de manière permanente ?
ja: これらのファイルを完全に削除してもよろしいですか?
ko: 이들 파일을 영구적으로 삭제하시겠습니까?
zh_cn: 是否确定要永久删除这些文件？

source: and
de: und
es: y
fr: et
ja: および
ko: 및
zh_cn: 并

source: others
de: Andere
es: otros
fr: autres
ja: その他
ko: 기타
zh_cn: 其他

source: Confirm Restore
de: Wiederherstellen bestätigen
es: Confirmar restauración
fr: Confirmer la restauration
ja: 復元を確認
ko: 복구 확인
zh_cn: 确认恢复

source: Are you sure you want to restore these files?
de: Sind Sie sicher, dass Sie diese Dateien wiederherstellen möchten?
es: ¿Está seguro de que desea restaurar estos archivos?
fr: Voulez-vous vraiment restaurer ces fichiers ?
ja: これらのファイルを復元してもよろしいですか?
ko: 이 파일을 복구하시겠습니까?
zh_cn: 是否确定要还原这些文件？

source: Confirm empty trash
de: Leeren des Papierkorbs bestätigen
es: Confirmar vaciado de papelera
fr: Confirmer le vidage de la Corbeille
ja: ゴミ箱を空にする操作を確認
ko: 휴지통 비우기 확인
zh_cn: 确认清空垃圾桶

source: Are you sure you want to permanently delete all your trash?
de: Sind Sie sicher, dass Sie Ihren Papierkorb dauerhaft komplett leeren möchten?
es: ¿Está seguro de que desea eliminar permanentemente todo el contenido de la papelera?
fr: Voulez-vous vraiment supprimer les éléments de la corbeille de manière permanente ?
ja: ゴミ箱にあるものを完全に削除してもよろしいですか?
ko: 휴지통을 영구적으로 모두 삭제하시겠습니까?
zh_cn: 是否确定要永久删除所有垃圾？

source: Delete all
de: Alle löschen
es: Eliminar todo
fr: Supprimer tout
ja: すべてを削除
ko: 모두 삭제
zh_cn: 全部删除

source: Renaming:
de: Umbenennen:
es: Cambiando nombre:
fr: Nouveau nom :
ja: 名前変更中：
ko: 이름 변경:
zh_cn: 正在重命名：

source: already exists.
de: ist bereits vorhanden.
es: ya existe.
fr: existe déjà.
ja: すでに存在しています。
ko: 이미 존재합니다.
zh_cn: 已存在。

source: Setting replication factor for :
de: Replikationsfaktor wird festgelegt für:
es: Estableciendo factor de replicación para:
fr: Définition du facteur de réplication pour :
ja: レプリケーションファクタの設定の対象：
ko: 다음에 대한 복제 요소 설정 중:
zh_cn: 为以下项设置复制因子：

source: Replication factor
de: Replikationsfaktor
es: Factor de replicación
fr: Facteur de réplication
ja: レプリケーションファクタ
ko: 복제 요소
zh_cn: 复制因子

source: Replication factor is required.
de: Replikationsfaktor ist erforderlich.
es: Se necesita el factor de replicación.
fr: Le facteur de réplication est requis.
ja: レプリケーションファクタが必要です。
ko: 복제 요소가 필요합니다.
zh_cn: 需要复制因子。

source: Change Owner/Group
de: Eigentümer/Gruppe ändern
es: Cambiar propietario/grupo
fr: Modifier le propriétaire/groupe
ja: 所有者／グループを変更
ko: 소유자/그룹 변경
zh_cn: 更改所有者/组

source: Note: Only the Hadoop superuser, "%(superuser)s" or the HDFS supergroup, "%(supergroup)s" on this file system, may change the owner of a file.
de: Hinweis: Nur der Hadoop-Superuser "%(superuser)s" oder die HDFS-Supergruppe "%(supergroup)s" in diesem Dateisystem können den Eigentümer einer Datei ändern.
es: Nota: Solo el superusuario de Hadoop, "%(superuser)s" o el supergrupo de HDFS, "%(supergroup)s" de este sistema de archivos, pueden cambiar el propietario de un archivo.
fr: Remarque : seul le superutilisateur Hadoop, "%(superuser)s", ou le supergroupe HDFS, "%(supergroup)s", sur ce système de fichiers peut modifier le propriétaire d'un fichier.
ja: 注意：このファイルシステムでは、Hadoop スーパーユーザー %(superuser)s または HDFS スーパーグループ %(supergroup)s のみが、ファイルの所有者を変更できます。
ko: 참고: 이 파일 시스템의 Hadoop superuser("%(superuser)s") 또는 HDFS supergroup("%(supergroup)s")만 파일의 소유자를 변경할 수 있습니다.
zh_cn: 注意：只有此系统上的 Hadoop 超级用户 "%(superuser)s" 或 HDFS 超级组 "%(supergroup)s" 才可更改文件的所有者。

source: Change Permissions
de: Berechtigungen ändern
es: Cambiar permisos
fr: Modifier les autorisations
ja: パーミッションの変更
ko: 권한 변경
zh_cn: 更改权限

source: Other
de: Andere
es: Otro
fr: Autre
ja: その他
ko: 기타
zh_cn: 其他

source: Read
de: Lesen
es: Leer
fr: Lire
ja: 読み取り
ko: 읽기
zh_cn: 读取

source: Write
de: Schreiben
es: Escribir
fr: Ecrire
ja: 書き込み
ko: 쓰기
zh_cn: 写

source: Execute
de: Ausführen
es: Ejecutar
fr: Exécuter
ja: 実行
ko: 실행
zh_cn: 执行

source: Sticky
zh_cn: 易贴

source: Move to
de: Verschieben zu
es: Mover a
fr: Déplacer vers
ja: 移動先
ko: 이동:
zh_cn: 移至

source: Select a folder or paste a path...
de: Ordner auswählen oder einen Pfad einfügen...
es: Seleccione una carpeta o pegue una ruta...
fr: Sélectionner un dossier ou coller un chemin d'accès...
ja: フォルダを選択するか、 " "パスを貼り付けてください...
ko: 폴더 선택 또는 경로 붙여넣기...
zh_cn: 选择文件夹或粘贴路径...

source: Required
de: Erforderlich
es: Obligatorio
fr: Requis
ja: 必須
ko: 요구됨
zh_cn: 必填

source: Copy to
de: Kopieren zu
es: Copiar en
fr: Copier vers
ja: コピー先
ko: 다음에 복사
zh_cn: 复制到

source: Upload to
de: Hochladen in
es: Cargar a
fr: Charger vers
ja: アップロード先
ko: 업로드 위치
zh_cn: 上传到

source: Enable JavaScript to use the file uploader.
de: JavaScript für die Verwendung des Datei-Uploaders ermöglichen.
es: Permitir que JavaScript utilice el sistema de carga de archivos.
fr: Activez JavaScript pour utiliser le système de chargement de fichiers.
ja: ファイルアップロードを使用するには、JavaScript を有効にしてください。
ko: JavaScript에서 파일 업로더를 사용하도록 설정합니다.
zh_cn: 启用 JavaScript 以使用文件上传器。

source: Upload and extract in
de: Hochladen und extrahieren in
es: Cargar y extraer en
fr: Charger et extraire dans
ja: 次の場所でアップロードして抽出
ko: 업로드 및 압축 해제 위치
zh_cn: 上传并提取

source: Create Directory
de: Verzeichnis erstellen
es: Crear directorio
fr: Créer un répertoire
ja: ディレクトリの作成
ko: 디렉토리 생성
zh_cn: 创建目录

source: Create Bucket
de: Bucket erstellen
es: Crear contenedor
fr: Créer un compartiment
ja: バケットを作成
ko: 버킷 생성
zh_cn: 创建分段

source: Bucket Name
es: Nombre de contenedor
fr: Nom du compartiment
ja: バケット名
ko: 버킷 이름
zh_cn: 分段名称

source: Directory name is required.
de: Verzeichnisname ist erforderlich.
es: El nombre del directorio es necesario.
fr: Le nom du répertoire est requis.
ja: ディレクトリ名が必要です。
ko: 디렉토리 이름을 입력해야 합니다.
zh_cn: 需要提供目录名。

source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 생성
zh_cn: 创建

source: Create File
de: Datei erstellen
es: Crear archivo
fr: Créer un fichier
ja: ファイルを作成
ko: 파일 생성
zh_cn: 创建文件

source: File name is required.
de: Der Dateiname ist erforderlich.
es: Se necesita un nombre de archivo.
fr: Un nom de fichier est requis.
ja: ファイル名が必要です。
ko: 파일 이름을 입력해야 합니다.
zh_cn: 文件名为必填字段。

source: Summary for
de: Zusammenfassung für
es: Resumen de
fr: Résumé pour
ja: サマリの対象
ko: 요약 대상
zh_cn: 摘要

source: Disk space consumed
de: Genutzter Festplattenspeicher
es: Espacio de disco usado
fr: Espace disque utilisé
ja: 使用済みディスク容量
ko: 사용한 디스크 공간
zh_cn: 已消耗的磁盘空间

source: Bytes used
de: Genutzte Byte
es: Bytes usados
fr: Octets utilisés
ja: 使用済みバイト数
ko: 사용한 바이트
zh_cn: 已使用的字节

source: Namespace quota
de: Namespace-Kontingent
es: Cuota de Namespace
fr: Quota de l'espace de nom
ja: Namespace の割り当て
ko: Namespace 할당
zh_cn: 命名空间配额

source: Disk space quota
de: Festplatten-Kontingent
es: Cuota de disco usado
fr: Quota de l'espace disque
ja: ディスク容量の割り当て
ko: 디스크 공간 할당
zh_cn: 磁盘空间配额

source: Number of directories
de: Anzahl Verzeichnisse
es: Número de directorios
fr: Nombre de répertoires
ja: ディレクトリ数
ko: 디렉터리 수
zh_cn: 目录数量

source: Number of files
de: Anzahl Dateien
es: Número de archivos
fr: Nombre de fichiers
ja: ファイルの数
ko: 파일 수
zh_cn: 文件数

source: Change owner
de: Eigentümer ändern
es: Cambiar propietario
fr: Modifier le propriétaire
ja: 所有者を変更
ko: 소유자 변경
zh_cn: 更改所有者

source: Change group
de: Gruppe ändern
es: Cambiar grupo
fr: Modifier le groupe
ja: グループを変更
ko: 그룹 변경
zh_cn: 更改组

source: Clear history...
de: Verlauf löschen...
es: Borrar historial...
fr: Vider l'historique...
ja: 履歴をクリア...
ko: 기록 지우기...
zh_cn: 清除历史记录...

source: Not available.
de: Nicht verfügbar.
es: No disponible.
fr: Indisponible.
ja: 利用できません。
ko: 사용할 수 없습니다.
zh_cn: 不可用。

source: This folder
de: Dieser Ordner
es: Esta carpeta
fr: Ce dossier
ja: このフォルダ
ko: 이 폴더
zh_cn: 此文件夹

source: One level up
de: Eine Ebene nach oben
es: Un nivel superior
fr: Un niveau au-dessus
ja: 1 レベル上へ
ko: 한 레벨 위
zh_cn: 上移一级

source: Items moving to
de: Elemente werden verschoben zu
es: Moviendo elementos a
fr: Eléments déplacés vers
ja: 移動するアイテム
ko: 다음으로 항목 이동 중
zh_cn: 项目移至

source: You cannot copy a folder into itself.
de: Ein Ordner kann nicht in sich selbst kopiert werden.
es: No puede copiar una carpeta en la propia carpeta.
fr: Vous ne pouvez pas copier un dossier à l'intérieur de ce dernier.
ja: フォルダ自体にフォルダをコピーすることはできません。
ko: 폴더를 같은 폴더로 복사할 수 없습니다.
zh_cn: 您无法将文件夹复制到自己当中。
