Repository: cloudera/hue
Catalog: apps/rdbms/src/rdbms/locale/*/LC_MESSAGES/django.po
Languages: fr, ja, ko, pt

source: A POST request is required.
fr: Requête POST requise.
ja: POST 要求が必要です。
ko: POST 요청이 필요합니다.
pt: É necessário um pedido POST.

source: There was an error with your query.
fr: Une erreur est survenue avec votre requête.
ja: クエリにエラーがありました。
ko: 쿼리에 오류가 있습니다.
pt: Ocorreu um erro com a sua consulta.

source: A GET request is required.
fr: Requête GET requise.
ja: GET 要求が必要です。
ko: GET 요청이 필요합니다.
pt: É necessário um pedido GET.

source: Server specified doesn't exist.
fr: Le serveur spécifié n'existe pas.
ja: 指定されたサーバーが存在しません。
ko: 지정된 서버가 존재하지 않습니다.
pt: O servidor especificado não existe.

source: No databases are available. Permissions could be missing.
fr: Aucune base de données n'est disponible. Des autorisations peuvent être manquantes.
ja: データベースを使用できません。パーミッションがない可能性があります。
ko: 데이터베이스를 사용할 수 없습니다. 권한이 없습니다.
pt: Não estão disponíveis bases de dados. Podem estar em falta permissões.

source: Query Editor
fr: Editeur de requêtes
ko: 쿼리 편집기
pt: Editor de consultas

source: Invalid design type %(type)s
fr: Type de conception incorrect : %(type)s
ja: 無効な設計タイプ %(type)s
ko: 올바르지 않은 디자인 유형 %(type)s
pt: Tipo de design inválido %(type)s

source: DBQuery icon
ja: DBQuery アイコン
ko: DBQuery 아이콘

source: DB Query
fr: Requête de BD
ja: DB クエリ
ko: DB 쿼리
pt: Consulta DB

source: My Queries
fr: Mes requêtes
ja: マイクエリ
ko: 내 쿼리
pt: As minhas consultas

source: Saved Queries
fr: Requêtes enregistrées
ja: 保存したクエリ
ko: 저장된 쿼리
pt: Consultas guardadas

source: History
fr: Historique
ja: 履歴
ko: 기록
pt: Histórico

source: Query
fr: Requête
ja: クエリ
ko: 쿼리
pt: Consultar

source: There are currently no databases configured.
fr: Il n'existe actuellement aucune base de données configurée.
ja: 現在設定されているデータベースはありません。
ko: 현재 데이터베이스가 구성되지 않았습니다.
pt: Actualmente, não está configurada nenhuma base de dados.

source: Please go to your Hue configuration and add a database under the "rdbms" section.
fr: Accédez à votre configuration Hue et ajoutez une base de données sous la section "rdbms".
ja: Hueの設定に移動して「rdbms」セクションの下にデータベースを追加してください。
ko: 해당 Hue 구성으로 이동하여 "rdbms" 섹션에 데이터베이스를 추가하십시오.
pt: Aceda à sua configuração Hue e adicione uma base de dados dentro da secção "rdbms".

source: Assist
ja: アシスト
ko: 지원

source: Double click on a table name or field to insert it in the editor
fr: Double-cliquer sur un nom de table ou un champ pour l'insérer dans l'éditeur
ja: テーブル名またはフィールドをダブルクリックしてエディタに挿入
ko: 테이블 이름 또는 필드를 두 번 클릭하여 편집기에 삽입
pt: Faça duplo clique num nome ou campo da tabela para o inserir no editor

source: Manually refresh the table list
fr: Actualiser manuellement la liste de tables
ja: テーブルリストを手動で更新
ko: 테이블 목록을 수동으로 새로 고침
pt: Actualizar manualmente a lista da tabela

source: server
ja: サーバー
ko: 서버

source: Choose a database...
ja: データベースを選択...
ko: 데이터베이스 선택...

source: database
ja: データベース
ko: 데이터베이스

source: Table name...
fr: Nom de la table...
ja: テーブル名...
ko: 테이블 이름...
pt: Nome da tabela...

source: The selected database has no tables.
fr: La base de données sélectionnée n'a pas de tables.
ja: 選択したデータベースにはテーブルがありません。
ko: 선택한 데이터베이스에 테이블이 없습니다.
pt: A base de dados seleccionada não tem tabelas.

source: Query name
fr: Nom de la requête
ja: クエリ名
ko: 쿼리 이름
pt: Nome da consulta

source: Query description
fr: Description de la requête
ja: クエリの説明
ko: 쿼리 설명
pt: Descrição da consulta

source: Your query has the following error(s):
fr: Votre requête comporte les erreurs suivantes :
ja: クエリには次のエラーがあります：
ko: 쿼리에 다음 오류가 있습니다.
pt: A sua consulta tem o(s) seguinte(s) erro(s):

source: Execute
fr: Exécuter
ja: 実行
ko: 실행
pt: Executar

source: Save
fr: Enregistrer
ja: 保存
ko: 저장
pt: Guardar

source: Save as...
fr: Enregistrer sous...
ja: 名前を付けて保存...
ko: 다른 이름으로 저장...
pt: Guardar como...

source: Explain
fr: Expliquer
ja: 実行計画
ko: 설명
pt: Explicar

source: or create a
fr: ou créer une
ja: または作成
ko: 또는 생성
pt: ou criar uma

source: New query
fr: Nouvelle requête
ja: 新しいクエリ
ko: 새 쿼리 생성
pt: Nova consulta

source: The server returned no results.
fr: Le serveur n'a renvoyé aucun résultat.
ja: サーバーから結果が返却されませんでした。
ko: 서버에서 반환된 결과가 없습니다.
pt: O servidor não devolveu resultados.

source: Close
ja: 閉じる
ko: 닫기

source: Save your query
fr: Enregistrer votre requête
ja: クエリを保存
ko: 쿼리 저장
pt: Guarde a sua consulta

source: Name
fr: Nom
ja: 名前
ko: 이름
pt: Nome

source: Description
ja: 説明
ko: 설명
pt: Descrição

source: Cancel
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar

source: Example: SELECT * FROM tablename, or press CTRL + space
fr: Exemple : SELECT * FROM nom_de_table ou appuyez sur CTRL + espace
ja: 例：SELECT * FROM テーブル名、または CTRL キーを押したまま Space キーを押す
ko: 예: SELECT * FROM 테이블 이름 또는 Ctrl + space 누르기
pt: Exemplo: SELECT * FROM nome de tabela, ou prima CTRL + espaço

source: Did you know?
fr: Le saviez-vous ?
ja: 便利な使い方
ko: 유용한 정보
pt: Sabia?

source: No query provided to save.
fr: Aucune requête fournie pour l'enregistrement.
ja: 保存するクエリが指定されていません。
ko: 저장할 쿼리를 제공하지 않았습니다.
pt: Nenhuma consulta fornecida para guardar.

source: Oops, no server found!
ja: サーバーが見つかりません。
ko: 서버를 찾을 수 없습니다!

source: Oops, no database found!
ja: データベースが見つかりません。
ko: 데이터베이스가 없습니다!

source: This field is required.
fr: Ce champ est obligatoire.
ja: このフィールドは必須です。
ko: 이 필드는 필수 항목입니다.
pt: Este campo é obrigatório.

source: Empty description
fr: Vider la description
ja: 空の説明
ko: 설명 없음
pt: Descrição vazia

source: Query saved successfully!
fr: Requête enregistrée.
ja: クエリが正常に保存されました。
ko: 쿼리가 저장되었습니다!
pt: Consulta guardada com êxito!

source: No data available
fr: Aucune donnée disponible
ja: 利用可能なデータがありません
ko: 데이터를 이용할 수 없음
pt: Não existem dados disponíveis

source: No matching records
fr: Aucun enregistrement correspondant
ja: 一致するレコードがありません
ko: 일치하는 레코드가 없음
pt: Não existem registos correspondentes

source: Server error occurred:
ja: サーバーエラーが発生しました：
ko: 서버 오류 발생:

source: Unmanageable server error occurred:
ja: 管理不能なサーバーエラーが発生しました：
ko: 관리할 수 없는 서버 오류 발생:

source: Server
fr: Serveur
pt: Servidor

source: Database
fr: Base de données
pt: Base de dados

source: Navigator
fr: Navigateur

source: Server error occured:
fr: Une erreur de serveur est survenue :
pt: Ocorreu erro no servidor:

source: Unmanageable server error occured:
fr: Une erreur de serveur non gérable est survenue :
pt: Ocorreu erro não gerível no servidor:
