Repository: cloudera/hue
Catalog: desktop/libs/liboozie/src/liboozie/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, ja, ko

source: URL of Oozie server. This is required for job submission. Empty value disables the config check.
de: URL des Oozie Server. Diese ist erforderlich für die Jobübermittlung. Durch einen Leerwert wird die Konfigurationsprüfung deaktiviert.
es: URL del servidor Oozie. Se necesita para el envío de jobs. Si el valor está vacío, se desactiva la comprobación de configuración.
fr: URL du serveur Oozie. Requise pour l'envoi du job. L'absence de valeur désactive la vérification de la configuration.
ja: Oozie サーバーの URL です。これはジョブのサブミットに必要です。空白の値を指定すると、設定チェックが無効になります。
ko: Oozie 서버의 URL입니다. 작업 제출 시 필요합니다. 빈 값은 구성 확인을 해제합니다.

source: Whether Oozie requires client to perform Kerberos authentication.
de: Ob Oozie für die Durchführung der Kerberos-Authentifizierung einen Client benötigt
es: Indica si Oozie necesita que el cliente realice la autenticación de Kerberos.
fr: Indique si Oozie nécessite le client pour effectuer l'authentification Kerberos.
ja: Oozie が Kerberos 認証の実行をクライアントに要求するかどうかの指定です。
ko: Oozie에서 클라이언트의 Kerberos 인증 수행을 요구하는지 여부를 나타냅니다.

source: Location on HDFS where the workflows/coordinators are deployed when submitted by a non-owner. Parameters are $TIME, $USER and $JOBID, e.g. /user/$USER/hue/deployments/$JOBID-$TIME
de: Speicherort auf dem HDFS, an dem Workflows/Coordinators bereitgestellt werden, wenn sie von einem Nicht-Eigentümer übermittelt werden. Mögliche Parameter:$TIME, $USER und $JOBID, z.B. /user/$USER/hue/deployments/$JOBID-$TIME
es: Ubicación en HDFS, donde se implementan los workflows/coordinators cuando no los envía el propietario. Los parámetros son $TIME, $USER y $JOBID, p. ej., /user/$USER/hue/deployments/$JOBID-$TIME
fr: Emplacement HDFS où les workflows/coordinators sont déployés lorsqu'ils sont envoyés par un non-propriétaire. Les paramètres sont $TIME, $USER et $JOBID, par exemple /user/$USER/hue/deployments/$JOBID-$TIME
ja: 非所有者によるサブミット時に Workflow／Coordinator が配置される HDFS 上の場所です。パラメータは、$TIME、$USER、および$JOBIDです（たとえば、/user/$USER/hue/deployments/$JOBID-$TIMEのようになります）
ko: 비소유자가 제출했을 경우 Workflow/Coordinator가 배포되는 HDFS상의 위치입니다. 매개변수는 $TIME, $USER 및 $JOBID(예: /user/$USER/hue/deployments/$JOBID-$TIME)입니다.

source: Whether Hue append jar paths to the oozie.libpath instead of copying them into the workspace. This makes submissions faster and less prone to HDFS permission errors
de: Gibt an, ob Hue jar-Pfade an oozie.libpath anhängt, anstatt sie in den Workspacezu kopieren. Dadurch werden Einsendungen schneller und weniger anfällig für falsche HDFS-Berechtigungen
es: Si Hue agrega rutas de jar a la oozie.libpath en lugar de copiarlas en el área de trabajo. Así, se realizan envíos más rápidos y los errores de permiso de HDFS son menos habituales
fr: Indique si Hue ajoute ou non des chemins d'accès jar à oozie.libpath au lieu de les copier dans l'espace de travail. Cela permet d'accélérer les envois et d'être moins exposé aux erreurs d'autorisation HDFS
ja: jar のパスをワークスペースにコピーする代わりに、Hue で oozie.libpath に追加するかどうかの指定です。これにより、サブミッションが高速になり、HDFS のパーミッションのエラーも少なくなります
ko: Hue가 jar 경로를 작업 영역에 복사하는 대신 oozie.libpath에 추가할지 여부. 제출 속도가 빨라지고 HDFS 권한 오류가 줄어듭니다.

source: The Oozie server is not available
de: Der Oozie-Server ist nicht verfügbar.
es: El servidor Oozie no está disponible
fr: Le serveur Oozie n'est pas disponible
ja: Oozie サーバーが利用できません
ko: Oozie Server를 사용할 수 없습니다.

source: Oozie Share Lib path is not available
de: Pfad der Oozie-Freigabebibliothek ist nicht verfügbar
es: La ruta a Share Lib de Oozie no está disponible
fr: Le chemin d'accès à la bibliothèque de partages Oozie n'est pas disponible
ja: Oozie 共有ライブラリパスは利用できません
ko: Oozie Share Lib 경로를 사용할 수 없음

source: Oozie Share Lib not installed in default location.
de: Oozie-Freigabebibliothek ist nicht am Standardspeicherort installiert.
es: Share Lib de Oozie no instalada en la ubicación predeterminada.
fr: Bibliothèque de partages Oozie non installée dans l'emplacement par défaut.
ja: Oozie 共有ライブラリがデフォルトの場所にインストールされていません。
ko: Oozie Share Lib가 기본 위치에 설치되어 있지 않습니다.

source: Submission already submitted (Oozie job id %s)
de: Übermittlung bereits übermittelt (Oozie-Job-ID %s)
es: Envío ya enviado (ID de trabajo de Oozie %s)
fr: Envoi déjà effectué (ID de job Oozie %s).
ja: サブミット済みのサブミッションです（Oozie ジョブ ID %s）
ko: 이미 제출됨(Oozie Job ID %s)

source: Failed to create deployment directory: %s
de: Auf Bereitstellungsverzeichnis konnte nicht zugegriffen werden: %s
es: Error al crear al directorio de implementación: %s
fr: Echec de la création du répertoire de déploiement : %s
ja: 配置ディレクトリを作成できませんでした：%s
ko: 배포 디렉토리 %s을(를) 생성하지 못했습니다.

source: Path is not a directory: %s.
de: Pfad ist kein Verzeichnis: %s.
es: La ruta no es un directorio: %s.
fr: Le chemin n'est pas un répertoire : %s.
ja: パスはディレクトリ %s ではありません。
ko: 경로가 디렉토리가 아닙니다: %s.

source: Error accessing directory '%s': %s.
de: Fehler beim Zugriff auf Verzeichnis "%s": %s.
es: Error al acceder al directorio '%s': %s.
fr: Erreur d'accès au répertoire '%s' : %s.
ja: ディレクトリ '%s ': %s へのアクセス時にエラーが発生しました。
ko: 디렉토리 '%s'에 액세스하는 중 오류 발생: %s

source: Insufficient permission.
de: Unzureichende Berechtigung.
es: Permiso insuficiente.
fr: Autorisation insuffisante.
ja: パーミッションが不十分です。
ko: 권한 부족.

source: Permission denied. User %(username)s cannot modify user %(user)s's job.
de: Berechtigung abgelehnt. Benutzer %(username)s kann den Job von Benutzer %(user)s nicht ändern.
es: Permiso denegado. El usuario %(username)s no puede modificar el job del usuario %(user)s.
fr: Autorisation refusée. L'utilisateur %(username)s ne peut pas modifier le job de l'utilisateur %(user)s.
ja: パーミッションが拒否されました。ユーザー %(username)s はユーザー %(user)s のジョブを変更できません。
ko: 권한이 거부되었습니다. 사용자 %(username)s은(는) 사용자 %(user)s의 Job을 수정할 수 없습니다.
